<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

    <EnumValue name="round_toward_infinity" init="2"/>
    <EnumValue name="round_toward_neg_infinity" init="3"/>
  </Enumeration>
  <Enumeration id="_1328" name="._66" context="_2" location="f65:3239" file="f65" line="3239" artificial="1" size="32" align="32">
    <EnumValue name="_S_chunk_size" init="7"/>
  </Enumeration>
  <Function id="_1329" name="frexp" returns="_387" context="_2" mangled="_ZSt5frexpePi" demangled="std::frexp(long double, int*)" location="f60:282" file="f60" line="282" endline="283" inline="1">
    <Argument name="__x" type="_387" location="f60:282" file="f60" line="282"/>
    <Argument name="__exp" type="_1368" location="f60:282" file="f60" line="282"/>
  </Function>
  <Function id="_1330" name="frexp" returns="_178" context="_2" mangled="_ZSt5frexpfPi" demangled="std::frexp(float, int*)" location="f60:278" file="f60" line="278" endline="279" inline="1">
    <Argument name="__x" type="_178" location="f60:278" file="f60" line="278"/>
    <Argument name="__exp" type="_1368" location="f60:278" file="f60" line="278"/>
  </Function>
  <Struct id="_1331" name="__true_type" context="_2" mangled="St11__true_type" demangled="std::__true_type" location="f62:83" file="f62" line="83" artificial="1" size="8" align="8" members="_3943 _3944 _3945 _3946 " bases=""/>
  <Function id="_1332" name="__throw_range_error" returns="_1374" context="_2" mangled="_ZSt19__throw_range_errorPKc" demangled="std::__throw_range_error(char const*)" location="f58:82" file="f58" line="82" extern="1" attributes="__noreturn__">
    <Argument type="_1348" location="f58:82" file="f58" line="82"/>
  </Function>
  <Class id="_1333" name="auto_ptr&lt;void&gt;" context="_2" mangled="St8auto_ptrIvE" demangled="std::auto_ptr&lt;void&gt;" location="f71:287" file="f71" line="287" artificial="1" size="8" align="8" members="_3947 _3948 _3949 _3950 _3951 " bases=""/>
  <Class id="_1334" name="bad_exception" context="_2" mangled="St13bad_exception" demangled="std::bad_exception" location="f57:75" file="f57" line="75" artificial="1" size="32" align="32" members="_3952 _3953 _3954 _3955 _3956 " bases="_1281 ">
    <Base type="_1281" access="public" virtual="0" offset="0"/>
  </Class>
  <Struct id="_1335" name="__truth_type&lt;true&gt;" context="_2" mangled="St12__truth_typeILb1EE" demangled="std::__truth_type&lt;true&gt;" location="f62:92" file="f62" line="92" artificial="1" size="8" align="8" members="_3957 _3958 _3959 _3960 _3961 " bases=""/>
  <Struct id="_1336" name="__is_char&lt;wchar_t&gt;" context="_2" mangled="St9__is_charIwE" demangled="std::__is_char&lt;wchar_t&gt;" location="f62:366" file="f62" line="366" artificial="1" size="8" align="8" members="_3962 _3963 _3964 _3965 _3966 _3967 " bases=""/>
  <Struct id="_1337" name="__is_char&lt;char&gt;" context="_2" mangled="St9__is_charIcE" demangled="std::__is_char&lt;char&gt;" location="f62:358" file="f62" line="358" artificial="1" size="8" align="8" members="_3968 _3969 _3970 _3971 _3972 _3973 " bases=""/>
  <Function id="_1338" name="fmod" returns="_387" context="_2" mangled="_ZSt4fmodee" demangled="std::fmod(long double, long double)" location="f60:272" file="f60" line="272" endline="273" inline="1">
    <Argument name="__x" type="_387" location="f60:272" file="f60" line="272"/>
    <Argument name="__y" type="_387" location="f60:272" file="f60" line="272"/>
  </Function>
  <Function id="_1339" name="fmod" returns="_178" context="_2" mangled="_ZSt4fmodff" demangled="std::fmod(float, float)" location="f60:268" file="f60" line="268" endline="269" inline="1">
    <Argument name="__x" type="_178" location="f60:268" file="f60" line="268"/>
    <Argument name="__y" type="_178" location="f60:268" file="f60" line="268"/>
  </Function>
  <Function id="_1340" name="modf" returns="_387" context="_2" mangled="_ZSt4modfePe" demangled="std::modf(long double, long double*)" location="f60:346" file="f60" line="346" endline="347" inline="1">
    <Argument name="__x" type="_387" location="f60:346" file="f60" line="346"/>
    <Argument name="__iptr" type="_1596" location="f60:346" file="f60" line="346"/>
  </Function>
  <Function id="_1341" name="modf" returns="_178" context="_2" mangled="_ZSt4modffPf" demangled="std::modf(float, float*)" location="f60:342" file="f60" line="342" endline="343" inline="1">
    <Argument name="__x" type="_178" location="f60:342" file="f60" line="342"/>
    <Argument name="__iptr" type="_1576" location="f60:342" file="f60" line="342"/>
  </Function>
  <Typedef id="_1342" name="terminate_handler" type="_1194" context="_2" location="f57:88" file="f57" line="88"/>
  <Function id="_1343" name="abs" returns="_26" context="_246" mangled="_ZN9__gnu_cxx3absEx" demangled="__gnu_cxx::abs(long long)" location="f68:173" file="f68" line="173" endline="173" inline="1">
    <Argument name="__x" type="_26" location="f68:173" file="f68" line="173"/>
  </Function>
  <Function id="_1344" name="abs" returns="_67" context="_2" mangled="_ZSt3absl" demangled="std::abs(long)" location="f68:139" file="f68" line="139" endline="139" inline="1">
    <Argument name="__i" type="_67" location="f68:139" file="f68" line="139"/>
  </Function>
  <Function id="_1345" name="abs" returns="_387" context="_2" mangled="_ZSt3abse" demangled="std::abs(long double)" location="f60:90" file="f60" line="90" endline="91" inline="1">
    <Argument name="__x" type="_387" location="f60:90" file="f60" line="90"/>
  </Function>
  <Function id="_1346" name="abs" returns="_178" context="_2" mangled="_ZSt3absf" demangled="std::abs(float)" location="f60:86" file="f60" line="86" endline="87" inline="1">
    <Argument name="__x" type="_178" location="f60:86" file="f60" line="86"/>
  </Function>
  <Function id="_1347" name="abs" returns="_195" context="_2" mangled="_ZSt3absd" demangled="std::abs(double)" location="f60:82" file="f60" line="82" endline="83" inline="1" attributes="nothrow const">
    <Argument name="__x" type="_195" location="f60:82" file="f60" line="82"/>
  </Function>
  <PointerType id="_1348" type="_2453c" size="32" align="32"/>
  <Field id="_1349" name="tv_sec" type="_647" offset="0" context="_12" access="public" location="f3:77" file="f3" line="77"/>
  <Field id="_1350" name="tv_usec" type="_1010" offset="32" context="_12" access="public" location="f3:78" file="f3" line="78"/>
  <Destructor id="_1351" name="timeval" artificial="1" throw="" context="_12" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f3:76" file="f3" line="76" endline="76" inline="1">
  </Destructor>
  <OperatorMethod id="_1352" name="=" returns="_3975" artificial="1" throw="" context="_12" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f3:76" file="f3" line="76" endline="76" inline="1">
    <Argument type="_3976" location="f3:76" file="f3" line="76"/>
  </OperatorMethod>
  <Constructor id="_1353" name="timeval" artificial="1" throw="" context="_12" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f3:76" file="f3" line="76" endline="76" inline="1">
    <Argument type="_3976" location="f3:76" file="f3" line="76"/>
  </Constructor>
  <Constructor id="_1354" name="timeval" artificial="1" throw="" context="_12" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f3:76" file="f3" line="76" inline="1"/>
  <FundamentalType id="_1355" name="bool" size="8" align="8"/>
  <Field id="_1356" name="fptr" type="_2255" offset="0" context="_18" access="public" location="f5:351" file="f5" line="351"/>
  <Field id="_1357" name="rptr" type="_2255" offset="32" context="_18" access="public" location="f5:352" file="f5" line="352"/>
  <Field id="_1358" name="state" type="_2255" offset="64" context="_18" access="public" location="f5:353" file="f5" line="353"/>
  <Field id="_1359" name="rand_type" type="_113" offset="96" context="_18" access="public" location="f5:354" file="f5" line="354"/>
  <Field id="_1360" name="rand_deg" type="_113" offset="128" context="_18" access="public" location="f5:355" file="f5" line="355"/>
  <Field id="_1361" name="rand_sep" type="_113" offset="160" context="_18" access="public" location="f5:356" file="f5" line="356"/>
  <Field id="_1362" name="end_ptr" type="_2255" offset="192" context="_18" access="public" location="f5:357" file="f5" line="357"/>
  <Destructor id="_1363" name="random_data" artificial="1" throw="" context="_18" access="public" mangled="_ZN11random_dataD1Ev *INTERNAL* " demangled="random_data::~random_data()" location="f5:350" file="f5" line="350" endline="350" inline="1">
  </Destructor>
  <OperatorMethod id="_1364" name="=" returns="_3977" artificial="1" throw="" context="_18" access="public" mangled="_ZN11random_dataaSERKS_" demangled="random_data::operator=(random_data const&amp;)" location="f5:350" file="f5" line="350" endline="350" inline="1">
    <Argument type="_3978" location="f5:350" file="f5" line="350"/>
  </OperatorMethod>
  <Constructor id="_1365" name="random_data" artificial="1" throw="" context="_18" access="public" mangled="_ZN11random_dataC1ERKS_ *INTERNAL* " demangled="random_data::random_data(random_data const&amp;)" location="f5:350" file="f5" line="350" endline="350" inline="1">
    <Argument type="_3978" location="f5:350" file="f5" line="350"/>
  </Constructor>
  <Constructor id="_1366" name="random_data" artificial="1" throw="" context="_18" access="public" mangled="_ZN11random_dataC1Ev *INTERNAL* " demangled="random_data::random_data()" location="f5:350" file="f5" line="350" inline="1"/>
  <FundamentalType id="_1367" name="wchar_t" size="32" align="32"/>
  <PointerType id="_1368" type="_113" size="32" align="32"/>
  <CvQualifiedType id="_1348r" type="_1348" restrict="1"/>
  <PointerType id="_1370" type="_685" size="32" align="32"/>
  <CvQualifiedType id="_1370r" type="_1370" restrict="1"/>
  <FundamentalType id="_1372" name="complex float" size="64" align="32"/>
  <FundamentalType id="_1373" name="complex long double" size="192" align="32"/>
  <FundamentalType id="_1374" name="void" align="8"/>
  <CvQualifiedType id="_685r" type="_685" restrict="1"/>
  <Field id="_1376" name="__size" type="_3979" offset="0" context="_37" access="public" location="f8:103" file="f8" line="103"/>
  <Field id="_1377" name="__align" type="_67" offset="0" context="_37" access="public" location="f8:104" file="f8" line="104"/>
  <Destructor id="_1378" name="._59" artificial="1" throw="" context="_37" access="public" mangled="_ZN18pthread_condattr_tD1Ev *INTERNAL* " demangled="pthread_condattr_t::~pthread_condattr_t()" location="f8:105" file="f8" line="105" endline="105" inline="1">
  </Destructor>
  <OperatorMethod id="_1379" name="=" returns="_3980" artificial="1" throw="" context="_37" access="public" mangled="_ZN18pthread_condattr_taSERKS_" demangled="pthread_condattr_t::operator=(pthread_condattr_t const&amp;)" location="f8:105" file="f8" line="105" endline="105" inline="1">
    <Argument type="_3981" location="f8:102" file="f8" line="102"/>
  </OperatorMethod>
  <Constructor id="_1380" name="._59" artificial="1" throw="" context="_37" access="public" mangled="_ZN18pthread_condattr_tC1ERKS_ *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t(pthread_condattr_t const&amp;)" location="f8:105" file="f8" line="105" endline="105" inline="1">
    <Argument type="_3981" location="f8:102" file="f8" line="102"/>
  </Constructor>
  <Constructor id="_1381" name="._59" artificial="1" throw="" context="_37" access="public" mangled="_ZN18pthread_condattr_tC1Ev *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t()" location="f8:105" file="f8" line="105" inline="1"/>
  <Field id="_1382" name="__size" type="_3982" offset="0" context="_38" access="public" location="f8:143" file="f8" line="143"/>
  <Field id="_1383" name="__align" type="_67" offset="0" context="_38" access="public" location="f8:144" file="f8" line="144"/>
  <Destructor id="_1384" name="._62" artificial="1" throw="" context="_38" access="public" mangled="_ZN20pthread_rwlockattr_tD1Ev *INTERNAL* " demangled="pthread_rwlockattr_t::~pthread_rwlockattr_t()" location="f8:145" file="f8" line="145" endline="145" inline="1">
  </Destructor>
  <OperatorMethod id="_1385" name="=" returns="_3983" artificial="1" throw="" context="_38" access="public" mangled="_ZN20pthread_rwlockattr_taSERKS_" demangled="pthread_rwlockattr_t::operator=(pthread_rwlockattr_t const&amp;)" location="f8:145" file="f8" line="145" endline="145" inline="1">
    <Argument type="_3984" location="f8:142" file="f8" line="142"/>
  </OperatorMethod>
  <Constructor id="_1386" name="._62" artificial="1" throw="" context="_38" access="public" mangled="_ZN20pthread_rwlockattr_tC1ERKS_ *INTERNAL* " demangled="pthread_rwlockattr_t::pthread_rwlockattr_t(pthread_rwlockattr_t const&amp;)" location="f8:145" file="f8" line="145" endline="145" inline="1">
    <Argument type="_3984" location="f8:142" file="f8" line="142"/>
  </Constructor>
  <Constructor id="_1387" name="._62" artificial="1" throw="" context="_38" access="public" mangled="_ZN20pthread_rwlockattr_tC1Ev *INTERNAL* " demangled="pthread_rwlockattr_t::pthread_rwlockattr_t()" location="f8:145" file="f8" line="145" inline="1"/>
  <Field id="_1388" name="ex" type="_226" offset="0" context="_43" access="public" location="f9:264" file="f9" line="264"/>
  <Field id="_1389" name="ey" type="_226" offset="64" context="_43" access="public" location="f9:264" file="f9" line="264"/>
  <Destructor id="_1390" name="b2Mat22" artificial="1" throw="" context="_43" access="public" mangled="_ZN7b2Mat22D1Ev *INTERNAL* " demangled="b2Mat22::~b2Mat22()" location="f9:195" file="f9" line="195" endline="195" inline="1">
  </Destructor>
  <OperatorMethod id="_1391" name="=" returns="_3985" artificial="1" throw="" context="_43" access="public" mangled="_ZN7b2Mat22aSERKS_" demangled="b2Mat22::operator=(b2Mat22 const&amp;)" location="f9:195" file="f9" line="195" endline="195" inline="1">
    <Argument type="_2262" location="f9:195" file="f9" line="195"/>
  </OperatorMethod>
  <Constructor id="_1392" name="b2Mat22" artificial="1" throw="" context="_43" access="public" mangled="_ZN7b2Mat22C1ERKS_ *INTERNAL* " demangled="b2Mat22::b2Mat22(b2Mat22 const&amp;)" location="f9:195" file="f9" line="195" endline="195" inline="1">
    <Argument type="_2262" location="f9:195" file="f9" line="195"/>
  </Constructor>
  <Constructor id="_1393" name="b2Mat22" explicit="1" context="_43" access="public" mangled="_ZN7b2Mat22C1Ev *INTERNAL* " demangled="b2Mat22::b2Mat22()" location="f9:197" file="f9" line="197" endline="197" inline="1"/>
  <Constructor id="_1394" name="b2Mat22" explicit="1" context="_43" access="public" mangled="_ZN7b2Mat22C1ERK6b2Vec2S2_ *INTERNAL* " demangled="b2Mat22::b2Mat22(b2Vec2 const&amp;, b2Vec2 const&amp;)" location="f9:200" file="f9" line="200" endline="203" inline="1">
    <Argument name="c1" type="_1469" location="f9:200" file="f9" line="200"/>
    <Argument name="c2" type="_1469" location="f9:200" file="f9" line="200"/>
  </Constructor>
  <Constructor id="_1395" name="b2Mat22" explicit="1" context="_43" access="public" mangled="_ZN7b2Mat22C1Effff *INTERNAL* " demangled="b2Mat22::b2Mat22(float, float, float, float)" location="f9:207" file="f9" line="207" endline="210" inline="1">
    <Argument name="a11" type="_179" location="f9:207" file="f9" line="207"/>
    <Argument name="a12" type="_179" location="f9:207" file="f9" line="207"/>
    <Argument name="a21" type="_179" location="f9:207" file="f9" line="207"/>
    <Argument name="a22" type="_179" location="f9:207" file="f9" line="207"/>
  </Constructor>
  <Method id="_1396" name="Set" returns="_1374" context="_43" access="public" mangled="_ZN7b2Mat223SetERK6b2Vec2S2_" demangled="b2Mat22::Set(b2Vec2 const&amp;, b2Vec2 const&amp;)" location="f9:214" file="f9" line="214" endline="217" inline="1">
    <Argument name="c1" type="_1469" location="f9:214" file="f9" line="214"/>
    <Argument name="c2" type="_1469" location="f9:214" file="f9" line="214"/>
  </Method>
  <Method id="_1397" name="SetIdentity" returns="_1374" context="_43" access="public" mangled="_ZN7b2Mat2211SetIdentityEv" demangled="b2Mat22::SetIdentity()" location="f9:221" file="f9" line="221" endline="224" inline="1"/>
  <Method id="_1398" name="SetZero" returns="_1374" context="_43" access="public" mangled="_ZN7b2Mat227SetZeroEv" demangled="b2Mat22::SetZero()" location="f9:228" file="f9" line="228" endline="231" inline="1"/>
  <Method id="_1399" name="GetInverse" returns="_43" const="1" context="_43" access="public" mangled="_ZNK7b2Mat2210GetInverseEv" demangled="b2Mat22::GetInverse() const" location="f9:234" file="f9" line="234" endline="245" inline="1"/>
  <Method id="_1400" name="Solve" returns="_226" const="1" context="_43" access="public" mangled="_ZNK7b2Mat225SolveERK6b2Vec2" demangled="b2Mat22::Solve(b2Vec2 const&amp;) const" location="f9:250" file="f9" line="250" endline="261" inline="1">
    <Argument name="b" type="_1469" location="f9:250" file="f9" line="250"/>
  </Method>
  <Field id="_1401" name="joint1" type="_3986" offset="160" context="_46" access="public" location="f10:37" file="f10" line="37"/>
  <Field id="_1402" name="joint2" type="_3986" offset="192" context="_46" access="public" location="f10:40" file="f10" line="40"/>
  <Field id="_1403" name="ratio" type="_179" offset="224" context="_46" access="public" location="f10:44" file="f10" line="44"/>
  <Destructor id="_1404" name="b2GearJointDef" artificial="1" throw="" context="_46" access="public" mangled="_ZN14b2GearJointDefD1Ev *INTERNAL* " demangled="b2GearJointDef::~b2GearJointDef()" location="f10:27" file="f10" line="27" endline="27" inline="1">
  </Destructor>
  <OperatorMethod id="_1405" name="=" returns="_3987" artificial="1" throw="" context="_46" access="public" mangled="_ZN14b2GearJointDefaSERKS_" demangled="b2GearJointDef::operator=(b2GearJointDef const&amp;)" location="f10:27" file="f10" line="27" endline="27" inline="1">
    <Argument type="_3988" location="f10:27" file="f10" line="27"/>
  </OperatorMethod>
  <Constructor id="_1406" name="b2GearJointDef" artificial="1" throw="" context="_46" access="public" mangled="_ZN14b2GearJointDefC1ERKS_ *INTERNAL* " demangled="b2GearJointDef::b2GearJointDef(b2GearJointDef const&amp;)" location="f10:27" file="f10" line="27" endline="27" inline="1">
    <Argument type="_3988" location="f10:27" file="f10" line="27"/>
  </Constructor>
  <Constructor id="_1407" name="b2GearJointDef" explicit="1" context="_46" access="public" mangled="_ZN14b2GearJointDefC1Ev *INTERNAL* " demangled="b2GearJointDef::b2GearJointDef()" location="f10:28" file="f10" line="28" endline="33" inline="1"/>
  <Field id="_1408" name="ex" type="_227" offset="0" context="_51" access="public" location="f9:298" file="f9" line="298"/>
  <Field id="_1409" name="ey" type="_227" offset="96" context="_51" access="public" location="f9:298" file="f9" line="298"/>
  <Field id="_1410" name="ez" type="_227" offset="192" context="_51" access="public" location="f9:298" file="f9" line="298"/>
  <Destructor id="_1411" name="b2Mat33" artificial="1" throw="" context="_51" access="public" mangled="_ZN7b2Mat33D1Ev *INTERNAL* " demangled="b2Mat33::~b2Mat33()" location="f9:269" file="f9" line="269" endline="269" inline="1">
  </Destructor>
  <OperatorMethod id="_1412" name="=" returns="_3989" artificial="1" throw="" context="_51" access="public" mangled="_ZN7b2Mat33aSERKS_" demangled="b2Mat33::operator=(b2Mat33 const&amp;)" location="f9:269" file="f9" line="269" endline="269" inline="1">
    <Argument type="_2260" location="f9:269" file="f9" line="269"/>
  </OperatorMethod>
  <Constructor id="_1413" name="b2Mat33" artificial="1" throw="" context="_51" access="public" mangled="_ZN7b2Mat33C1ERKS_ *INTERNAL* " demangled="b2Mat33::b2Mat33(b2Mat33 const&amp;)" location="f9:269" file="f9" line="269" endline="269" inline="1">
    <Argument type="_2260" location="f9:269" file="f9" line="269"/>
  </Constructor>
  <Constructor id="_1414" name="b2Mat33" explicit="1" context="_51" access="public" mangled="_ZN7b2Mat33C1Ev *INTERNAL* " demangled="b2Mat33::b2Mat33()" location="f9:271" file="f9" line="271" endline="271" inline="1"/>
  <Constructor id="_1415" name="b2Mat33" explicit="1" context="_51" access="public" mangled="_ZN7b2Mat33C1ERK6b2Vec3S2_S2_ *INTERNAL* " demangled="b2Mat33::b2Mat33(b2Vec3 const&amp;, b2Vec3 const&amp;, b2Vec3 const&amp;)" location="f9:274" file="f9" line="274" endline="278" inline="1">
    <Argument name="c1" type="_2261" location="f9:274" file="f9" line="274"/>
    <Argument name="c2" type="_2261" location="f9:274" file="f9" line="274"/>
    <Argument name="c3" type="_2261" location="f9:274" file="f9" line="274"/>
  </Constructor>
  <Method id="_1416" name="SetZero" returns="_1374" context="_51" access="public" mangled="_ZN7b2Mat337SetZeroEv" demangled="b2Mat33::SetZero()" location="f9:282" file="f9" line="282" endline="286" inline="1"/>
  <Method id="_1417" name="Solve33" returns="_227" const="1" context="_51" access="public" mangled="_ZNK7b2Mat337Solve33ERK6b2Vec3" demangled="b2Mat33::Solve33(b2Vec3 const&amp;) const" location="f9:291" file="f9" line="291" extern="1">
    <Argument name="b" type="_2261" location="f9:291" file="f9" line="291"/>
  </Method>
  <Method id="_1418" name="Solve22" returns="_226" const="1" context="_51" access="public" mangled="_ZNK7b2Mat337Solve22ERK6b2Vec2" demangled="b2Mat33::Solve22(b2Vec2 const&amp;) const" location="f9:296" file="f9" line="296" extern="1">
    <Argument name="b" type="_1469" location="f9:296" file="f9" line="296"/>
  </Method>
  <Variable id="_1419" name="s_registers" type="_3990" context="_54" access="protected" mangled="_ZN9b2Contact11s_registersE" demangled="b2Contact::s_registers" location="f4:186" file="f4" line="186" static="1" extern="1"/>
  <Variable id="_1420" name="s_initialized" type="_1355" context="_54" access="protected" mangled="_ZN9b2Contact13s_initializedE" demangled="b2Contact::s_initialized" location="f4:187" file="f4" line="187" static="1" extern="1"/>
  <Field id="_1421" name="m_flags" type="_527" offset="32" context="_54" access="protected" location="f4:189" file="f4" line="189"/>
  <Field id="_1422" name="m_prev" type="_2224" offset="64" context="_54" access="protected" location="f4:192" file="f4" line="192"/>
  <Field id="_1423" name="m_next" type="_2224" offset="96" context="_54" access="protected" location="f4:193" file="f4" line="193"/>
  <Field id="_1424" name="m_nodeA" type="_769" offset="128" context="_54" access="protected" location="f4:196" file="f4" line="196"/>
  <Field id="_1425" name="m_nodeB" type="_769" offset="256" context="_54" access="protected" location="f4:197" file="f4" line="197"/>
  <Field id="_1426" name="m_fixtureA" type="_2225" offset="384" context="_54" access="protected" location="f4:199" file="f4" line="199"/>
  <Field id="_1427" name="m_fixtureB" type="_2225" offset="416" context="_54" access="protected" location="f4:200" file="f4" line="200"/>
  <Field id="_1428" name="m_indexA" type="_114" offset="448" context="_54" access="protected" location="f4:202" file="f4" line="202"/>
  <Field id="_1429" name="m_indexB" type="_114" offset="480" context="_54" access="protected" location="f4:203" file="f4" line="203"/>
  <Field id="_1430" name="m_manifold" type="_878" offset="512" context="_54" access="protected" location="f4:205" file="f4" line="205"/>
  <Field id="_1431" name="m_toiCount" type="_114" offset="1024" context="_54" access="protected" location="f4:207" file="f4" line="207"/>
  <Field id="_1432" name="m_toi" type="_179" offset="1056" context="_54" access="protected" location="f4:208" file="f4" line="208"/>
  <Field id="_1433" name="m_friction" type="_179" offset="1088" context="_54" access="protected" location="f4:210" file="f4" line="210"/>
  <Field id="_1434" name="m_restitution" type="_179" offset="1120" context="_54" access="protected" location="f4:211" file="f4" line="211"/>
  <Enumeration id="_1435" name="._70" context="_54" access="protected" location="f4:149" file="f4" line="149" artificial="1" size="32" align="32">
    <EnumValue name="e_islandFlag" init="1"/>
    <EnumValue name="e_touchingFlag" init="2"/>
    <EnumValue name="e_enabledFlag" init="4"/>
    <EnumValue name="e_filterFlag" init="8"/>
    <EnumValue name="e_bulletHitFlag" init="16"/>
    <EnumValue name="e_toiFlag" init="32"/>
  </Enumeration>
  <OperatorMethod id="_1436" name="=" returns="_3991" artificial="1" throw="" context="_54" access="public" mangled="_ZN9b2ContactaSERKS_" demangled="b2Contact::operator=(b2Contact const&amp;)" location="f4:78" file="f4" line="78" endline="78" inline="1">
    <Argument type="_3992" location="f4:78" file="f4" line="78"/>
  </OperatorMethod>
  <Constructor id="_1437" name="b2Contact" artificial="1" throw="" context="_54" access="public" mangled="_ZN9b2ContactC1ERKS_ *INTERNAL* " demangled="b2Contact::b2Contact(b2Contact const&amp;)" location="f4:78" file="f4" line="78" endline="78" inline="1">
    <Argument type="_3992" location="f4:78" file="f4" line="78"/>
  </Constructor>
  <Method id="_1438" name="GetManifold" returns="_1852" context="_54" access="public" mangled="_ZN9b2Contact11GetManifoldEv" demangled="b2Contact::GetManifold()" location="f4:214" file="f4" line="214" endline="216" inline="1"/>
  <Method id="_1439" name="GetManifold" returns="_2960" const="1" context="_54" access="public" mangled="_ZNK9b2Contact11GetManifoldEv" demangled="b2Contact::GetManifold() const" location="f4:219" file="f4" line="219" endline="221" inline="1"/>
  <Method id="_1440" name="GetWorldManifold" returns="_1374" const="1" context="_54" access="public" mangled="_ZNK9b2Contact16GetWorldManifoldEP15b2WorldManifold" demangled="b2Contact::GetWorldManifold(b2WorldManifold*) const" location="f4:224" file="f4" line="224" endline="231" inline="1">
    <Argument name="worldManifold" type="_3993" location="f4:224" file="f4" line="224"/>
  </Method>
  <Method id="_1441" name="IsTouching" returns="_1355" const="1" context="_54" access="public" mangled="_ZNK9b2Contact10IsTouchingEv" demangled="b2Contact::IsTouching() const" location="f4:251" file="f4" line="251" endline="253" inline="1"/>
  <Method id="_1442" name="SetEnabled" returns="_1374" context="_54" access="public" mangled="_ZN9b2Contact10SetEnabledEb" demangled="b2Contact::SetEnabled(bool)" location="f4:234" file="f4" line="234" endline="236" inline="1">
    <Argument name="flag" type="_1355" location="f4:234" file="f4" line="234"/>
  </Method>
  <Method id="_1443" name="IsEnabled" returns="_1355" const="1" context="_54" access="public" mangled="_ZNK9b2Contact9IsEnabledEv" demangled="b2Contact::IsEnabled() const" location="f4:246" file="f4" line="246" endline="248" inline="1"/>
  <Method id="_1444" name="GetNext" returns="_2224" context="_54" access="public" mangled="_ZN9b2Contact7GetNextEv" demangled="b2Contact::GetNext()" location="f4:256" file="f4" line="256" endline="258" inline="1"/>
  <Method id="_1445" name="GetNext" returns="_3994" const="1" context="_54" access="public" mangled="_ZNK9b2Contact7GetNextEv" demangled="b2Contact::GetNext() const" location="f4:261" file="f4" line="261" endline="263" inline="1"/>
  <Method id="_1446" name="GetFixtureA" returns="_2225" context="_54" access="public" mangled="_ZN9b2Contact11GetFixtureAEv" demangled="b2Contact::GetFixtureA()" location="f4:266" file="f4" line="266" endline="268" inline="1"/>
  <Method id="_1447" name="GetFixtureA" returns="_3995" const="1" context="_54" access="public" mangled="_ZNK9b2Contact11GetFixtureAEv" demangled="b2Contact::GetFixtureA() const" location="f4:271" file="f4" line="271" endline="273" inline="1"/>
  <Method id="_1448" name="GetChildIndexA" returns="_114" const="1" context="_54" access="public" mangled="_ZNK9b2Contact14GetChildIndexAEv" demangled="b2Contact::GetChildIndexA() const" location="f4:281" file="f4" line="281" endline="283" inline="1"/>
  <Method id="_1449" name="GetFixtureB" returns="_2225" context="_54" access="public" mangled="_ZN9b2Contact11GetFixtureBEv" demangled="b2Contact::GetFixtureB()" location="f4:276" file="f4" line="276" endline="278" inline="1"/>
  <Method id="_1450" name="GetFixtureB" returns="_3995" const="1" context="_54" access="public" mangled="_ZNK9b2Contact11GetFixtureBEv" demangled="b2Contact::GetFixtureB() const" location="f4:286" file="f4" line="286" endline="288" inline="1"/>
  <Method id="_1451" name="GetChildIndexB" returns="_114" const="1" context="_54" access="public" mangled="_ZNK9b2Contact14GetChildIndexBEv" demangled="b2Contact::GetChildIndexB() const" location="f4:291" file="f4" line="291" endline="293" inline="1"/>
  <Method id="_1452" name="SetFriction" returns="_1374" context="_54" access="public" mangled="_ZN9b2Contact11SetFrictionEf" demangled="b2Contact::SetFriction(float)" location="f4:301" file="f4" line="301" endline="303" inline="1">
    <Argument name="friction" type="_179" location="f4:301" file="f4" line="301"/>
  </Method>
  <Method id="_1453" name="GetFriction" returns="_179" const="1" context="_54" access="public" mangled="_ZNK9b2Contact11GetFrictionEv" demangled="b2Contact::GetFriction() const" location="f4:306" file="f4" line="306" endline="308" inline="1"/>
  <Method id="_1454" name="ResetFriction" returns="_1374" context="_54" access="public" mangled="_ZN9b2Contact13ResetFrictionEv" demangled="b2Contact::ResetFriction()" location="f4:311" file="f4" line="311" endline="313" inline="1"/>
  <Method id="_1455" name="SetRestitution" returns="_1374" context="_54" access="public" mangled="_ZN9b2Contact14SetRestitutionEf" demangled="b2Contact::SetRestitution(float)" location="f4:316" file="f4" line="316" endline="318" inline="1">
    <Argument name="restitution" type="_179" location="f4:316" file="f4" line="316"/>
  </Method>
  <Method id="_1456" name="GetRestitution" returns="_179" const="1" context="_54" access="public" mangled="_ZNK9b2Contact14GetRestitutionEv" demangled="b2Contact::GetRestitution() const" location="f4:321" file="f4" line="321" endline="323" inline="1"/>
  <Method id="_1457" name="ResetRestitution" returns="_1374" context="_54" access="public" mangled="_ZN9b2Contact16ResetRestitutionEv" demangled="b2Contact::ResetRestitution()" location="f4:326" file="f4" line="326" endline="328" inline="1"/>
  <Method id="_1458" name="Evaluate" returns="_1374" virtual="1" pure_virtual="1" overrides="" context="_54" access="public" mangled="_ZN9b2Contact8EvaluateEP10b2ManifoldRK11b2TransformS4_" demangled="b2Contact::Evaluate(b2Manifold*, b2Transform const&amp;, b2Transform const&amp;)" location="f4:139" file="f4" line="139" extern="1">
    <Argument name="manifold" type="_1852" location="f4:139" file="f4" line="139"/>
    <Argument name="xfA" type="_1854" location="f4:139" file="f4" line="139"/>
    <Argument name="xfB" type="_1854" location="f4:139" file="f4" line="139"/>
  </Method>
  <Method id="_1459" name="FlagForFiltering" returns="_1374" context="_54" access="protected" mangled="_ZN9b2Contact16FlagForFilteringEv" demangled="b2Contact::FlagForFiltering()" location="f4:296" file="f4" line="296" endline="298" inline="1"/>
  <Method id="_1460" name="AddType" returns="_1374" static="1" context="_54" access="protected" mangled="_ZN9b2Contact7AddTypeEPFPS_P9b2FixtureiS2_iP16b2BlockAllocatorEPFvS0_S4_EN7b2Shape4TypeESA_" demangled="b2Contact::AddType(b2Contact* (*)(b2Fixture*, int, b2Fixture*, int, b2BlockAllocator*), void (*)(b2Contact*, b2BlockAllocator*), b2Shape::Type, b2Shape::Type)" location="f4:174" file="f4" line="174" extern="1">
    <Argument name="createFcn" type="_3996" location="f4:174" file="f4" line="174"/>
    <Argument name="destroyFcn" type="_3997" location="f4:174" file="f4" line="174"/>
    <Argument name="typeA" type="_2378" location="f4:174" file="f4" line="174"/>
    <Argument name="typeB" type="_2378" location="f4:174" file="f4" line="174"/>
  </Method>
  <Method id="_1461" name="InitializeRegisters" returns="_1374" static="1" context="_54" access="protected" mangled="_ZN9b2Contact19InitializeRegistersEv" demangled="b2Contact::InitializeRegisters()" location="f4:175" file="f4" line="175" extern="1"/>
  <Method id="_1462" name="Create" returns="_2224" static="1" context="_54" access="protected" mangled="_ZN9b2Contact6CreateEP9b2FixtureiS1_iP16b2BlockAllocator" demangled="b2Contact::Create(b2Fixture*, int, b2Fixture*, int, b2BlockAllocator*)" location="f4:176" file="f4" line="176" extern="1">
    <Argument name="fixtureA" type="_2225" location="f4:176" file="f4" line="176"/>
    <Argument name="indexA" type="_114" location="f4:176" file="f4" line="176"/>
    <Argument name="fixtureB" type="_2225" location="f4:176" file="f4" line="176"/>
    <Argument name="indexB" type="_114" location="f4:176" file="f4" line="176"/>
    <Argument name="allocator" type="_2226" location="f4:176" file="f4" line="176"/>
  </Method>
  <Method id="_1463" name="Destroy" returns="_1374" static="1" context="_54" access="protected" mangled="_ZN9b2Contact7DestroyEPS_N7b2Shape4TypeES2_P16b2BlockAllocator" demangled="b2Contact::Destroy(b2Contact*, b2Shape::Type, b2Shape::Type, b2BlockAllocator*)" location="f4:177" file="f4" line="177" extern="1">
    <Argument name="contact" type="_2224" location="f4:177" file="f4" line="177"/>
    <Argument name="typeA" type="_2378" location="f4:177" file="f4" line="177"/>
    <Argument name="typeB" type="_2378" location="f4:177" file="f4" line="177"/>
    <Argument name="allocator" type="_2226" location="f4:177" file="f4" line="177"/>
  </Method>
  <Method id="_1464" name="Destroy" returns="_1374" static="1" context="_54" access="protected" mangled="_ZN9b2Contact7DestroyEPS_P16b2BlockAllocator" demangled="b2Contact::Destroy(b2Contact*, b2BlockAllocator*)" location="f4:178" file="f4" line="178" extern="1">
    <Argument name="contact" type="_2224" location="f4:178" file="f4" line="178"/>
    <Argument name="allocator" type="_2226" location="f4:178" file="f4" line="178"/>
  </Method>
  <Constructor id="_1465" name="b2Contact" explicit="1" context="_54" access="protected" mangled="_ZN9b2ContactC1Ev *INTERNAL* " demangled="b2Contact::b2Contact()" location="f4:180" file="f4" line="180" endline="180" inline="1"/>
  <Constructor id="_1466" name="b2Contact" explicit="1" context="_54" access="protected" mangled="_ZN9b2ContactC1EP9b2FixtureiS1_i *INTERNAL* " demangled="b2Contact::b2Contact(b2Fixture*, int, b2Fixture*, int)" location="f4:181" file="f4" line="181" extern="1">
    <Argument name="fixtureA" type="_2225" location="f4:181" file="f4" line="181"/>
    <Argument name="indexA" type="_114" location="f4:181" file="f4" line="181"/>
    <Argument name="fixtureB" type="_2225" location="f4:181" file="f4" line="181"/>
    <Argument name="indexB" type="_114" location="f4:181" file="f4" line="181"/>
  </Constructor>
  <Destructor id="_1467" name="b2Contact" virtual="1" overrides="" context="_54" access="protected" mangled="_ZN9b2ContactD1Ev *INTERNAL* " demangled="b2Contact::~b2Contact()" location="f4:182" file="f4" line="182" endline="182" inline="1">
  </Destructor>
  <Method id="_1468" name="Update" returns="_1374" context="_54" access="protected" mangled="_ZN9b2Contact6UpdateEP17b2ContactListener" demangled="b2Contact::Update(b2ContactListener*)" location="f4:184" file="f4" line="184" extern="1">
    <Argument name="listener" type="_3998" location="f4:184" file="f4" line="184"/>
  </Method>
  <ReferenceType id="_1469" type="_226c" size="32" align="32"/>
  <Field id="_1470" name="m_typeA" type="_920" offset="512" context="_57" access="protected" location="f10:78" file="f10" line="78"/>
  <Field id="_1471" name="m_typeB" type="_920" offset="544" context="_57" access="protected" location="f10:79" file="f10" line="79"/>
  <Field id="_1472" name="m_bodyC" type="_3999" offset="576" context="_57" access="protected" location="f10:83" file="f10" line="83"/>
  <Field id="_1473" name="m_bodyD" type="_3999" offset="608" context="_57" access="protected" location="f10:84" file="f10" line="84"/>
  <Field id="_1474" name="m_localAnchorA" type="_226" offset="640" context="_57" access="protected" location="f10:87" file="f10" line="87"/>
  <Field id="_1475" name="m_localAnchorB" type="_226" offset="704" context="_57" access="protected" location="f10:88" file="f10" line="88"/>
  <Field id="_1476" name="m_localAnchorC" type="_226" offset="768" context="_57" access="protected" location="f10:89" file="f10" line="89"/>
  <Field id="_1477" name="m_localAnchorD" type="_226" offset="832" context="_57" access="protected" location="f10:90" file="f10" line="90"/>
  <Field id="_1478" name="m_localAxisC" type="_226" offset="896" context="_57" access="protected" location="f10:92" file="f10" line="92"/>
  <Field id="_1479" name="m_localAxisD" type="_226" offset="960" context="_57" access="protected" location="f10:93" file="f10" line="93"/>
  <Field id="_1480" name="m_referenceAngleA" type="_179" offset="1024" context="_57" access="protected" location="f10:95" file="f10" line="95"/>
  <Field id="_1481" name="m_referenceAngleB" type="_179" offset="1056" context="_57" access="protected" location="f10:96" file="f10" line="96"/>
  <Field id="_1482" name="m_constant" type="_179" offset="1088" context="_57" access="protected" location="f10:98" file="f10" line="98"/>
  <Field id="_1483" name="m_ratio" type="_179" offset="1120" context="_57" access="protected" location="f10:99" file="f10" line="99"/>
  <Field id="_1484" name="m_impulse" type="_179" offset="1152" context="_57" access="protected" location="f10:101" file="f10" line="101"/>
  <Field id="_1485" name="m_indexA" type="_114" offset="1184" context="_57" access="protected" location="f10:104" file="f10" line="104"/>
  <Field id="_1486" name="m_indexB" type="_114" offset="1216" context="_57" access="protected" location="f10:104" file="f10" line="104"/>
  <Field id="_1487" name="m_indexC" type="_114" offset="1248" context="_57" access="protected" location="f10:104" file="f10" line="104"/>
  <Field id="_1488" name="m_indexD" type="_114" offset="1280" context="_57" access="protected" location="f10:104" file="f10" line="104"/>
  <Field id="_1489" name="m_lcA" type="_226" offset="1312" context="_57" access="protected" location="f10:105" file="f10" line="105"/>
  <Field id="_1490" name="m_lcB" type="_226" offset="1376" context="_57" access="protected" location="f10:105" file="f10" line="105"/>
  <Field id="_1491" name="m_lcC" type="_226" offset="1440" context="_57" access="protected" location="f10:105" file="f10" line="105"/>
  <Field id="_1492" name="m_lcD" type="_226" offset="1504" context="_57" access="protected" location="f10:105" file="f10" line="105"/>
  <Field id="_1493" name="m_mA" type="_179" offset="1568" context="_57" access="protected" location="f10:106" file="f10" line="106"/>
  <Field id="_1494" name="m_mB" type="_179" offset="1600" context="_57" access="protected" location="f10:106" file="f10" line="106"/>
  <Field id="_1495" name="m_mC" type="_179" offset="1632" context="_57" access="protected" location="f10:106" file="f10" line="106"/>
  <Field id="_1496" name="m_mD" type="_179" offset="1664" context="_57" access="protected" location="f10:106" file="f10" line="106"/>
  <Field id="_1497" name="m_iA" type="_179" offset="1696" context="_57" access="protected" location="f10:107" file="f10" line="107"/>
  <Field id="_1498" name="m_iB" type="_179" offset="1728" context="_57" access="protected" location="f10:107" file="f10" line="107"/>
  <Field id="_1499" name="m_iC" type="_179" offset="1760" context="_57" access="protected" location="f10:107" file="f10" line="107"/>
  <Field id="_1500" name="m_iD" type="_179" offset="1792" context="_57" access="protected" location="f10:107" file="f10" line="107"/>
  <Field id="_1501" name="m_JvAC" type="_226" offset="1824" context="_57" access="protected" location="f10:108" file="f10" line="108"/>
  <Field id="_1502" name="m_JvBD" type="_226" offset="1888" context="_57" access="protected" location="f10:108" file="f10" line="108"/>
  <Field id="_1503" name="m_JwA" type="_179" offset="1952" context="_57" access="protected" location="f10:109" file="f10" line="109"/>
  <Field id="_1504" name="m_JwB" type="_179" offset="1984" context="_57" access="protected" location="f10:109" file="f10" line="109"/>
  <Field id="_1505" name="m_JwC" type="_179" offset="2016" context="_57" access="protected" location="f10:109" file="f10" line="109"/>
  <Field id="_1506" name="m_JwD" type="_179" offset="2048" context="_57" access="protected" location="f10:109" file="f10" line="109"/>
  <Field id="_1507" name="m_mass" type="_179" offset="2080" context="_57" access="protected" location="f10:110" file="f10" line="110"/>
  <OperatorMethod id="_1508" name="=" returns="_4000" artificial="1" throw="" context="_57" access="public" mangled="_ZN11b2GearJointaSERKS_" demangled="b2GearJoint::operator=(b2GearJoint const&amp;)" location="f10:57" file="f10" line="57" endline="57" inline="1">
    <Argument type="_4001" location="f10:57" file="f10" line="57"/>
  </OperatorMethod>
  <Constructor id="_1509" name="b2GearJoint" artificial="1" throw="" context="_57" access="public" mangled="_ZN11b2GearJointC1ERKS_ *INTERNAL* " demangled="b2GearJoint::b2GearJoint(b2GearJoint const&amp;)" location="f10:57" file="f10" line="57" endline="57" inline="1">
    <Argument type="_4001" location="f10:57" file="f10" line="57"/>
  </Constructor>
  <Method id="_1510" name="GetAnchorA" returns="_226" const="1" virtual="1" overrides="_2801 " context="_57" access="public" mangled="_ZNK11b2GearJoint10GetAnchorAEv" demangled="b2GearJoint::GetAnchorA() const" location="f10:59" file="f10" line="59" extern="1"/>
  <Method id="_1511" name="GetAnchorB" returns="_226" const="1" virtual="1" overrides="_2802 " context="_57" access="public" mangled="_ZNK11b2GearJoint10GetAnchorBEv" demangled="b2GearJoint::GetAnchorB() const" location="f10:60" file="f10" line="60" extern="1"/>
  <Method id="_1512" name="GetReactionForce" returns="_226" const="1" virtual="1" overrides="_2803 " context="_57" access="public" mangled="_ZNK11b2GearJoint16GetReactionForceEf" demangled="b2GearJoint::GetReactionForce(float) const" location="f10:62" file="f10" line="62" extern="1">
    <Argument name="inv_dt" type="_179" location="f10:62" file="f10" line="62"/>
  </Method>
  <Method id="_1513" name="GetReactionTorque" returns="_179" const="1" virtual="1" overrides="_2804 " context="_57" access="public" mangled="_ZNK11b2GearJoint17GetReactionTorqueEf" demangled="b2GearJoint::GetReactionTorque(float) const" location="f10:63" file="f10" line="63" extern="1">
    <Argument name="inv_dt" type="_179" location="f10:63" file="f10" line="63"/>
  </Method>
  <Method id="_1514" name="SetRatio" returns="_1374" context="_57" access="public" mangled="_ZN11b2GearJoint8SetRatioEf" demangled="b2GearJoint::SetRatio(float)" location="f10:66" file="f10" line="66" extern="1">
    <Argument name="ratio" type="_179" location="f10:66" file="f10" line="66"/>
  </Method>
  <Method id="_1515" name="GetRatio" returns="_179" const="1" context="_57" access="public" mangled="_ZNK11b2GearJoint8GetRatioEv" demangled="b2GearJoint::GetRatio() const" location="f10:67" file="f10" line="67" extern="1"/>
  <Constructor id="_1516" name="b2GearJoint" context="_57" access="protected" mangled="_ZN11b2GearJointC1EPK14b2GearJointDef *INTERNAL* " demangled="b2GearJoint::b2GearJoint(b2GearJointDef const*)" location="f10:72" file="f10" line="72" extern="1">
    <Argument name="data" type="_4002" location="f10:72" file="f10" line="72"/>
  </Constructor>
  <Method id="_1517" name="InitVelocityConstraints" returns="_1374" virtual="1" overrides="_2815 " context="_57" access="protected" mangled="_ZN11b2GearJoint23InitVelocityConstraintsERK12b2SolverData" demangled="b2GearJoint::InitVelocityConstraints(b2SolverData const&amp;)" location="f10:74" file="f10" line="74" extern="1">
    <Argument name="data" type="_4003" location="f10:74" file="f10" line="74"/>
  </Method>
  <Method id="_1518" name="SolveVelocityConstraints" returns="_1374" virtual="1" overrides="_2816 " context="_57" access="protected" mangled="_ZN11b2GearJoint24SolveVelocityConstraintsERK12b2SolverData" demangled="b2GearJoint::SolveVelocityConstraints(b2SolverData const&amp;)" location="f10:75" file="f10" line="75" extern="1">
    <Argument name="data" type="_4003" location="f10:75" file="f10" line="75"/>
  </Method>
  <Method id="_1519" name="SolvePositionConstraints" returns="_1355" virtual="1" overrides="_2817 " context="_57" access="protected" mangled="_ZN11b2GearJoint24SolvePositionConstraintsERK12b2SolverData" demangled="b2GearJoint::SolvePositionConstraints(b2SolverData const&amp;)" location="f10:76" file="f10" line="76" extern="1">
    <Argument name="data" type="_4003" location="f10:76" file="f10" line="76"/>
  </Method>
  <Destructor id="_1520" name="b2GearJoint" virtual="1" overrides="_2814 " artificial="1" context="_57" access="public" mangled="_ZN11b2GearJointD1Ev *INTERNAL* " demangled="b2GearJoint::~b2GearJoint()" location="f10:57" file="f10" line="57" endline="57" inline="1">
  </Destructor>
  <Struct id="_1521" name="__si_class_type_info_pseudo" context="_1" mangled="27__si_class_type_info_pseudo" demangled="__si_class_type_info_pseudo" location="f72:0" file="f72" line="0" size="96" align="32" members=""/>
  <CvQualifiedType id="_1521c" type="_1521" const="1"/>
  <Field id="_1523" name="m_tree" type="_421" offset="0" context="_65" access="private" location="f13:112" file="f13" line="112"/>
  <Field id="_1524" name="m_proxyCount" type="_114" offset="224" context="_65" access="private" location="f13:114" file="f13" line="114"/>
  <Field id="_1525" name="m_moveBuffer" type="_4004" offset="256" context="_65" access="private" location="f13:116" file="f13" line="116"/>
  <Field id="_1526" name="m_moveCapacity" type="_114" offset="288" context="_65" access="private" location="f13:117" file="f13" line="117"/>
  <Field id="_1527" name="m_moveCount" type="_114" offset="320" context="_65" access="private" location="f13:118" file="f13" line="118"/>
  <Field id="_1528" name="m_pairBuffer" type="_3136" offset="352" context="_65" access="private" location="f13:120" file="f13" line="120"/>
  <Field id="_1529" name="m_pairCapacity" type="_114" offset="384" context="_65" access="private" location="f13:121" file="f13" line="121"/>
  <Field id="_1530" name="m_pairCount" type="_114" offset="416" context="_65" access="private" location="f13:122" file="f13" line="122"/>
  <Field id="_1531" name="m_queryProxyId" type="_114" offset="448" context="_65" access="private" location="f13:124" file="f13" line="124"/>
  <Enumeration id="_1532" name="._67" context="_65" access="public" location="f13:41" file="f13" line="41" artificial="1" size="32" align="32">
    <EnumValue name="e_nullProxy" init="-1"/>
  </Enumeration>
  <OperatorMethod id="_1533" name="=" returns="_4005" artificial="1" throw="" context="_65" access="public" mangled="_ZN12b2BroadPhaseaSERKS_" demangled="b2BroadPhase::operator=(b2BroadPhase const&amp;)" location="f13:38" file="f13" line="38" endline="38" inline="1">
    <Argument type="_4006" location="f13:38" file="f13" line="38"/>
  </OperatorMethod>
  <Constructor id="_1534" name="b2BroadPhase" artificial="1" throw="" context="_65" access="public" mangled="_ZN12b2BroadPhaseC1ERKS_ *INTERNAL* " demangled="b2BroadPhase::b2BroadPhase(b2BroadPhase const&amp;)" location="f13:38" file="f13" line="38" endline="38" inline="1">
    <Argument type="_4006" location="f13:38" file="f13" line="38"/>
  </Constructor>
  <Constructor id="_1535" name="b2BroadPhase" explicit="1" context="_65" access="public" mangled="_ZN12b2BroadPhaseC1Ev *INTERNAL* " demangled="b2BroadPhase::b2BroadPhase()" location="f13:46" file="f13" line="46" extern="1"/>
  <Destructor id="_1536" name="b2BroadPhase" context="_65" access="public" mangled="_ZN12b2BroadPhaseD1Ev *INTERNAL* " demangled="b2BroadPhase::~b2BroadPhase()" location="f13:47" file="f13" line="47" extern="1">
  </Destructor>
  <Method id="_1537" name="CreateProxy" returns="_114" context="_65" access="public" mangled="_ZN12b2BroadPhase11CreateProxyERK6b2AABBPv" demangled="b2BroadPhase::CreateProxy(b2AABB const&amp;, void*)" location="f13:51" file="f13" line="51" extern="1">
    <Argument name="aabb" type="_2110" location="f13:51" file="f13" line="51"/>
    <Argument name="userData" type="_688" location="f13:51" file="f13" line="51"/>
  </Method>
  <Method id="_1538" name="DestroyProxy" returns="_1374" context="_65" access="public" mangled="_ZN12b2BroadPhase12DestroyProxyEi" demangled="b2BroadPhase::DestroyProxy(int)" location="f13:54" file="f13" line="54" extern="1">
    <Argument name="proxyId" type="_114" location="f13:54" file="f13" line="54"/>
  </Method>
  <Method id="_1539" name="MoveProxy" returns="_1374" context="_65" access="public" mangled="_ZN12b2BroadPhase9MoveProxyEiRK6b2AABBRK6b2Vec2" demangled="b2BroadPhase::MoveProxy(int, b2AABB const&amp;, b2Vec2 const&amp;)" location="f13:58" file="f13" line="58" extern="1">
    <Argument name="proxyId" type="_114" location="f13:58" file="f13" line="58"/>
    <Argument name="aabb" type="_2110" location="f13:58" file="f13" line="58"/>
    <Argument name="displacement" type="_1469" location="f13:58" file="f13" line="58"/>
  </Method>
  <Method id="_1540" name="TouchProxy" returns="_1374" context="_65" access="public" mangled="_ZN12b2BroadPhase10TouchProxyEi" demangled="b2BroadPhase::TouchProxy(int)" location="f13:61" file="f13" line="61" extern="1">
    <Argument name="proxyId" type="_114" location="f13:61" file="f13" line="61"/>
  </Method>
  <Method id="_1541" name="GetFatAABB" returns="_2110" const="1" context="_65" access="public" mangled="_ZNK12b2BroadPhase10GetFatAABBEi" demangled="b2BroadPhase::GetFatAABB(int) const" location="f13:155" file="f13" line="155" endline="157" inline="1">
    <Argument name="proxyId" type="_114" location="f13:155" file="f13" line="155"/>
  </Method>
  <Method id="_1542" name="GetUserData" returns="_688" const="1" context="_65" access="public" mangled="_ZNK12b2BroadPhase11GetUserDataEi" demangled="b2BroadPhase::GetUserData(int) const" location="f13:143" file="f13" line="143" endline="145" inline="1">
    <Argument name="proxyId" type="_114" location="f13:143" file="f13" line="143"/>
  </Method>
  <Method id="_1543" name="TestOverlap" returns="_1355" const="1" context="_65" access="public" mangled="_ZNK12b2BroadPhase11TestOverlapEii" demangled="b2BroadPhase::TestOverlap(int, int) const" location="f13:148" file="f13" line="148" endline="152" inline="1">
    <Argument name="proxyIdA" type="_114" location="f13:148" file="f13" line="148"/>
    <Argument name="proxyIdB" type="_114" location="f13:148" file="f13" line="148"/>
  </Method>
  <Method id="_1544" name="GetProxyCount" returns="_114" const="1" context="_65" access="public" mangled="_ZNK12b2BroadPhase13GetProxyCountEv" demangled="b2BroadPhase::GetProxyCount() const" location="f13:160" file="f13" line="160" endline="162" inline="1"/>
  <Method id="_1545" name="GetTreeHeight" returns="_114" const="1" context="_65" access="public" mangled="_ZNK12b2BroadPhase13GetTreeHeightEv" demangled="b2BroadPhase::GetTreeHeight() const" location="f13:165" file="f13" line="165" endline="167" inline="1"/>
  <Method id="_1546" name="GetTreeBalance" returns="_114" const="1" context="_65" access="public" mangled="_ZNK12b2BroadPhase14GetTreeBalanceEv" demangled="b2BroadPhase::GetTreeBalance() const" location="f13:170" file="f13" line="170" endline="172" inline="1"/>
  <Method id="_1547" name="GetTreeQuality" returns="_179" const="1" context="_65" access="public" mangled="_ZNK12b2BroadPhase14GetTreeQualityEv" demangled="b2BroadPhase::GetTreeQuality() const" location="f13:175" file="f13" line="175" endline="177" inline="1"/>
  <Method id="_1548" name="BufferMove" returns="_1374" context="_65" access="private" mangled="_ZN12b2BroadPhase10BufferMoveEi" demangled="b2BroadPhase::BufferMove(int)" location="f13:107" file="f13" line="107" extern="1">
    <Argument name="proxyId" type="_114" location="f13:107" file="f13" line="107"/>
  </Method>
  <Method id="_1549" name="UnBufferMove" returns="_1374" context="_65" access="private" mangled="_ZN12b2BroadPhase12UnBufferMoveEi" demangled="b2BroadPhase::UnBufferMove(int)" location="f13:108" file="f13" line="108" extern="1">
    <Argument name="proxyId" type="_114" location="f13:108" file="f13" line="108"/>
  </Method>
  <Method id="_1550" name="QueryCallback" returns="_1355" context="_65" access="private" mangled="_ZN12b2BroadPhase13QueryCallbackEi" demangled="b2BroadPhase::QueryCallback(int)" location="f13:110" file="f13" line="110" extern="1">
    <Argument name="proxyId" type="_114" location="f13:110" file="f13" line="110"/>
  </Method>
  <PointerType id="_1551" type="_852" size="32" align="32"/>
  <PointerType id="_1552" type="_852c" size="32" align="32"/>
  <Field id="_1553" name="localAnchorA" type="_226" offset="160" context="_73" access="public" location="f15:39" file="f15" line="39"/>
  <Field id="_1554" name="localAnchorB" type="_226" offset="224" context="_73" access="public" location="f15:42" file="f15" line="42"/>
  <Field id="_1555" name="maxLength" type="_179" offset="288" context="_73" access="public" location="f15:47" file="f15" line="47"/>
  <Destructor id="_1556" name="b2RopeJointDef" artificial="1" throw="" context="_73" access="public" mangled="_ZN14b2RopeJointDefD1Ev *INTERNAL* " demangled="b2RopeJointDef::~b2RopeJointDef()" location="f15:29" file="f15" line="29" endline="29" inline="1">
  </Destructor>
  <OperatorMethod id="_1557" name="=" returns="_4008" artificial="1" throw="" context="_73" access="public" mangled="_ZN14b2RopeJointDefaSERKS_" demangled="b2RopeJointDef::operator=(b2RopeJointDef const&amp;)" location="f15:29" file="f15" line="29" endline="29" inline="1">
    <Argument type="_4009" location="f15:29" file="f15" line="29"/>
  </OperatorMethod>
  <Constructor id="_1558" name="b2RopeJointDef" artificial="1" throw="" context="_73" access="public" mangled="_ZN14b2RopeJointDefC1ERKS_ *INTERNAL* " demangled="b2RopeJointDef::b2RopeJointDef(b2RopeJointDef const&amp;)" location="f15:29" file="f15" line="29" endline="29" inline="1">
    <Argument type="_4009" location="f15:29" file="f15" line="29"/>
  </Constructor>
  <Constructor id="_1559" name="b2RopeJointDef" explicit="1" context="_73" access="public" mangled="_ZN14b2RopeJointDefC1Ev *INTERNAL* " demangled="b2RopeJointDef::b2RopeJointDef()" location="f15:30" file="f15" line="30" endline="35" inline="1"/>
  <Field id="_1560" name="__val" type="_4010" offset="0" context="_79" access="public" location="f18:31" file="f18" line="31"/>
  <Destructor id="_1561" name="._51" artificial="1" throw="" context="_79" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f18:32" file="f18" line="32" endline="32" inline="1">
  </Destructor>
  <OperatorMethod id="_1562" name="=" returns="_4011" artificial="1" throw="" context="_79" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f18:32" file="f18" line="32" endline="32" inline="1">
    <Argument type="_4012" location="f18:30" file="f18" line="30"/>
  </OperatorMethod>
  <Constructor id="_1563" name="._51" artificial="1" throw="" context="_79" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f18:32" file="f18" line="32" endline="32" inline="1">
    <Argument type="_4012" location="f18:30" file="f18" line="30"/>
  </Constructor>
  <Constructor id="_1564" name="._51" artificial="1" throw="" context="_79" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f18:32" file="f18" line="32" inline="1"/>
  <Field id="_1565" name="__next" type="_4013" offset="0" context="_82" access="public" location="f8:48" file="f8" line="48"/>
  <Destructor id="_1566" name="__pthread_internal_slist" artificial="1" throw="" context="_82" access="public" mangled="_ZN24__pthread_internal_slistD1Ev *INTERNAL* " demangled="__pthread_internal_slist::~__pthread_internal_slist()" location="f8:47" file="f8" line="47" endline="47" inline="1">
  </Destructor>
  <OperatorMethod id="_1567" name="=" returns="_4014" artificial="1" throw="" context="_82" access="public" mangled="_ZN24__pthread_internal_slistaSERKS_" demangled="__pthread_internal_slist::operator=(__pthread_internal_slist const&amp;)" location="f8:47" file="f8" line="47" endline="47" inline="1">
    <Argument type="_4015" location="f8:47" file="f8" line="47"/>
  </OperatorMethod>
  <Constructor id="_1568" name="__pthread_internal_slist" artificial="1" throw="" context="_82" access="public" mangled="_ZN24__pthread_internal_slistC1ERKS_ *INTERNAL* " demangled="__pthread_internal_slist::__pthread_internal_slist(__pthread_internal_slist const&amp;)" location="f8:47" file="f8" line="47" endline="47" inline="1">
    <Argument type="_4015" location="f8:47" file="f8" line="47"/>
  </Constructor>
  <Constructor id="_1569" name="__pthread_internal_slist" artificial="1" throw="" context="_82" access="public" mangled="_ZN24__pthread_internal_slistC1Ev *INTERNAL* " demangled="__pthread_internal_slist::__pthread_internal_slist()" location="f8:47" file="f8" line="47" inline="1"/>
  <Field id="_1570" name="__size" type="_4016" offset="0" context="_83" access="public" location="f8:41" file="f8" line="41"/>
  <Field id="_1571" name="__align" type="_67" offset="0" context="_83" access="public" location="f8:42" file="f8" line="42"/>
  <Destructor id="_1572" name="._53" artificial="1" throw="" context="_83" access="public" mangled="_ZN14pthread_attr_tD1Ev *INTERNAL* " demangled="pthread_attr_t::~pthread_attr_t()" location="f8:43" file="f8" line="43" endline="43" inline="1">
  </Destructor>
  <OperatorMethod id="_1573" name="=" returns="_4017" artificial="1" throw="" context="_83" access="public" mangled="_ZN14pthread_attr_taSERKS_" demangled="pthread_attr_t::operator=(pthread_attr_t const&amp;)" location="f8:43" file="f8" line="43" endline="43" inline="1">
    <Argument type="_4018" location="f8:40" file="f8" line="40"/>
  </OperatorMethod>
  <Constructor id="_1574" name="._53" artificial="1" throw="" context="_83" access="public" mangled="_ZN14pthread_attr_tC1ERKS_ *INTERNAL* " demangled="pthread_attr_t::pthread_attr_t(pthread_attr_t const&amp;)" location="f8:43" file="f8" line="43" endline="43" inline="1">
    <Argument type="_4018" location="f8:40" file="f8" line="40"/>
  </Constructor>
  <Constructor id="_1575" name="._53" artificial="1" throw="" context="_83" access="public" mangled="_ZN14pthread_attr_tC1Ev *INTERNAL* " demangled="pthread_attr_t::pthread_attr_t()" location="f8:43" file="f8" line="43" inline="1"/>
  <PointerType id="_1576" type="_178" size="32" align="32"/>
  <Field id="_1577" name="m_vertex1" type="_226" offset="96" context="_101" access="public" location="f22:55" file="f22" line="55"/>
  <Field id="_1578" name="m_vertex2" type="_226" offset="160" context="_101" access="public" location="f22:55" file="f22" line="55"/>
  <Field id="_1579" name="m_vertex0" type="_226" offset="224" context="_101" access="public" location="f22:58" file="f22" line="58"/>
  <Field id="_1580" name="m_vertex3" type="_226" offset="288" context="_101" access="public" location="f22:58" file="f22" line="58"/>
  <Field id="_1581" name="m_hasVertex0" type="_1355" offset="352" context="_101" access="public" location="f22:59" file="f22" line="59"/>
  <Field id="_1582" name="m_hasVertex3" type="_1355" offset="360" context="_101" access="public" location="f22:59" file="f22" line="59"/>
  <OperatorMethod id="_1583" name="=" returns="_4019" artificial="1" throw="" context="_101" access="public" mangled="_ZN11b2EdgeShapeaSERKS_" demangled="b2EdgeShape::operator=(b2EdgeShape const&amp;)" location="f22:28" file="f22" line="28" endline="28" inline="1">
    <Argument type="_4020" location="f22:28" file="f22" line="28"/>
  </OperatorMethod>
  <Constructor id="_1584" name="b2EdgeShape" artificial="1" throw="" context="_101" access="public" mangled="_ZN11b2EdgeShapeC1ERKS_ *INTERNAL* " demangled="b2EdgeShape::b2EdgeShape(b2EdgeShape const&amp;)" location="f22:28" file="f22" line="28" endline="28" inline="1">
    <Argument type="_4020" location="f22:28" file="f22" line="28"/>
  </Constructor>
  <Constructor id="_1585" name="b2EdgeShape" explicit="1" context="_101" access="public" mangled="_ZN11b2EdgeShapeC1Ev *INTERNAL* " demangled="b2EdgeShape::b2EdgeShape()" location="f22:62" file="f22" line="62" endline="68" inline="1"/>
  <Method id="_1586" name="Set" returns="_1374" context="_101" access="public" mangled="_ZN11b2EdgeShape3SetERK6b2Vec2S2_" demangled="b2EdgeShape::Set(b2Vec2 const&amp;, b2Vec2 const&amp;)" location="f22:33" file="f22" line="33" extern="1">
    <Argument name="v1" type="_1469" location="f22:33" file="f22" line="33"/>
    <Argument name="v2" type="_1469" location="f22:33" file="f22" line="33"/>
  </Method>
  <Method id="_1587" name="Clone" returns="_4021" const="1" virtual="1" overrides="_2383 " context="_101" access="public" mangled="_ZNK11b2EdgeShape5CloneEP16b2BlockAllocator" demangled="b2EdgeShape::Clone(b2BlockAllocator*) const" location="f22:36" file="f22" line="36" extern="1">
    <Argument name="allocator" type="_2226" location="f22:36" file="f22" line="36"/>
  </Method>
  <Method id="_1588" name="GetChildCount" returns="_114" const="1" virtual="1" overrides="_2385 " context="_101" access="public" mangled="_ZNK11b2EdgeShape13GetChildCountEv" demangled="b2EdgeShape::GetChildCount() const" location="f22:39" file="f22" line="39" extern="1"/>
  <Method id="_1589" name="TestPoint" returns="_1355" const="1" virtual="1" overrides="_2386 " context="_101" access="public" mangled="_ZNK11b2EdgeShape9TestPointERK11b2TransformRK6b2Vec2" demangled="b2EdgeShape::TestPoint(b2Transform const&amp;, b2Vec2 const&amp;) const" location="f22:42" file="f22" line="42" extern="1">
    <Argument name="transform" type="_1854" location="f22:42" file="f22" line="42"/>
    <Argument name="p" type="_1469" location="f22:42" file="f22" line="42"/>
  </Method>
  <Method id="_1590" name="RayCast" returns="_1355" const="1" virtual="1" overrides="_2387 " context="_101" access="public" mangled="_ZNK11b2EdgeShape7RayCastEP15b2RayCastOutputRK14b2RayCastInputRK11b2Transformi" demangled="b2EdgeShape::RayCast(b2RayCastOutput*, b2RayCastInput const&amp;, b2Transform const&amp;, int) const" location="f22:46" file="f22" line="46" extern="1">
    <Argument name="output" type="_4022" location="f22:46" file="f22" line="46"/>
    <Argument name="input" type="_4023" location="f22:46" file="f22" line="46"/>
    <Argument name="transform" type="_1854" location="f22:46" file="f22" line="46"/>
    <Argument name="childIndex" type="_114" location="f22:46" file="f22" line="46"/>
  </Method>
  <Method id="_1591" name="ComputeAABB" returns="_1374" const="1" virtual="1" overrides="_2388 " context="_101" access="public" mangled="_ZNK11b2EdgeShape11ComputeAABBEP6b2AABBRK11b2Transformi" demangled="b2EdgeShape::ComputeAABB(b2AABB*, b2Transform const&amp;, int) const" location="f22:49" file="f22" line="49" extern="1">
    <Argument name="aabb" type="_4024" location="f22:49" file="f22" line="49"/>
    <Argument name="transform" type="_1854" location="f22:49" file="f22" line="49"/>
    <Argument name="childIndex" type="_114" location="f22:49" file="f22" line="49"/>
  </Method>
  <Method id="_1592" name="ComputeMass" returns="_1374" const="1" virtual="1" overrides="_2389 " context="_101" access="public" mangled="_ZNK11b2EdgeShape11ComputeMassEP10b2MassDataf" demangled="b2EdgeShape::ComputeMass(b2MassData*, float) const" location="f22:52" file="f22" line="52" extern="1">
    <Argument name="massData" type="_4025" location="f22:52" file="f22" line="52"/>
    <Argument name="density" type="_179" location="f22:52" file="f22" line="52"/>
  </Method>
  <Destructor id="_1593" name="b2EdgeShape" virtual="1" overrides="_2382 " artificial="1" context="_101" access="public" mangled="_ZN11b2EdgeShapeD1Ev *INTERNAL* " demangled="b2EdgeShape::~b2EdgeShape()" location="f22:28" file="f22" line="28" endline="28" inline="1">
  </Destructor>
  <CvQualifiedType id="_114c" type="_114" const="1"/>
  <FundamentalType id="_1595" name="complex double" size="128" align="64"/>
  <PointerType id="_1596" type="_387" size="32" align="32"/>
  <Field id="_1597" name="normal" type="_226" offset="0" context="_115" access="public" location="f14:120" file="f14" line="120"/>
  <Field id="_1598" name="points" type="_4026" offset="64" context="_115" access="public" location="f14:121" file="f14" line="121"/>
  <Destructor id="_1599" name="b2WorldManifold" artificial="1" throw="" context="_115" access="public" mangled="_ZN15b2WorldManifoldD1Ev *INTERNAL* " demangled="b2WorldManifold::~b2WorldManifold()" location="f14:111" file="f14" line="111" endline="111" inline="1">
  </Destructor>
  <OperatorMethod id="_1600" name="=" returns="_4027" artificial="1" throw="" context="_115" access="public" mangled="_ZN15b2WorldManifoldaSERKS_" demangled="b2WorldManifold::operator=(b2WorldManifold const&amp;)" location="f14:111" file="f14" line="111" endline="111" inline="1">
    <Argument type="_4028" location="f14:111" file="f14" line="111"/>
  </OperatorMethod>
  <Constructor id="_1601" name="b2WorldManifold" artificial="1" throw="" context="_115" access="public" mangled="_ZN15b2WorldManifoldC1ERKS_ *INTERNAL* " demangled="b2WorldManifold::b2WorldManifold(b2WorldManifold const&amp;)" location="f14:111" file="f14" line="111" endline="111" inline="1">
    <Argument type="_4028" location="f14:111" file="f14" line="111"/>
  </Constructor>
  <Constructor id="_1602" name="b2WorldManifold" artificial="1" context="_115" access="public" mangled="_ZN15b2WorldManifoldC1Ev *INTERNAL* " demangled="b2WorldManifold::b2WorldManifold()" location="f14:111" file="f14" line="111" endline="111" inline="1"/>
  <Method id="_1603" name="Initialize" returns="_1374" context="_115" access="public" mangled="_ZN15b2WorldManifold10InitializeEPK10b2ManifoldRK11b2TransformfS5_f" demangled="b2WorldManifold::Initialize(b2Manifold const*, b2Transform const&amp;, float, b2Transform const&amp;, float)" location="f14:118" file="f14" line="118" extern="1">
    <Argument name="manifold" type="_2960" location="f14:118" file="f14" line="118"/>
    <Argument name="xfA" type="_1854" location="f14:118" file="f14" line="118"/>
    <Argument name="radiusA" type="_179" location="f14:118" file="f14" line="118"/>
    <Argument name="xfB" type="_1854" location="f14:118" file="f14" line="118"/>
    <Argument name="radiusB" type="_179" location="f14:118" file="f14" line="118"/>
  </Method>
  <Struct id="_1604" name="__class_type_info_pseudo" context="_1" mangled="24__class_type_info_pseudo" demangled="__class_type_info_pseudo" location="f72:0" file="f72" line="0" size="64" align="32" members=""/>
  <CvQualifiedType id="_1604c" type="_1604" const="1"/>
  <Field id="_1606" name="m_frequencyHz" type="_179" offset="512" context="_146" access="protected" location="f26:103" file="f26" line="103"/>
  <Field id="_1607" name="m_dampingRatio" type="_179" offset="544" context="_146" access="protected" location="f26:104" file="f26" line="104"/>
  <Field id="_1608" name="m_bias" type="_179" offset="576" context="_146" access="protected" location="f26:105" file="f26" line="105"/>
  <Field id="_1609" name="m_localAnchorA" type="_226" offset="608" context="_146" access="protected" location="f26:108" file="f26" line="108"/>
  <Field id="_1610" name="m_localAnchorB" type="_226" offset="672" context="_146" access="protected" location="f26:109" file="f26" line="109"/>
  <Field id="_1611" name="m_gamma" type="_179" offset="736" context="_146" access="protected" location="f26:110" file="f26" line="110"/>
  <Field id="_1612" name="m_impulse" type="_179" offset="768" context="_146" access="protected" location="f26:111" file="f26" line="111"/>
  <Field id="_1613" name="m_length" type="_179" offset="800" context="_146" access="protected" location="f26:112" file="f26" line="112"/>
  <Field id="_1614" name="m_indexA" type="_114" offset="832" context="_146" access="protected" location="f26:115" file="f26" line="115"/>
  <Field id="_1615" name="m_indexB" type="_114" offset="864" context="_146" access="protected" location="f26:116" file="f26" line="116"/>
  <Field id="_1616" name="m_u" type="_226" offset="896" context="_146" access="protected" location="f26:117" file="f26" line="117"/>
  <Field id="_1617" name="m_rA" type="_226" offset="960" context="_146" access="protected" location="f26:118" file="f26" line="118"/>
  <Field id="_1618" name="m_rB" type="_226" offset="1024" context="_146" access="protected" location="f26:119" file="f26" line="119"/>
  <Field id="_1619" name="m_localCenterA" type="_226" offset="1088" context="_146" access="protected" location="f26:120" file="f26" line="120"/>
  <Field id="_1620" name="m_localCenterB" type="_226" offset="1152" context="_146" access="protected" location="f26:121" file="f26" line="121"/>
  <Field id="_1621" name="m_invMassA" type="_179" offset="1216" context="_146" access="protected" location="f26:122" file="f26" line="122"/>
  <Field id="_1622" name="m_invMassB" type="_179" offset="1248" context="_146" access="protected" location="f26:123" file="f26" line="123"/>
  <Field id="_1623" name="m_invIA" type="_179" offset="1280" context="_146" access="protected" location="f26:124" file="f26" line="124"/>
  <Field id="_1624" name="m_invIB" type="_179" offset="1312" context="_146" access="protected" location="f26:125" file="f26" line="125"/>
  <Field id="_1625" name="m_mass" type="_179" offset="1344" context="_146" access="protected" location="f26:126" file="f26" line="126"/>
  <OperatorMethod id="_1626" name="=" returns="_4029" artificial="1" throw="" context="_146" access="public" mangled="_ZN15b2DistanceJointaSERKS_" demangled="b2DistanceJoint::operator=(b2DistanceJoint const&amp;)" location="f26:67" file="f26" line="67" endline="67" inline="1">
    <Argument type="_4030" location="f26:67" file="f26" line="67"/>
  </OperatorMethod>
  <Constructor id="_1627" name="b2DistanceJoint" artificial="1" throw="" context="_146" access="public" mangled="_ZN15b2DistanceJointC1ERKS_ *INTERNAL* " demangled="b2DistanceJoint::b2DistanceJoint(b2DistanceJoint const&amp;)" location="f26:67" file="f26" line="67" endline="67" inline="1">
    <Argument type="_4030" location="f26:67" file="f26" line="67"/>
  </Constructor>
  <Method id="_1628" name="GetAnchorA" returns="_226" const="1" virtual="1" overrides="_2801 " context="_146" access="public" mangled="_ZNK15b2DistanceJoint10GetAnchorAEv" demangled="b2DistanceJoint::GetAnchorA() const" location="f26:70" file="f26" line="70" extern="1"/>
  <Method id="_1629" name="GetAnchorB" returns="_226" const="1" virtual="1" overrides="_2802 " context="_146" access="public" mangled="_ZNK15b2DistanceJoint10GetAnchorBEv" demangled="b2DistanceJoint::GetAnchorB() const" location="f26:71" file="f26" line="71" extern="1"/>
  <Method id="_1630" name="GetReactionForce" returns="_226" const="1" virtual="1" overrides="_2803 " context="_146" access="public" mangled="_ZNK15b2DistanceJoint16GetReactionForceEf" demangled="b2DistanceJoint::GetReactionForce(float) const" location="f26:75" file="f26" line="75" extern="1">
    <Argument name="inv_dt" type="_179" location="f26:75" file="f26" line="75"/>
  </Method>
  <Method id="_1631" name="GetReactionTorque" returns="_179" const="1" virtual="1" overrides="_2804 " context="_146" access="public" mangled="_ZNK15b2DistanceJoint17GetReactionTorqueEf" demangled="b2DistanceJoint::GetReactionTorque(float) const" location="f26:79" file="f26" line="79" extern="1">
    <Argument name="inv_dt" type="_179" location="f26:79" file="f26" line="79"/>
  </Method>
  <Method id="_1632" name="SetLength" returns="_1374" context="_146" access="public" mangled="_ZN15b2DistanceJoint9SetLengthEf" demangled="b2DistanceJoint::SetLength(float)" location="f26:129" file="f26" line="129" endline="131" inline="1">
    <Argument name="length" type="_179" location="f26:129" file="f26" line="129"/>
  </Method>
  <Method id="_1633" name="GetLength" returns="_179" const="1" context="_146" access="public" mangled="_ZNK15b2DistanceJoint9GetLengthEv" demangled="b2DistanceJoint::GetLength() const" location="f26:134" file="f26" line="134" endline="136" inline="1"/>
  <Method id="_1634" name="SetFrequency" returns="_1374" context="_146" access="public" mangled="_ZN15b2DistanceJoint12SetFrequencyEf" demangled="b2DistanceJoint::SetFrequency(float)" location="f26:139" file="f26" line="139" endline="141" inline="1">
    <Argument name="hz" type="_179" location="f26:139" file="f26" line="139"/>
  </Method>
  <Method id="_1635" name="GetFrequency" returns="_179" const="1" context="_146" access="public" mangled="_ZNK15b2DistanceJoint12GetFrequencyEv" demangled="b2DistanceJoint::GetFrequency() const" location="f26:144" file="f26" line="144" endline="146" inline="1"/>
  <Method id="_1636" name="SetDampingRatio" returns="_1374" context="_146" access="public" mangled="_ZN15b2DistanceJoint15SetDampingRatioEf" demangled="b2DistanceJoint::SetDampingRatio(float)" location="f26:149" file="f26" line="149" endline="151" inline="1">
    <Argument name="ratio" type="_179" location="f26:149" file="f26" line="149"/>
  </Method>
  <Method id="_1637" name="GetDampingRatio" returns="_179" const="1" context="_146" access="public" mangled="_ZNK15b2DistanceJoint15GetDampingRatioEv" demangled="b2DistanceJoint::GetDampingRatio() const" location="f26:154" file="f26" line="154" endline="156" inline="1"/>
  <Constructor id="_1638" name="b2DistanceJoint" context="_146" access="protected" mangled="_ZN15b2DistanceJointC1EPK18b2DistanceJointDef *INTERNAL* " demangled="b2DistanceJoint::b2DistanceJoint(b2DistanceJointDef const*)" location="f26:97" file="f26" line="97" extern="1">
    <Argument name="data" type="_4031" location="f26:97" file="f26" line="97"/>
  </Constructor>
  <Method id="_1639" name="InitVelocityConstraints" returns="_1374" virtual="1" overrides="_2815 " context="_146" access="protected" mangled="_ZN15b2DistanceJoint23InitVelocityConstraintsERK12b2SolverData" demangled="b2DistanceJoint::InitVelocityConstraints(b2SolverData const&amp;)" location="f26:99" file="f26" line="99" extern="1">
    <Argument name="data" type="_4003" location="f26:99" file="f26" line="99"/>
  </Method>
  <Method id="_1640" name="SolveVelocityConstraints" returns="_1374" virtual="1" overrides="_2816 " context="_146" access="protected" mangled="_ZN15b2DistanceJoint24SolveVelocityConstraintsERK12b2SolverData" demangled="b2DistanceJoint::SolveVelocityConstraints(b2SolverData const&amp;)" location="f26:100" file="f26" line="100" extern="1">
    <Argument name="data" type="_4003" location="f26:100" file="f26" line="100"/>
  </Method>
  <Method id="_1641" name="SolvePositionConstraints" returns="_1355" virtual="1" overrides="_2817 " context="_146" access="protected" mangled="_ZN15b2DistanceJoint24SolvePositionConstraintsERK12b2SolverData" demangled="b2DistanceJoint::SolvePositionConstraints(b2SolverData const&amp;)" location="f26:101" file="f26" line="101" extern="1">
    <Argument name="data" type="_4003" location="f26:101" file="f26" line="101"/>
  </Method>
  <Destructor id="_1642" name="b2DistanceJoint" virtual="1" overrides="_2814 " artificial="1" context="_146" access="public" mangled="_ZN15b2DistanceJointD1Ev *INTERNAL* " demangled="b2DistanceJoint::~b2DistanceJoint()" location="f26:67" file="f26" line="67" endline="67" inline="1">
  </Destructor>
  <Field id="_1643" name="localAnchorA" type="_226" offset="160" context="_155" access="public" location="f27:50" file="f27" line="50"/>
  <Field id="_1644" name="localAnchorB" type="_226" offset="224" context="_155" access="public" location="f27:53" file="f27" line="53"/>
  <Field id="_1645" name="localAxisA" type="_226" offset="288" context="_155" access="public" location="f27:56" file="f27" line="56"/>
  <Field id="_1646" name="enableMotor" type="_1355" offset="352" context="_155" access="public" location="f27:59" file="f27" line="59"/>
  <Field id="_1647" name="maxMotorTorque" type="_179" offset="384" context="_155" access="public" location="f27:62" file="f27" line="62"/>
  <Field id="_1648" name="motorSpeed" type="_179" offset="416" context="_155" access="public" location="f27:65" file="f27" line="65"/>
  <Field id="_1649" name="frequencyHz" type="_179" offset="448" context="_155" access="public" location="f27:68" file="f27" line="68"/>
  <Field id="_1650" name="dampingRatio" type="_179" offset="480" context="_155" access="public" location="f27:71" file="f27" line="71"/>
  <Destructor id="_1651" name="b2WheelJointDef" artificial="1" throw="" context="_155" access="public" mangled="_ZN15b2WheelJointDefD1Ev *INTERNAL* " demangled="b2WheelJointDef::~b2WheelJointDef()" location="f27:31" file="f27" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1652" name="=" returns="_4032" artificial="1" throw="" context="_155" access="public" mangled="_ZN15b2WheelJointDefaSERKS_" demangled="b2WheelJointDef::operator=(b2WheelJointDef const&amp;)" location="f27:31" file="f27" line="31" endline="31" inline="1">
    <Argument type="_4033" location="f27:31" file="f27" line="31"/>
  </OperatorMethod>
  <Constructor id="_1653" name="b2WheelJointDef" artificial="1" throw="" context="_155" access="public" mangled="_ZN15b2WheelJointDefC1ERKS_ *INTERNAL* " demangled="b2WheelJointDef::b2WheelJointDef(b2WheelJointDef const&amp;)" location="f27:31" file="f27" line="31" endline="31" inline="1">
    <Argument type="_4033" location="f27:31" file="f27" line="31"/>
  </Constructor>
  <Constructor id="_1654" name="b2WheelJointDef" explicit="1" context="_155" access="public" mangled="_ZN15b2WheelJointDefC1Ev *INTERNAL* " demangled="b2WheelJointDef::b2WheelJointDef()" location="f27:32" file="f27" line="32" endline="42" inline="1"/>
  <Method id="_1655" name="Initialize" returns="_1374" context="_155" access="public" mangled="_ZN15b2WheelJointDef10InitializeEP6b2BodyS1_RK6b2Vec2S4_" demangled="b2WheelJointDef::Initialize(b2Body*, b2Body*, b2Vec2 const&amp;, b2Vec2 const&amp;)" location="f27:47" file="f27" line="47" extern="1">
    <Argument name="bodyA" type="_3999" location="f27:47" file="f27" line="47"/>
    <Argument name="bodyB" type="_3999" location="f27:47" file="f27" line="47"/>
    <Argument name="anchor" type="_1469" location="f27:47" file="f27" line="47"/>
    <Argument name="axis" type="_1469" location="f27:47" file="f27" line="47"/>
  </Method>
  <PointerType id="_1656" type="_195" size="32" align="32"/>
  <Field id="_1657" name="dt" type="_179" offset="0" context="_183" access="public" location="f30:40" file="f30" line="40"/>
  <Field id="_1658" name="inv_dt" type="_179" offset="32" context="_183" access="public" location="f30:41" file="f30" line="41"/>
  <Field id="_1659" name="dtRatio" type="_179" offset="64" context="_183" access="public" location="f30:42" file="f30" line="42"/>
  <Field id="_1660" name="velocityIterations" type="_114" offset="96" context="_183" access="public" location="f30:43" file="f30" line="43"/>
  <Field id="_1661" name="positionIterations" type="_114" offset="128" context="_183" access="public" location="f30:44" file="f30" line="44"/>
  <Field id="_1662" name="warmStarting" type="_1355" offset="160" context="_183" access="public" location="f30:45" file="f30" line="45"/>
  <Destructor id="_1663" name="b2TimeStep" artificial="1" throw="" context="_183" access="public" mangled="_ZN10b2TimeStepD1Ev *INTERNAL* " demangled="b2TimeStep::~b2TimeStep()" location="f30:39" file="f30" line="39" endline="39" inline="1">
  </Destructor>
  <OperatorMethod id="_1664" name="=" returns="_4034" artificial="1" throw="" context="_183" access="public" mangled="_ZN10b2TimeStepaSERKS_" demangled="b2TimeStep::operator=(b2TimeStep const&amp;)" location="f30:39" file="f30" line="39" endline="39" inline="1">
    <Argument type="_4035" location="f30:39" file="f30" line="39"/>
  </OperatorMethod>
  <Constructor id="_1665" name="b2TimeStep" artificial="1" throw="" context="_183" access="public" mangled="_ZN10b2TimeStepC1ERKS_ *INTERNAL* " demangled="b2TimeStep::b2TimeStep(b2TimeStep const&amp;)" location="f30:39" file="f30" line="39" endline="39" inline="1">
    <Argument type="_4035" location="f30:39" file="f30" line="39"/>
  </Constructor>
  <Constructor id="_1666" name="b2TimeStep" artificial="1" throw="" context="_183" access="public" mangled="_ZN10b2TimeStepC1Ev *INTERNAL* " demangled="b2TimeStep::b2TimeStep()" location="f30:39" file="f30" line="39" inline="1"/>
  <Field id="_1667" name="__x" type="_4036" offset="0" context="_185" access="public" location="f5:420" file="f5" line="420"/>
  <Field id="_1668" name="__old_x" type="_4036" offset="48" context="_185" access="public" location="f5:421" file="f5" line="421"/>
  <Field id="_1669" name="__c" type="_244" offset="96" context="_185" access="public" location="f5:422" file="f5" line="422"/>
  <Field id="_1670" name="__init" type="_244" offset="112" context="_185" access="public" location="f5:423" file="f5" line="423"/>
  <Field id="_1671" name="__a" type="_121" offset="128" context="_185" access="public" location="f5:424" file="f5" line="424"/>
  <Destructor id="_1672" name="drand48_data" artificial="1" throw="" context="_185" access="public" mangled="_ZN12drand48_dataD1Ev *INTERNAL* " demangled="drand48_data::~drand48_data()" location="f5:419" file="f5" line="419" endline="419" inline="1">
  </Destructor>
  <OperatorMethod id="_1673" name="=" returns="_4037" artificial="1" throw="" context="_185" access="public" mangled="_ZN12drand48_dataaSERKS_" demangled="drand48_data::operator=(drand48_data const&amp;)" location="f5:419" file="f5" line="419" endline="419" inline="1">
    <Argument type="_4038" location="f5:419" file="f5" line="419"/>
  </OperatorMethod>
  <Constructor id="_1674" name="drand48_data" artificial="1" throw="" context="_185" access="public" mangled="_ZN12drand48_dataC1ERKS_ *INTERNAL* " demangled="drand48_data::drand48_data(drand48_data const&amp;)" location="f5:419" file="f5" line="419" endline="419" inline="1">
    <Argument type="_4038" location="f5:419" file="f5" line="419"/>
  </Constructor>
  <Constructor id="_1675" name="drand48_data" artificial="1" throw="" context="_185" access="public" mangled="_ZN12drand48_dataC1Ev *INTERNAL* " demangled="drand48_data::drand48_data()" location="f5:419" file="f5" line="419" inline="1"/>
  <CvQualifiedType id="_113v" type="_113" volatile="1"/>
  <Field id="_1677" name="type" type="_920" offset="0" context="_190" access="public" location="f31:85" file="f31" line="85"/>
  <Field id="_1678" name="userData" type="_688" offset="32" context="_190" access="public" location="f31:88" file="f31" line="88"/>
  <Field id="_1679" name="bodyA" type="_3999" offset="64" context="_190" access="public" location="f31:91" file="f31" line="91"/>
  <Field id="_1680" name="bodyB" type="_3999" offset="96" context="_190" access="public" location="f31:94" file="f31" line="94"/>
  <Field id="_1681" name="collideConnected" type="_1355" offset="128" context="_190" access="public" location="f31:97" file="f31" line="97"/>
  <Destructor id="_1682" name="b2JointDef" artificial="1" throw="" context="_190" access="public" mangled="_ZN10b2JointDefD1Ev *INTERNAL* " demangled="b2JointDef::~b2JointDef()" location="f31:74" file="f31" line="74" endline="74" inline="1">
  </Destructor>
  <OperatorMethod id="_1683" name="=" returns="_4039" artificial="1" throw="" context="_190" access="public" mangled="_ZN10b2JointDefaSERKS_" demangled="b2JointDef::operator=(b2JointDef const&amp;)" location="f31:74" file="f31" line="74" endline="74" inline="1">
    <Argument type="_4040" location="f31:74" file="f31" line="74"/>
  </OperatorMethod>
  <Constructor id="_1684" name="b2JointDef" artificial="1" throw="" context="_190" access="public" mangled="_ZN10b2JointDefC1ERKS_ *INTERNAL* " demangled="b2JointDef::b2JointDef(b2JointDef const&amp;)" location="f31:74" file="f31" line="74" endline="74" inline="1">
    <Argument type="_4040" location="f31:74" file="f31" line="74"/>
  </Constructor>
  <Constructor id="_1685" name="b2JointDef" explicit="1" context="_190" access="public" mangled="_ZN10b2JointDefC1Ev *INTERNAL* " demangled="b2JointDef::b2JointDef()" location="f31:75" file="f31" line="75" endline="81" inline="1"/>
  <PointerType id="_1686" type="_1374c" size="32" align="32"/>
  <PointerType id="_1687" type="_1367c" size="32" align="32"/>
  <CvQualifiedType id="_1687r" type="_1687" restrict="1"/>
  <Field id="_1689" name="localPoint" type="_226" offset="0" context="_213" access="public" location="f14:71" file="f14" line="71"/>
  <Field id="_1690" name="normalImpulse" type="_179" offset="64" context="_213" access="public" location="f14:72" file="f14" line="72"/>
  <Field id="_1691" name="tangentImpulse" type="_179" offset="96" context="_213" access="public" location="f14:73" file="f14" line="73"/>
  <Field id="_1692" name="id" type="_815" offset="128" context="_213" access="public" location="f14:74" file="f14" line="74"/>
  <Destructor id="_1693" name="b2ManifoldPoint" artificial="1" throw="" context="_213" access="public" mangled="_ZN15b2ManifoldPointD1Ev *INTERNAL* " demangled="b2ManifoldPoint::~b2ManifoldPoint()" location="f14:70" file="f14" line="70" endline="70" inline="1">
  </Destructor>
  <OperatorMethod id="_1694" name="=" returns="_4043" artificial="1" throw="" context="_213" access="public" mangled="_ZN15b2ManifoldPointaSERKS_" demangled="b2ManifoldPoint::operator=(b2ManifoldPoint const&amp;)" location="f14:70" file="f14" line="70" endline="70" inline="1">
    <Argument type="_4044" location="f14:70" file="f14" line="70"/>
  </OperatorMethod>
  <Constructor id="_1695" name="b2ManifoldPoint" artificial="1" throw="" context="_213" access="public" mangled="_ZN15b2ManifoldPointC1ERKS_ *INTERNAL* " demangled="b2ManifoldPoint::b2ManifoldPoint(b2ManifoldPoint const&amp;)" location="f14:70" file="f14" line="70" endline="70" inline="1">
    <Argument type="_4044" location="f14:70" file="f14" line="70"/>
  </Constructor>
  <Constructor id="_1696" name="b2ManifoldPoint" artificial="1" context="_213" access="public" mangled="_ZN15b2ManifoldPointC1Ev *INTERNAL* " demangled="b2ManifoldPoint::b2ManifoldPoint()" location="f14:70" file="f14" line="70" endline="70" inline="1"/>
  <Field id="_1697" name="indexA" type="_53" offset="0" context="_219" access="public" location="f14:46" file="f14" line="46"/>
  <Field id="_1698" name="indexB" type="_53" offset="8" context="_219" access="public" location="f14:47" file="f14" line="47"/>
  <Field id="_1699" name="typeA" type="_53" offset="16" context="_219" access="public" location="f14:48" file="f14" line="48"/>
  <Field id="_1700" name="typeB" type="_53" offset="24" context="_219" access="public" location="f14:49" file="f14" line="49"/>
  <Enumeration id="_1701" name="Type" context="_219" access="public" location="f14:40" file="f14" line="40" artificial="1" size="32" align="32">
    <EnumValue name="e_vertex" init="0"/>
    <EnumValue name="e_face" init="1"/>
  </Enumeration>
  <Destructor id="_1702" name="b2ContactFeature" artificial="1" throw="" context="_219" access="public" mangled="_ZN16b2ContactFeatureD1Ev *INTERNAL* " demangled="b2ContactFeature::~b2ContactFeature()" location="f14:39" file="f14" line="39" endline="39" inline="1">
  </Destructor>
  <OperatorMethod id="_1703" name="=" returns="_4045" artificial="1" throw="" context="_219" access="public" mangled="_ZN16b2ContactFeatureaSERKS_" demangled="b2ContactFeature::operator=(b2ContactFeature const&amp;)" location="f14:39" file="f14" line="39" endline="39" inline="1">
    <Argument type="_4046" location="f14:39" file="f14" line="39"/>
  </OperatorMethod>
  <Constructor id="_1704" name="b2ContactFeature" artificial="1" throw="" context="_219" access="public" mangled="_ZN16b2ContactFeatureC1ERKS_ *INTERNAL* " demangled="b2ContactFeature::b2ContactFeature(b2ContactFeature const&amp;)" location="f14:39" file="f14" line="39" endline="39" inline="1">
    <Argument type="_4046" location="f14:39" file="f14" line="39"/>
  </Constructor>
  <Constructor id="_1705" name="b2ContactFeature" artificial="1" throw="" context="_219" access="public" mangled="_ZN16b2ContactFeatureC1Ev *INTERNAL* " demangled="b2ContactFeature::b2ContactFeature()" location="f14:39" file="f14" line="39" inline="1"/>
  <PointerType id="_1706" type="_244" size="32" align="32"/>
  <Field id="_1707" name="x" type="_179" offset="0" context="_226" access="public" location="f9:151" file="f9" line="151"/>
  <Field id="_1708" name="y" type="_179" offset="32" context="_226" access="public" location="f9:151" file="f9" line="151"/>
  <Destructor id="_1709" name="b2Vec2" artificial="1" throw="" context="_226" access="public" mangled="_ZN6b2Vec2D1Ev *INTERNAL* " demangled="b2Vec2::~b2Vec2()" location="f9:65" file="f9" line="65" endline="65" inline="1">
  </Destructor>
  <OperatorMethod id="_1710" name="=" returns="_4047" artificial="1" throw="" context="_226" access="public" mangled="_ZN6b2Vec2aSERKS_" demangled="b2Vec2::operator=(b2Vec2 const&amp;)" location="f9:65" file="f9" line="65" endline="65" inline="1">
    <Argument type="_1469" location="f9:65" file="f9" line="65"/>
  </OperatorMethod>
  <Constructor id="_1711" name="b2Vec2" artificial="1" throw="" context="_226" access="public" mangled="_ZN6b2Vec2C1ERKS_ *INTERNAL* " demangled="b2Vec2::b2Vec2(b2Vec2 const&amp;)" location="f9:65" file="f9" line="65" endline="65" inline="1">
    <Argument type="_1469" location="f9:65" file="f9" line="65"/>
  </Constructor>
  <Constructor id="_1712" name="b2Vec2" explicit="1" context="_226" access="public" mangled="_ZN6b2Vec2C1Ev *INTERNAL* " demangled="b2Vec2::b2Vec2()" location="f9:67" file="f9" line="67" inline="1"/>
  <Constructor id="_1713" name="b2Vec2" explicit="1" context="_226" access="public" mangled="_ZN6b2Vec2C1Eff *INTERNAL* " demangled="b2Vec2::b2Vec2(float, float)" location="f9:70" file="f9" line="70" endline="70" inline="1">
    <Argument name="x" type="_179" location="f9:70" file="f9" line="70"/>
    <Argument name="y" type="_179" location="f9:70" file="f9" line="70"/>
  </Constructor>
  <Method id="_1714" name="SetZero" returns="_1374" context="_226" access="public" mangled="_ZN6b2Vec27SetZeroEv" demangled="b2Vec2::SetZero()" location="f9:73" file="f9" line="73" endline="73" inline="1"/>
  <Method id="_1715" name="Set" returns="_1374" context="_226" access="public" mangled="_ZN6b2Vec23SetEff" demangled="b2Vec2::Set(float, float)" location="f9:76" file="f9" line="76" endline="76" inline="1">
    <Argument name="x_" type="_179" location="f9:76" file="f9" line="76"/>
    <Argument name="y_" type="_179" location="f9:76" file="f9" line="76"/>
  </Method>
  <OperatorMethod id="_1716" name="-" returns="_226" const="1" context="_226" access="public" mangled="_ZNK6b2Vec2ngEv" demangled="b2Vec2::operator-() const" location="f9:79" file="f9" line="79" endline="79" inline="1"/>
  <OperatorMethod id="_1717" name="()" returns="_179" const="1" context="_226" access="public" mangled="_ZNK6b2Vec2clEi" demangled="b2Vec2::operator()(int) const" location="f9:82" file="f9" line="82" endline="84" inline="1">
    <Argument name="i" type="_114" location="f9:82" file="f9" line="82"/>
  </OperatorMethod>
  <OperatorMethod id="_1718" name="()" returns="_4048" context="_226" access="public" mangled="_ZN6b2Vec2clEi" demangled="b2Vec2::operator()(int)" location="f9:88" file="f9" line="88" endline="90" inline="1">
    <Argument name="i" type="_114" location="f9:88" file="f9" line="88"/>
  </OperatorMethod>
  <OperatorMethod id="_1719" name="+=" returns="_1374" context="_226" access="public" mangled="_ZN6b2Vec2pLERKS_" demangled="b2Vec2::operator+=(b2Vec2 const&amp;)" location="f9:94" file="f9" line="94" endline="96" inline="1">
    <Argument name="v" type="_1469" location="f9:94" file="f9" line="94"/>
  </OperatorMethod>
  <OperatorMethod id="_1720" name="-=" returns="_1374" context="_226" access="public" mangled="_ZN6b2Vec2mIERKS_" demangled="b2Vec2::operator-=(b2Vec2 const&amp;)" location="f9:100" file="f9" line="100" endline="102" inline="1">
    <Argument name="v" type="_1469" location="f9:100" file="f9" line="100"/>
  </OperatorMethod>
  <OperatorMethod id="_1721" name="*=" returns="_1374" context="_226" access="public" mangled="_ZN6b2Vec2mLEf" demangled="b2Vec2::operator*=(float)" location="f9:106" file="f9" line="106" endline="108" inline="1">
    <Argument name="a" type="_179" location="f9:106" file="f9" line="106"/>
  </OperatorMethod>
  <Method id="_1722" name="Length" returns="_179" const="1" context="_226" access="public" mangled="_ZNK6b2Vec26LengthEv" demangled="b2Vec2::Length() const" location="f9:112" file="f9" line="112" endline="114" inline="1"/>
  <Method id="_1723" name="LengthSquared" returns="_179" const="1" context="_226" access="public" mangled="_ZNK6b2Vec213LengthSquaredEv" demangled="b2Vec2::LengthSquared() const" location="f9:119" file="f9" line="119" endline="121" inline="1"/>
  <Method id="_1724" name="Normalize" returns="_179" context="_226" access="public" mangled="_ZN6b2Vec29NormalizeEv" demangled="b2Vec2::Normalize()" location="f9:125" file="f9" line="125" endline="136" inline="1"/>
  <Method id="_1725" name="IsValid" returns="_1355" const="1" context="_226" access="public" mangled="_ZNK6b2Vec27IsValidEv" demangled="b2Vec2::IsValid() const" location="f9:140" file="f9" line="140" endline="142" inline="1"/>
  <Method id="_1726" name="Skew" returns="_226" const="1" context="_226" access="public" mangled="_ZNK6b2Vec24SkewEv" demangled="b2Vec2::Skew() const" location="f9:146" file="f9" line="146" endline="148" inline="1"/>
  <Field id="_1727" name="x" type="_179" offset="0" context="_227" access="public" location="f9:190" file="f9" line="190"/>
  <Field id="_1728" name="y" type="_179" offset="32" context="_227" access="public" location="f9:190" file="f9" line="190"/>
  <Field id="_1729" name="z" type="_179" offset="64" context="_227" access="public" location="f9:190" file="f9" line="190"/>
  <Destructor id="_1730" name="b2Vec3" artificial="1" throw="" context="_227" access="public" mangled="_ZN6b2Vec3D1Ev *INTERNAL* " demangled="b2Vec3::~b2Vec3()" location="f9:156" file="f9" line="156" endline="156" inline="1">
  </Destructor>
  <OperatorMethod id="_1731" name="=" returns="_4049" artificial="1" throw="" context="_227" access="public" mangled="_ZN6b2Vec3aSERKS_" demangled="b2Vec3::operator=(b2Vec3 const&amp;)" location="f9:156" file="f9" line="156" endline="156" inline="1">
    <Argument type="_2261" location="f9:156" file="f9" line="156"/>
  </OperatorMethod>
  <Constructor id="_1732" name="b2Vec3" artificial="1" throw="" context="_227" access="public" mangled="_ZN6b2Vec3C1ERKS_ *INTERNAL* " demangled="b2Vec3::b2Vec3(b2Vec3 const&amp;)" location="f9:156" file="f9" line="156" endline="156" inline="1">
    <Argument type="_2261" location="f9:156" file="f9" line="156"/>
  </Constructor>
  <Constructor id="_1733" name="b2Vec3" explicit="1" context="_227" access="public" mangled="_ZN6b2Vec3C1Ev *INTERNAL* " demangled="b2Vec3::b2Vec3()" location="f9:158" file="f9" line="158" inline="1"/>
  <Constructor id="_1734" name="b2Vec3" explicit="1" context="_227" access="public" mangled="_ZN6b2Vec3C1Efff *INTERNAL* " demangled="b2Vec3::b2Vec3(float, float, float)" location="f9:161" file="f9" line="161" endline="161" inline="1">
    <Argument name="x" type="_179" location="f9:161" file="f9" line="161"/>
    <Argument name="y" type="_179" location="f9:161" file="f9" line="161"/>
    <Argument name="z" type="_179" location="f9:161" file="f9" line="161"/>
  </Constructor>
  <Method id="_1735" name="SetZero" returns="_1374" context="_227" access="public" mangled="_ZN6b2Vec37SetZeroEv" demangled="b2Vec3::SetZero()" location="f9:164" file="f9" line="164" endline="164" inline="1"/>
  <Method id="_1736" name="Set" returns="_1374" context="_227" access="public" mangled="_ZN6b2Vec33SetEfff" demangled="b2Vec3::Set(float, float, float)" location="f9:167" file="f9" line="167" endline="167" inline="1">
    <Argument name="x_" type="_179" location="f9:167" file="f9" line="167"/>
    <Argument name="y_" type="_179" location="f9:167" file="f9" line="167"/>
    <Argument name="z_" type="_179" location="f9:167" file="f9" line="167"/>
  </Method>
  <OperatorMethod id="_1737" name="-" returns="_227" const="1" context="_227" access="public" mangled="_ZNK6b2Vec3ngEv" demangled="b2Vec3::operator-() const" location="f9:170" file="f9" line="170" endline="170" inline="1"/>
  <OperatorMethod id="_1738" name="+=" returns="_1374" context="_227" access="public" mangled="_ZN6b2Vec3pLERKS_" demangled="b2Vec3::operator+=(b2Vec3 const&amp;)" location="f9:173" file="f9" line="173" endline="175" inline="1">
    <Argument name="v" type="_2261" location="f9:173" file="f9" line="173"/>
  </OperatorMethod>
  <OperatorMethod id="_1739" name="-=" returns="_1374" context="_227" access="public" mangled="_ZN6b2Vec3mIERKS_" demangled="b2Vec3::operator-=(b2Vec3 const&amp;)" location="f9:179" file="f9" line="179" endline="181" inline="1">
    <Argument name="v" type="_2261" location="f9:179" file="f9" line="179"/>
  </OperatorMethod>
  <OperatorMethod id="_1740" name="*=" returns="_1374" context="_227" access="public" mangled="_ZN6b2Vec3mLEf" demangled="b2Vec3::operator*=(float)" location="f9:185" file="f9" line="185" endline="187" inline="1">
    <Argument name="s" type="_179" location="f9:185" file="f9" line="185"/>
  </OperatorMethod>
  <Field id="_1741" name="__size" type="_3979" offset="0" context="_235" access="public" location="f8:77" file="f8" line="77"/>
  <Field id="_1742" name="__align" type="_67" offset="0" context="_235" access="public" location="f8:78" file="f8" line="78"/>
  <Destructor id="_1743" name="._56" artificial="1" throw="" context="_235" access="public" mangled="_ZN19pthread_mutexattr_tD1Ev *INTERNAL* " demangled="pthread_mutexattr_t::~pthread_mutexattr_t()" location="f8:79" file="f8" line="79" endline="79" inline="1">
  </Destructor>
  <OperatorMethod id="_1744" name="=" returns="_4050" artificial="1" throw="" context="_235" access="public" mangled="_ZN19pthread_mutexattr_taSERKS_" demangled="pthread_mutexattr_t::operator=(pthread_mutexattr_t const&amp;)" location="f8:79" file="f8" line="79" endline="79" inline="1">
    <Argument type="_4051" location="f8:76" file="f8" line="76"/>
  </OperatorMethod>
  <Constructor id="_1745" name="._56" artificial="1" throw="" context="_235" access="public" mangled="_ZN19pthread_mutexattr_tC1ERKS_ *INTERNAL* " demangled="pthread_mutexattr_t::pthread_mutexattr_t(pthread_mutexattr_t const&amp;)" location="f8:79" file="f8" line="79" endline="79" inline="1">
    <Argument type="_4051" location="f8:76" file="f8" line="76"/>
  </Constructor>
  <Constructor id="_1746" name="._56" artificial="1" throw="" context="_235" access="public" mangled="_ZN19pthread_mutexattr_tC1Ev *INTERNAL* " demangled="pthread_mutexattr_t::pthread_mutexattr_t()" location="f8:79" file="f8" line="79" inline="1"/>
  <Field id="_1747" name="state" type="_1749" offset="0" context="_243" access="public" location="f33:47" file="f33" line="47"/>
  <Field id="_1748" name="t" type="_179" offset="32" context="_243" access="public" location="f33:48" file="f33" line="48"/>
  <Enumeration id="_1749" name="State" context="_243" access="public" location="f33:38" file="f33" line="38" artificial="1" size="32" align="32">
    <EnumValue name="e_unknown" init="0"/>
    <EnumValue name="e_failed" init="1"/>
    <EnumValue name="e_overlapped" init="2"/>
    <EnumValue name="e_touching" init="3"/>
    <EnumValue name="e_separated" init="4"/>
  </Enumeration>
  <Destructor id="_1750" name="b2TOIOutput" artificial="1" throw="" context="_243" access="public" mangled="_ZN11b2TOIOutputD1Ev *INTERNAL* " demangled="b2TOIOutput::~b2TOIOutput()" location="f33:37" file="f33" line="37" endline="37" inline="1">
  </Destructor>
  <OperatorMethod id="_1751" name="=" returns="_4052" artificial="1" throw="" context="_243" access="public" mangled="_ZN11b2TOIOutputaSERKS_" demangled="b2TOIOutput::operator=(b2TOIOutput const&amp;)" location="f33:37" file="f33" line="37" endline="37" inline="1">
    <Argument type="_4053" location="f33:37" file="f33" line="37"/>
  </OperatorMethod>
  <Constructor id="_1752" name="b2TOIOutput" artificial="1" throw="" context="_243" access="public" mangled="_ZN11b2TOIOutputC1ERKS_ *INTERNAL* " demangled="b2TOIOutput::b2TOIOutput(b2TOIOutput const&amp;)" location="f33:37" file="f33" line="37" endline="37" inline="1">
    <Argument type="_4053" location="f33:37" file="f33" line="37"/>
  </Constructor>
  <Constructor id="_1753" name="b2TOIOutput" artificial="1" throw="" context="_243" access="public" mangled="_ZN11b2TOIOutputC1Ev *INTERNAL* " demangled="b2TOIOutput::b2TOIOutput()" location="f33:37" file="f33" line="37" inline="1"/>
  <Struct id="_1754" name="__promote_2&lt;float,float&gt;" context="_246" mangled="N9__gnu_cxx11__promote_2IffEE" demangled="__gnu_cxx::__promote_2&lt;float, float&gt;" location="f73:170" file="f73" line="170" artificial="1" size="8" align="8" members="_4054 _4055 _4056 _4057 _4058 _4059 _4060 " bases=""/>
  <Struct id="_1755" name="__conditional_type&lt;true,__gnu_cxx::__numeric_traits_integer&lt;int&gt;,__gnu_cxx::__numeric_traits_floating&lt;int&gt; &gt;" context="_246" mangled="N9__gnu_cxx18__conditional_typeILb1ENS_24__numeric_traits_integerIiEENS_25__numeric_traits_floatingIiEEEE" demangled="__gnu_cxx::__conditional_type&lt;true, __gnu_cxx::__numeric_traits_integer&lt;int&gt;, __gnu_cxx::__numeric_traits_floating&lt;int&gt; &gt;" location="f73:54" file="f73" line="54" artificial="1" size="8" align="8" members="_4061 _4062 _4063 _4064 _4065 " bases=""/>
  <Function id="_1756" name="__verbose_terminate_handler" returns="_1374" context="_246" mangled="_ZN9__gnu_cxx27__verbose_terminate_handlerEv" demangled="__gnu_cxx::__verbose_terminate_handler()" location="f57:143" file="f57" line="143" extern="1"/>
  <Class id="_1757" name="new_allocator&lt;wchar_t&gt;" context="_246" mangled="N9__gnu_cxx13new_allocatorIwEE" demangled="__gnu_cxx::new_allocator&lt;wchar_t&gt;" location="f74:55" file="f74" line="55" artificial="1" size="8" align="8" members="_4066 _4067 _4068 _4069 _4070 _4071 _4072 _4073 _4074 _4075 _4076 _4077 _4078 _4079 _4080 _4081 _4082 _4083 " bases=""/>
  <Class id="_1758" name="new_allocator&lt;char&gt;" context="_246" mangled="N9__gnu_cxx13new_allocatorIcEE" demangled="__gnu_cxx::new_allocator&lt;char&gt;" location="f74:55" file="f74" line="55" artificial="1" size="8" align="8" members="_4084 _4085 _4086 _4087 _4088 _4089 _4090 _4091 _4092 _4093 _4094 _4095 _4096 _4097 _4098 _4099 _4100 _4101 " bases=""/>
  <Struct id="_1759" name="__numeric_traits_floating&lt;int&gt;" context="_246" incomplete="1" mangled="N9__gnu_cxx25__numeric_traits_floatingIiEE" demangled="__gnu_cxx::__numeric_traits_floating&lt;int&gt;" location="f75:101" file="f75" line="101" artificial="1" align="8"/>
  <Struct id="_1760" name="__numeric_traits&lt;int&gt;" context="_246" mangled="N9__gnu_cxx16__numeric_traitsIiEE" demangled="__gnu_cxx::__numeric_traits&lt;int&gt;" location="f75:128" file="f75" line="128" artificial="1" size="8" align="8" members="_4102 _4103 _4104 _4105 " bases="_1761 ">
    <Base type="_1761" access="public" virtual="0" offset="0"/>
  </Struct>
  <Struct id="_1761" name="__numeric_traits_integer&lt;int&gt;" context="_246" mangled="N9__gnu_cxx24__numeric_traits_integerIiEE" demangled="__gnu_cxx::__numeric_traits_integer&lt;int&gt;" location="f75:56" file="f75" line="56" artificial="1" size="8" align="8" members="_4106 _4107 _4108 _4109 _4110 _4111 _4112 _4113 " bases=""/>
  <Struct id="_1762" name="__add_unsigned&lt;wchar_t&gt;" context="_246" incomplete="1" mangled="N9__gnu_cxx14__add_unsignedIwEE" demangled="__gnu_cxx::__add_unsigned&lt;wchar_t&gt;" location="f73:64" file="f73" line="64" artificial="1" align="8"/>
  <Struct id="_1763" name="__add_unsigned&lt;bool&gt;" context="_246" incomplete="1" mangled="N9__gnu_cxx14__add_unsignedIbEE" demangled="__gnu_cxx::__add_unsigned&lt;bool&gt;" location="f73:64" file="f73" line="64" artificial="1" align="8"/>
  <Struct id="_1764" name="__add_unsigned&lt;long long int&gt;" context="_246" mangled="N9__gnu_cxx14__add_unsignedIxEE" demangled="__gnu_cxx::__add_unsigned&lt;long long&gt;" location="f73:94" file="f73" line="94" artificial="1" size="8" align="8" members="_4114 _4115 _4116 _4117 _4118 " bases=""/>
  <Struct id="_1765" name="__add_unsigned&lt;long int&gt;" context="_246" mangled="N9__gnu_cxx14__add_unsignedIlEE" demangled="__gnu_cxx::__add_unsigned&lt;long&gt;" location="f73:90" file="f73" line="90" artificial="1" size="8" align="8" members="_4119 _4120 _4121 _4122 _4123 " bases=""/>
  <Struct id="_1766" name="__add_unsigned&lt;int&gt;" context="_246" mangled="N9__gnu_cxx14__add_unsignedIiEE" demangled="__gnu_cxx::__add_unsigned&lt;int&gt;" location="f73:86" file="f73" line="86" artificial="1" size="8" align="8" members="_4124 _4125 _4126 _4127 _4128 " bases=""/>
  <Struct id="_1767" name="__add_unsigned&lt;short int&gt;" context="_246" mangled="N9__gnu_cxx14__add_unsignedIsEE" demangled="__gnu_cxx::__add_unsigned&lt;short&gt;" location="f73:82" file="f73" line="82" artificial="1" size="8" align="8" members="_4129 _4130 _4131 _4132 _4133 " bases=""/>
  <Struct id="_1768" name="__add_unsigned&lt;signed char&gt;" context="_246" mangled="N9__gnu_cxx14__add_unsignedIaEE" demangled="__gnu_cxx::__add_unsigned&lt;signed char&gt;" location="f73:78" file="f73" line="78" artificial="1" size="8" align="8" members="_4134 _4135 _4136 _4137 _4138 " bases=""/>
  <Struct id="_1769" name="__add_unsigned&lt;char&gt;" context="_246" mangled="N9__gnu_cxx14__add_unsignedIcEE" demangled="__gnu_cxx::__add_unsigned&lt;char&gt;" location="f73:74" file="f73" line="74" artificial="1" size="8" align="8" members="_4139 _4140 _4141 _4142 _4143 " bases=""/>
  <Struct id="_1770" name="__promote&lt;float,false&gt;" context="_246" mangled="N9__gnu_cxx9__promoteIfLb0EEE" demangled="__gnu_cxx::__promote&lt;float, false&gt;" location="f73:162" file="f73" line="162" artificial="1" size="8" align="8" members="_4144 _4145 _4146 _4147 _4148 " bases=""/>
  <Struct id="_1771" name="__enable_if&lt;false,double&gt;" context="_246" mangled="N9__gnu_cxx11__enable_ifILb0EdEE" demangled="__gnu_cxx::__enable_if&lt;false, double&gt;" location="f73:44" file="f73" line="44" artificial="1" size="8" align="8" members="_4149 _4150 _4151 _4152 " bases=""/>
  <Struct id="_1772" name="__enable_if&lt;true,float&gt;" context="_246" mangled="N9__gnu_cxx11__enable_ifILb1EfEE" demangled="__gnu_cxx::__enable_if&lt;true, float&gt;" location="f73:44" file="f73" line="44" artificial="1" size="8" align="8" members="_4153 _4154 _4155 _4156 _4157 " bases=""/>
  <Struct id="_1773" name="__remove_unsigned&lt;wchar_t&gt;" context="_246" incomplete="1" mangled="N9__gnu_cxx17__remove_unsignedIwEE" demangled="__gnu_cxx::__remove_unsigned&lt;wchar_t&gt;" location="f73:107" file="f73" line="107" artificial="1" align="8"/>
  <Struct id="_1774" name="__remove_unsigned&lt;bool&gt;" context="_246" incomplete="1" mangled="N9__gnu_cxx17__remove_unsignedIbEE" demangled="__gnu_cxx::__remove_unsigned&lt;bool&gt;" location="f73:107" file="f73" line="107" artificial="1" align="8"/>
  <Struct id="_1775" name="__remove_unsigned&lt;long long unsigned int&gt;" context="_246" mangled="N9__gnu_cxx17__remove_unsignedIyEE" demangled="__gnu_cxx::__remove_unsigned&lt;unsigned long long&gt;" location="f73:137" file="f73" line="137" artificial="1" size="8" align="8" members="_4158 _4159 _4160 _4161 _4162 " bases=""/>
  <Struct id="_1776" name="__remove_unsigned&lt;long unsigned int&gt;" context="_246" mangled="N9__gnu_cxx17__remove_unsignedImEE" demangled="__gnu_cxx::__remove_unsigned&lt;unsigned long&gt;" location="f73:133" file="f73" line="133" artificial="1" size="8" align="8" members="_4163 _4164 _4165 _4166 _4167 " bases=""/>
  <Struct id="_1777" name="__remove_unsigned&lt;unsigned int&gt;" context="_246" mangled="N9__gnu_cxx17__remove_unsignedIjEE" demangled="__gnu_cxx::__remove_unsigned&lt;unsigned int&gt;" location="f73:129" file="f73" line="129" artificial="1" size="8" align="8" members="_4168 _4169 _4170 _4171 _4172 " bases=""/>
  <Struct id="_1778" name="__remove_unsigned&lt;short unsigned int&gt;" context="_246" mangled="N9__gnu_cxx17__remove_unsignedItEE" demangled="__gnu_cxx::__remove_unsigned&lt;unsigned short&gt;" location="f73:125" file="f73" line="125" artificial="1" size="8" align="8" members="_4173 _4174 _4175 _4176 _4177 " bases=""/>
  <Struct id="_1779" name="__remove_unsigned&lt;unsigned char&gt;" context="_246" mangled="N9__gnu_cxx17__remove_unsignedIhEE" demangled="__gnu_cxx::__remove_unsigned&lt;unsigned char&gt;" location="f73:121" file="f73" line="121" artificial="1" size="8" align="8" members="_4178 _4179 _4180 _4181 _4182 " bases=""/>
  <Struct id="_1780" name="__remove_unsigned&lt;char&gt;" context="_246" mangled="N9__gnu_cxx17__remove_unsignedIcEE" demangled="__gnu_cxx::__remove_unsigned&lt;char&gt;" location="f73:117" file="f73" line="117" artificial="1" size="8" align="8" members="_4183 _4184 _4185 _4186 _4187 " bases=""/>
  <Field id="_1781" name="m_density" type="_179" offset="0" context="_248" access="protected" location="f34:211" file="f34" line="211"/>
  <Field id="_1782" name="m_next" type="_2225" offset="32" context="_248" access="protected" location="f34:213" file="f34" line="213"/>
  <Field id="_1783" name="m_body" type="_3999" offset="64" context="_248" access="protected" location="f34:214" file="f34" line="214"/>
  <Field id="_1784" name="m_shape" type="_4021" offset="96" context="_248" access="protected" location="f34:216" file="f34" line="216"/>
  <Field id="_1785" name="m_friction" type="_179" offset="128" context="_248" access="protected" location="f34:218" file="f34" line="218"/>
  <Field id="_1786" name="m_restitution" type="_179" offset="160" context="_248" access="protected" location="f34:219" file="f34" line="219"/>
  <Field id="_1787" name="m_proxies" type="_4188" offset="192" context="_248" access="protected" location="f34:221" file="f34" line="221"/>
  <Field id="_1788" name="m_proxyCount" type="_114" offset="224" context="_248" access="protected" location="f34:222" file="f34" line="222"/>
  <Field id="_1789" name="m_filter" type="_373" offset="256" context="_248" access="protected" location="f34:224" file="f34" line="224"/>
  <Field id="_1790" name="m_isSensor" type="_1355" offset="304" context="_248" access="protected" location="f34:226" file="f34" line="226"/>
  <Field id="_1791" name="m_userData" type="_688" offset="320" context="_248" access="protected" location="f34:228" file="f34" line="228"/>
  <Destructor id="_1792" name="b2Fixture" artificial="1" throw="" context="_248" access="public" mangled="_ZN9b2FixtureD1Ev *INTERNAL* " demangled="b2Fixture::~b2Fixture()" location="f34:104" file="f34" line="104" endline="104" inline="1">
  </Destructor>
  <OperatorMethod id="_1793" name="=" returns="_4189" artificial="1" throw="" context="_248" access="public" mangled="_ZN9b2FixtureaSERKS_" demangled="b2Fixture::operator=(b2Fixture const&amp;)" location="f34:104" file="f34" line="104" endline="104" inline="1">
    <Argument type="_4190" location="f34:104" file="f34" line="104"/>
  </OperatorMethod>
  <Constructor id="_1794" name="b2Fixture" artificial="1" throw="" context="_248" access="public" mangled="_ZN9b2FixtureC1ERKS_ *INTERNAL* " demangled="b2Fixture::b2Fixture(b2Fixture const&amp;)" location="f34:104" file="f34" line="104" endline="104" inline="1">
    <Argument type="_4190" location="f34:104" file="f34" line="104"/>
  </Constructor>
  <Method id="_1795" name="GetType" returns="_2378" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture7GetTypeEv" demangled="b2Fixture::GetType() const" location="f34:231" file="f34" line="231" endline="233" inline="1"/>
  <Method id="_1796" name="GetShape" returns="_4021" context="_248" access="public" mangled="_ZN9b2Fixture8GetShapeEv" demangled="b2Fixture::GetShape()" location="f34:236" file="f34" line="236" endline="238" inline="1"/>
  <Method id="_1797" name="GetShape" returns="_2111" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture8GetShapeEv" demangled="b2Fixture::GetShape() const" location="f34:241" file="f34" line="241" endline="243" inline="1"/>
  <Method id="_1798" name="SetSensor" returns="_1374" context="_248" access="public" mangled="_ZN9b2Fixture9SetSensorEb" demangled="b2Fixture::SetSensor(bool)" location="f34:117" file="f34" line="117" extern="1">
    <Argument name="sensor" type="_1355" location="f34:117" file="f34" line="117"/>
  </Method>
  <Method id="_1799" name="IsSensor" returns="_1355" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture8IsSensorEv" demangled="b2Fixture::IsSensor() const" location="f34:246" file="f34" line="246" endline="248" inline="1"/>
  <Method id="_1800" name="SetFilterData" returns="_1374" context="_248" access="public" mangled="_ZN9b2Fixture13SetFilterDataERK8b2Filter" demangled="b2Fixture::SetFilterData(b2Filter const&amp;)" location="f34:126" file="f34" line="126" extern="1">
    <Argument name="filter" type="_4191" location="f34:126" file="f34" line="126"/>
  </Method>
  <Method id="_1801" name="GetFilterData" returns="_4191" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture13GetFilterDataEv" demangled="b2Fixture::GetFilterData() const" location="f34:251" file="f34" line="251" endline="253" inline="1"/>
  <Method id="_1802" name="Refilter" returns="_1374" context="_248" access="public" mangled="_ZN9b2Fixture8RefilterEv" demangled="b2Fixture::Refilter()" location="f34:132" file="f34" line="132" extern="1"/>
  <Method id="_1803" name="GetBody" returns="_3999" context="_248" access="public" mangled="_ZN9b2Fixture7GetBodyEv" demangled="b2Fixture::GetBody()" location="f34:266" file="f34" line="266" endline="268" inline="1"/>
  <Method id="_1804" name="GetBody" returns="_4192" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture7GetBodyEv" demangled="b2Fixture::GetBody() const" location="f34:271" file="f34" line="271" endline="273" inline="1"/>
  <Method id="_1805" name="GetNext" returns="_2225" context="_248" access="public" mangled="_ZN9b2Fixture7GetNextEv" demangled="b2Fixture::GetNext()" location="f34:276" file="f34" line="276" endline="278" inline="1"/>
  <Method id="_1806" name="GetNext" returns="_3995" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture7GetNextEv" demangled="b2Fixture::GetNext() const" location="f34:281" file="f34" line="281" endline="283" inline="1"/>
  <Method id="_1807" name="GetUserData" returns="_688" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture11GetUserDataEv" demangled="b2Fixture::GetUserData() const" location="f34:256" file="f34" line="256" endline="258" inline="1"/>
  <Method id="_1808" name="SetUserData" returns="_1374" context="_248" access="public" mangled="_ZN9b2Fixture11SetUserDataEPv" demangled="b2Fixture::SetUserData(void*)" location="f34:261" file="f34" line="261" endline="263" inline="1">
    <Argument name="data" type="_688" location="f34:261" file="f34" line="261"/>
  </Method>
  <Method id="_1809" name="TestPoint" returns="_1355" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture9TestPointERK6b2Vec2" demangled="b2Fixture::TestPoint(b2Vec2 const&amp;) const" location="f34:317" file="f34" line="317" endline="319" inline="1">
    <Argument name="p" type="_1469" location="f34:317" file="f34" line="317"/>
  </Method>
  <Method id="_1810" name="RayCast" returns="_1355" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture7RayCastEP15b2RayCastOutputRK14b2RayCastInputi" demangled="b2Fixture::RayCast(b2RayCastOutput*, b2RayCastInput const&amp;, int) const" location="f34:322" file="f34" line="322" endline="324" inline="1">
    <Argument name="output" type="_4022" location="f34:322" file="f34" line="322"/>
    <Argument name="input" type="_4023" location="f34:322" file="f34" line="322"/>
    <Argument name="childIndex" type="_114" location="f34:322" file="f34" line="322"/>
  </Method>
  <Method id="_1811" name="GetMassData" returns="_1374" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture11GetMassDataEP10b2MassData" demangled="b2Fixture::GetMassData(b2MassData*) const" location="f34:327" file="f34" line="327" endline="329" inline="1">
    <Argument name="massData" type="_4025" location="f34:327" file="f34" line="327"/>
  </Method>
  <Method id="_1812" name="SetDensity" returns="_1374" context="_248" access="public" mangled="_ZN9b2Fixture10SetDensityEf" demangled="b2Fixture::SetDensity(float)" location="f34:286" file="f34" line="286" endline="289" inline="1">
    <Argument name="density" type="_179" location="f34:286" file="f34" line="286"/>
  </Method>
  <Method id="_1813" name="GetDensity" returns="_179" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture10GetDensityEv" demangled="b2Fixture::GetDensity() const" location="f34:292" file="f34" line="292" endline="294" inline="1"/>
  <Method id="_1814" name="GetFriction" returns="_179" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture11GetFrictionEv" demangled="b2Fixture::GetFriction() const" location="f34:297" file="f34" line="297" endline="299" inline="1"/>
  <Method id="_1815" name="SetFriction" returns="_1374" context="_248" access="public" mangled="_ZN9b2Fixture11SetFrictionEf" demangled="b2Fixture::SetFriction(float)" location="f34:302" file="f34" line="302" endline="304" inline="1">
    <Argument name="friction" type="_179" location="f34:302" file="f34" line="302"/>
  </Method>
  <Method id="_1816" name="GetRestitution" returns="_179" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture14GetRestitutionEv" demangled="b2Fixture::GetRestitution() const" location="f34:307" file="f34" line="307" endline="309" inline="1"/>
  <Method id="_1817" name="SetRestitution" returns="_1374" context="_248" access="public" mangled="_ZN9b2Fixture14SetRestitutionEf" demangled="b2Fixture::SetRestitution(float)" location="f34:312" file="f34" line="312" endline="314" inline="1">
    <Argument name="restitution" type="_179" location="f34:312" file="f34" line="312"/>
  </Method>
  <Method id="_1818" name="GetAABB" returns="_2110" const="1" context="_248" access="public" mangled="_ZNK9b2Fixture7GetAABBEi" demangled="b2Fixture::GetAABB(int) const" location="f34:332" file="f34" line="332" endline="335" inline="1">
    <Argument name="childIndex" type="_114" location="f34:332" file="f34" line="332"/>
  </Method>
  <Constructor id="_1819" name="b2Fixture" explicit="1" context="_248" access="protected" mangled="_ZN9b2FixtureC1Ev *INTERNAL* " demangled="b2Fixture::b2Fixture()" location="f34:198" file="f34" line="198" extern="1"/>
  <Method id="_1820" name="Create" returns="_1374" context="_248" access="protected" mangled="_ZN9b2Fixture6CreateEP16b2BlockAllocatorP6b2BodyPK12b2FixtureDef" demangled="b2Fixture::Create(b2BlockAllocator*, b2Body*, b2FixtureDef const*)" location="f34:202" file="f34" line="202" extern="1">
    <Argument name="allocator" type="_2226" location="f34:202" file="f34" line="202"/>
    <Argument name="body" type="_3999" location="f34:202" file="f34" line="202"/>
    <Argument name="def" type="_4193" location="f34:202" file="f34" line="202"/>
  </Method>
  <Method id="_1821" name="Destroy" returns="_1374" context="_248" access="protected" mangled="_ZN9b2Fixture7DestroyEP16b2BlockAllocator" demangled="b2Fixture::Destroy(b2BlockAllocator*)" location="f34:203" file="f34" line="203" extern="1">
    <Argument name="allocator" type="_2226" location="f34:203" file="f34" line="203"/>
  </Method>
  <Method id="_1822" name="CreateProxies" returns="_1374" context="_248" access="protected" mangled="_ZN9b2Fixture13CreateProxiesEP12b2BroadPhaseRK11b2Transform" demangled="b2Fixture::CreateProxies(b2BroadPhase*, b2Transform const&amp;)" location="f34:206" file="f34" line="206" extern="1">
    <Argument name="broadPhase" type="_4194" location="f34:206" file="f34" line="206"/>
    <Argument name="xf" type="_1854" location="f34:206" file="f34" line="206"/>
  </Method>
  <Method id="_1823" name="DestroyProxies" returns="_1374" context="_248" access="protected" mangled="_ZN9b2Fixture14DestroyProxiesEP12b2BroadPhase" demangled="b2Fixture::DestroyProxies(b2BroadPhase*)" location="f34:207" file="f34" line="207" extern="1">
    <Argument name="broadPhase" type="_4194" location="f34:207" file="f34" line="207"/>
  </Method>
  <Method id="_1824" name="Synchronize" returns="_1374" context="_248" access="protected" mangled="_ZN9b2Fixture11SynchronizeEP12b2BroadPhaseRK11b2TransformS4_" demangled="b2Fixture::Synchronize(b2BroadPhase*, b2Transform const&amp;, b2Transform const&amp;)" location="f34:209" file="f34" line="209" extern="1">
    <Argument name="broadPhase" type="_4194" location="f34:209" file="f34" line="209"/>
    <Argument name="xf1" type="_1854" location="f34:209" file="f34" line="209"/>
    <Argument name="xf2" type="_1854" location="f34:209" file="f34" line="209"/>
  </Method>
  <PointerType id="_1825" type="_185" size="32" align="32"/>
  <CvQualifiedType id="_1825r" type="_1825" restrict="1"/>
  <PointerType id="_1827" type="_67" size="32" align="32"/>
  <CvQualifiedType id="_1827r" type="_1827" restrict="1"/>
  <Field id="_1829" name="m_broadPhase" type="_65" offset="0" context="_254" access="public" location="f35:44" file="f35" line="44"/>
  <Field id="_1830" name="m_contactList" type="_2224" offset="480" context="_254" access="public" location="f35:45" file="f35" line="45"/>
  <Field id="_1831" name="m_contactCount" type="_114" offset="512" context="_254" access="public" location="f35:46" file="f35" line="46"/>
  <Field id="_1832" name="m_contactFilter" type="_4195" offset="544" context="_254" access="public" location="f35:47" file="f35" line="47"/>
  <Field id="_1833" name="m_contactListener" type="_3998" offset="576" context="_254" access="public" location="f35:48" file="f35" line="48"/>
  <Field id="_1834" name="m_allocator" type="_2226" offset="608" context="_254" access="public" location="f35:49" file="f35" line="49"/>
  <Destructor id="_1835" name="b2ContactManager" artificial="1" context="_254" access="public" mangled="_ZN16b2ContactManagerD1Ev *INTERNAL* " demangled="b2ContactManager::~b2ContactManager()" location="f35:31" file="f35" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1836" name="=" returns="_4196" artificial="1" throw="" context="_254" access="public" mangled="_ZN16b2ContactManageraSERKS_" demangled="b2ContactManager::operator=(b2ContactManager const&amp;)" location="f35:31" file="f35" line="31" endline="31" inline="1">
    <Argument type="_4197" location="f35:31" file="f35" line="31"/>
  </OperatorMethod>
  <Constructor id="_1837" name="b2ContactManager" artificial="1" throw="" context="_254" access="public" mangled="_ZN16b2ContactManagerC1ERKS_ *INTERNAL* " demangled="b2ContactManager::b2ContactManager(b2ContactManager const&amp;)" location="f35:31" file="f35" line="31" endline="31" inline="1">
    <Argument type="_4197" location="f35:31" file="f35" line="31"/>
  </Constructor>
  <Constructor id="_1838" name="b2ContactManager" explicit="1" context="_254" access="public" mangled="_ZN16b2ContactManagerC1Ev *INTERNAL* " demangled="b2ContactManager::b2ContactManager()" location="f35:33" file="f35" line="33" extern="1"/>
  <Method id="_1839" name="AddPair" returns="_1374" context="_254" access="public" mangled="_ZN16b2ContactManager7AddPairEPvS0_" demangled="b2ContactManager::AddPair(void*, void*)" location="f35:36" file="f35" line="36" extern="1">
    <Argument name="proxyUserDataA" type="_688" location="f35:36" file="f35" line="36"/>
    <Argument name="proxyUserDataB" type="_688" location="f35:36" file="f35" line="36"/>
  </Method>
  <Method id="_1840" name="FindNewContacts" returns="_1374" context="_254" access="public" mangled="_ZN16b2ContactManager15FindNewContactsEv" demangled="b2ContactManager::FindNewContacts()" location="f35:38" file="f35" line="38" extern="1"/>
  <Method id="_1841" name="Destroy" returns="_1374" context="_254" access="public" mangled="_ZN16b2ContactManager7DestroyEP9b2Contact" demangled="b2ContactManager::Destroy(b2Contact*)" location="f35:40" file="f35" line="40" extern="1">
    <Argument name="c" type="_2224" location="f35:40" file="f35" line="40"/>
  </Method>
  <Method id="_1842" name="Collide" returns="_1374" context="_254" access="public" mangled="_ZN16b2ContactManager7CollideEv" demangled="b2ContactManager::Collide()" location="f35:42" file="f35" line="42" extern="1"/>
  <Field id="_1843" name="__locales" type="_4198" offset="0" context="_255" access="public" location="f36:31" file="f36" line="31"/>
  <Field id="_1844" name="__ctype_b" type="_4199" offset="416" context="_255" access="public" location="f36:34" file="f36" line="34"/>
  <Field id="_1845" name="__ctype_tolower" type="_4200" offset="448" context="_255" access="public" location="f36:35" file="f36" line="35"/>
  <Field id="_1846" name="__ctype_toupper" type="_4200" offset="480" context="_255" access="public" location="f36:36" file="f36" line="36"/>
  <Field id="_1847" name="__names" type="_4201" offset="512" context="_255" access="public" location="f36:39" file="f36" line="39"/>
  <Destructor id="_1848" name="__locale_struct" artificial="1" throw="" context="_255" access="public" mangled="_ZN15__locale_structD1Ev *INTERNAL* " demangled="__locale_struct::~__locale_struct()" location="f36:29" file="f36" line="29" endline="29" inline="1">
  </Destructor>
  <OperatorMethod id="_1849" name="=" returns="_4202" artificial="1" throw="" context="_255" access="public" mangled="_ZN15__locale_structaSERKS_" demangled="__locale_struct::operator=(__locale_struct const&amp;)" location="f36:29" file="f36" line="29" endline="29" inline="1">
    <Argument type="_4203" location="f36:29" file="f36" line="29"/>
  </OperatorMethod>
  <Constructor id="_1850" name="__locale_struct" artificial="1" throw="" context="_255" access="public" mangled="_ZN15__locale_structC1ERKS_ *INTERNAL* " demangled="__locale_struct::__locale_struct(__locale_struct const&amp;)" location="f36:29" file="f36" line="29" endline="29" inline="1">
    <Argument type="_4203" location="f36:29" file="f36" line="29"/>
  </Constructor>
  <Constructor id="_1851" name="__locale_struct" artificial="1" throw="" context="_255" access="public" mangled="_ZN15__locale_structC1Ev *INTERNAL* " demangled="__locale_struct::__locale_struct()" location="f36:29" file="f36" line="29" inline="1"/>
  <PointerType id="_1852" type="_878" size="32" align="32"/>
  <PointerType id="_1853" type="_101c" size="32" align="32"/>
  <ReferenceType id="_1854" type="_462c" size="32" align="32"/>
  <PointerType id="_1855" type="_834c" size="32" align="32"/>
  <Field id="_1856" name="localAnchorA" type="_226" offset="160" context="_278" access="public" location="f37:41" file="f37" line="41"/>
  <Field id="_1857" name="localAnchorB" type="_226" offset="224" context="_278" access="public" location="f37:44" file="f37" line="44"/>
  <Field id="_1858" name="maxForce" type="_179" offset="288" context="_278" access="public" location="f37:47" file="f37" line="47"/>
  <Field id="_1859" name="maxTorque" type="_179" offset="320" context="_278" access="public" location="f37:50" file="f37" line="50"/>
  <Destructor id="_1860" name="b2FrictionJointDef" artificial="1" throw="" context="_278" access="public" mangled="_ZN18b2FrictionJointDefD1Ev *INTERNAL* " demangled="b2FrictionJointDef::~b2FrictionJointDef()" location="f37:26" file="f37" line="26" endline="26" inline="1">
  </Destructor>
  <OperatorMethod id="_1861" name="=" returns="_4207" artificial="1" throw="" context="_278" access="public" mangled="_ZN18b2FrictionJointDefaSERKS_" demangled="b2FrictionJointDef::operator=(b2FrictionJointDef const&amp;)" location="f37:26" file="f37" line="26" endline="26" inline="1">
    <Argument type="_4208" location="f37:26" file="f37" line="26"/>
  </OperatorMethod>
  <Constructor id="_1862" name="b2FrictionJointDef" artificial="1" throw="" context="_278" access="public" mangled="_ZN18b2FrictionJointDefC1ERKS_ *INTERNAL* " demangled="b2FrictionJointDef::b2FrictionJointDef(b2FrictionJointDef const&amp;)" location="f37:26" file="f37" line="26" endline="26" inline="1">
    <Argument type="_4208" location="f37:26" file="f37" line="26"/>
  </Constructor>
  <Constructor id="_1863" name="b2FrictionJointDef" explicit="1" context="_278" access="public" mangled="_ZN18b2FrictionJointDefC1Ev *INTERNAL* " demangled="b2FrictionJointDef::b2FrictionJointDef()" location="f37:27" file="f37" line="27" endline="33" inline="1"/>
  <Method id="_1864" name="Initialize" returns="_1374" context="_278" access="public" mangled="_ZN18b2FrictionJointDef10InitializeEP6b2BodyS1_RK6b2Vec2" demangled="b2FrictionJointDef::Initialize(b2Body*, b2Body*, b2Vec2 const&amp;)" location="f37:38" file="f37" line="38" extern="1">
    <Argument name="bodyA" type="_3999" location="f37:38" file="f37" line="38"/>
    <Argument name="bodyB" type="_3999" location="f37:38" file="f37" line="38"/>
    <Argument name="anchor" type="_1469" location="f37:38" file="f37" line="38"/>
  </Method>
  <Field id="_1865" name="m_localAnchorB" type="_226" offset="512" context="_290" access="protected" location="f39:101" file="f39" line="101"/>
  <Field id="_1866" name="m_targetA" type="_226" offset="576" context="_290" access="protected" location="f39:102" file="f39" line="102"/>
  <Field id="_1867" name="m_frequencyHz" type="_179" offset="640" context="_290" access="protected" location="f39:103" file="f39" line="103"/>
  <Field id="_1868" name="m_dampingRatio" type="_179" offset="672" context="_290" access="protected" location="f39:104" file="f39" line="104"/>
  <Field id="_1869" name="m_beta" type="_179" offset="704" context="_290" access="protected" location="f39:105" file="f39" line="105"/>
  <Field id="_1870" name="m_impulse" type="_226" offset="736" context="_290" access="protected" location="f39:108" file="f39" line="108"/>
  <Field id="_1871" name="m_maxForce" type="_179" offset="800" context="_290" access="protected" location="f39:109" file="f39" line="109"/>
  <Field id="_1872" name="m_gamma" type="_179" offset="832" context="_290" access="protected" location="f39:110" file="f39" line="110"/>
  <Field id="_1873" name="m_indexA" type="_114" offset="864" context="_290" access="protected" location="f39:113" file="f39" line="113"/>
  <Field id="_1874" name="m_indexB" type="_114" offset="896" context="_290" access="protected" location="f39:114" file="f39" line="114"/>
  <Field id="_1875" name="m_rB" type="_226" offset="928" context="_290" access="protected" location="f39:115" file="f39" line="115"/>
  <Field id="_1876" name="m_localCenterB" type="_226" offset="992" context="_290" access="protected" location="f39:116" file="f39" line="116"/>
  <Field id="_1877" name="m_invMassB" type="_179" offset="1056" context="_290" access="protected" location="f39:117" file="f39" line="117"/>
  <Field id="_1878" name="m_invIB" type="_179" offset="1088" context="_290" access="protected" location="f39:118" file="f39" line="118"/>
  <Field id="_1879" name="m_mass" type="_43" offset="1120" context="_290" access="protected" location="f39:119" file="f39" line="119"/>
  <Field id="_1880" name="m_C" type="_226" offset="1248" context="_290" access="protected" location="f39:120" file="f39" line="120"/>
  <OperatorMethod id="_1881" name="=" returns="_4209" artificial="1" throw="" context="_290" access="public" mangled="_ZN12b2MouseJointaSERKS_" demangled="b2MouseJoint::operator=(b2MouseJoint const&amp;)" location="f39:61" file="f39" line="61" endline="61" inline="1">
    <Argument type="_4210" location="f39:61" file="f39" line="61"/>
  </OperatorMethod>
  <Constructor id="_1882" name="b2MouseJoint" artificial="1" throw="" context="_290" access="public" mangled="_ZN12b2MouseJointC1ERKS_ *INTERNAL* " demangled="b2MouseJoint::b2MouseJoint(b2MouseJoint const&amp;)" location="f39:61" file="f39" line="61" endline="61" inline="1">
    <Argument type="_4210" location="f39:61" file="f39" line="61"/>
  </Constructor>
  <Method id="_1883" name="GetAnchorA" returns="_226" const="1" virtual="1" overrides="_2801 " context="_290" access="public" mangled="_ZNK12b2MouseJoint10GetAnchorAEv" demangled="b2MouseJoint::GetAnchorA() const" location="f39:65" file="f39" line="65" extern="1"/>
  <Method id="_1884" name="GetAnchorB" returns="_226" const="1" virtual="1" overrides="_2802 " context="_290" access="public" mangled="_ZNK12b2MouseJoint10GetAnchorBEv" demangled="b2MouseJoint::GetAnchorB() const" location="f39:68" file="f39" line="68" extern="1"/>
  <Method id="_1885" name="GetReactionForce" returns="_226" const="1" virtual="1" overrides="_2803 " context="_290" access="public" mangled="_ZNK12b2MouseJoint16GetReactionForceEf" demangled="b2MouseJoint::GetReactionForce(float) const" location="f39:71" file="f39" line="71" extern="1">
    <Argument name="inv_dt" type="_179" location="f39:71" file="f39" line="71"/>
  </Method>
  <Method id="_1886" name="GetReactionTorque" returns="_179" const="1" virtual="1" overrides="_2804 " context="_290" access="public" mangled="_ZNK12b2MouseJoint17GetReactionTorqueEf" demangled="b2MouseJoint::GetReactionTorque(float) const" location="f39:74" file="f39" line="74" extern="1">
    <Argument name="inv_dt" type="_179" location="f39:74" file="f39" line="74"/>
  </Method>
  <Method id="_1887" name="SetTarget" returns="_1374" context="_290" access="public" mangled="_ZN12b2MouseJoint9SetTargetERK6b2Vec2" demangled="b2MouseJoint::SetTarget(b2Vec2 const&amp;)" location="f39:77" file="f39" line="77" extern="1">
    <Argument name="target" type="_1469" location="f39:77" file="f39" line="77"/>
  </Method>
  <Method id="_1888" name="GetTarget" returns="_1469" const="1" context="_290" access="public" mangled="_ZNK12b2MouseJoint9GetTargetEv" demangled="b2MouseJoint::GetTarget() const" location="f39:78" file="f39" line="78" extern="1"/>
  <Method id="_1889" name="SetMaxForce" returns="_1374" context="_290" access="public" mangled="_ZN12b2MouseJoint11SetMaxForceEf" demangled="b2MouseJoint::SetMaxForce(float)" location="f39:81" file="f39" line="81" extern="1">
    <Argument name="force" type="_179" location="f39:81" file="f39" line="81"/>
  </Method>
  <Method id="_1890" name="GetMaxForce" returns="_179" const="1" context="_290" access="public" mangled="_ZNK12b2MouseJoint11GetMaxForceEv" demangled="b2MouseJoint::GetMaxForce() const" location="f39:82" file="f39" line="82" extern="1"/>
  <Method id="_1891" name="SetFrequency" returns="_1374" context="_290" access="public" mangled="_ZN12b2MouseJoint12SetFrequencyEf" demangled="b2MouseJoint::SetFrequency(float)" location="f39:85" file="f39" line="85" extern="1">
    <Argument name="hz" type="_179" location="f39:85" file="f39" line="85"/>
  </Method>
  <Method id="_1892" name="GetFrequency" returns="_179" const="1" context="_290" access="public" mangled="_ZNK12b2MouseJoint12GetFrequencyEv" demangled="b2MouseJoint::GetFrequency() const" location="f39:86" file="f39" line="86" extern="1"/>
  <Method id="_1893" name="SetDampingRatio" returns="_1374" context="_290" access="public" mangled="_ZN12b2MouseJoint15SetDampingRatioEf" demangled="b2MouseJoint::SetDampingRatio(float)" location="f39:89" file="f39" line="89" extern="1">
    <Argument name="ratio" type="_179" location="f39:89" file="f39" line="89"/>
  </Method>
  <Method id="_1894" name="GetDampingRatio" returns="_179" const="1" context="_290" access="public" mangled="_ZNK12b2MouseJoint15GetDampingRatioEv" demangled="b2MouseJoint::GetDampingRatio() const" location="f39:90" file="f39" line="90" extern="1"/>
  <Constructor id="_1895" name="b2MouseJoint" context="_290" access="protected" mangled="_ZN12b2MouseJointC1EPK15b2MouseJointDef *INTERNAL* " demangled="b2MouseJoint::b2MouseJoint(b2MouseJointDef const*)" location="f39:95" file="f39" line="95" extern="1">
    <Argument name="def" type="_4211" location="f39:95" file="f39" line="95"/>
  </Constructor>
  <Method id="_1896" name="InitVelocityConstraints" returns="_1374" virtual="1" overrides="_2815 " context="_290" access="protected" mangled="_ZN12b2MouseJoint23InitVelocityConstraintsERK12b2SolverData" demangled="b2MouseJoint::InitVelocityConstraints(b2SolverData const&amp;)" location="f39:97" file="f39" line="97" extern="1">
    <Argument name="data" type="_4003" location="f39:97" file="f39" line="97"/>
  </Method>
  <Method id="_1897" name="SolveVelocityConstraints" returns="_1374" virtual="1" overrides="_2816 " context="_290" access="protected" mangled="_ZN12b2MouseJoint24SolveVelocityConstraintsERK12b2SolverData" demangled="b2MouseJoint::SolveVelocityConstraints(b2SolverData const&amp;)" location="f39:98" file="f39" line="98" extern="1">
    <Argument name="data" type="_4003" location="f39:98" file="f39" line="98"/>
  </Method>
  <Method id="_1898" name="SolvePositionConstraints" returns="_1355" virtual="1" overrides="_2817 " context="_290" access="protected" mangled="_ZN12b2MouseJoint24SolvePositionConstraintsERK12b2SolverData" demangled="b2MouseJoint::SolvePositionConstraints(b2SolverData const&amp;)" location="f39:99" file="f39" line="99" extern="1">
    <Argument name="data" type="_4003" location="f39:99" file="f39" line="99"/>
  </Method>
  <Destructor id="_1899" name="b2MouseJoint" virtual="1" overrides="_2814 " artificial="1" context="_290" access="public" mangled="_ZN12b2MouseJointD1Ev *INTERNAL* " demangled="b2MouseJoint::~b2MouseJoint()" location="f39:61" file="f39" line="61" endline="61" inline="1">
  </Destructor>
  <CvQualifiedType id="_688r" type="_688" restrict="1"/>
  <CvQualifiedType id="_1686r" type="_1686" restrict="1"/>
  <Field id="_1902" name="type" type="_113" offset="0" context="_295" access="public" location="f16:323" file="f16" line="323"/>
  <Field id="_1903" name="name" type="_685" offset="32" context="_295" access="public" location="f16:324" file="f16" line="324"/>
  <Field id="_1904" name="arg1" type="_195" offset="64" context="_295" access="public" location="f16:325" file="f16" line="325"/>
  <Field id="_1905" name="arg2" type="_195" offset="128" context="_295" access="public" location="f16:326" file="f16" line="326"/>
  <Field id="_1906" name="retval" type="_195" offset="192" context="_295" access="public" location="f16:327" file="f16" line="327"/>
  <Destructor id="_1907" name="__exception" artificial="1" throw="" context="_295" access="public" mangled="_ZN11__exceptionD1Ev *INTERNAL* " demangled="__exception::~__exception()" location="f16:322" file="f16" line="322" endline="322" inline="1">
  </Destructor>
  <OperatorMethod id="_1908" name="=" returns="_4212" artificial="1" throw="" context="_295" access="public" mangled="_ZN11__exceptionaSERKS_" demangled="__exception::operator=(__exception const&amp;)" location="f16:322" file="f16" line="322" endline="322" inline="1">
    <Argument type="_4213" location="f16:322" file="f16" line="322"/>
  </OperatorMethod>
  <Constructor id="_1909" name="__exception" artificial="1" throw="" context="_295" access="public" mangled="_ZN11__exceptionC1ERKS_ *INTERNAL* " demangled="__exception::__exception(__exception const&amp;)" location="f16:322" file="f16" line="322" endline="322" inline="1">
    <Argument type="_4213" location="f16:322" file="f16" line="322"/>
  </Constructor>
  <Constructor id="_1910" name="__exception" artificial="1" throw="" context="_295" access="public" mangled="_ZN11__exceptionC1Ev *INTERNAL* " demangled="__exception::__exception()" location="f16:322" file="f16" line="322" inline="1"/>
  <PointerType id="_1911" type="_1367" size="32" align="32"/>
  <CvQualifiedType id="_1911r" type="_1911" restrict="1"/>
  <CvQualifiedType id="_1656r" type="_1656" restrict="1"/>
  <PointerType id="_1914" type="_688" size="32" align="32"/>
  <PointerType id="_1915" type="_18" size="32" align="32"/>
  <Field id="_1916" name="m_vertices" type="_4214" offset="96" context="_321" access="protected" location="f41:82" file="f41" line="82"/>
  <Field id="_1917" name="m_count" type="_114" offset="128" context="_321" access="protected" location="f41:85" file="f41" line="85"/>
  <OperatorMethod id="_1918" name="=" returns="_4215" artificial="1" throw="" context="_321" access="public" mangled="_ZN11b2LoopShapeaSERKS_" demangled="b2LoopShape::operator=(b2LoopShape const&amp;)" location="f41:32" file="f41" line="32" endline="32" inline="1">
    <Argument type="_4216" location="f41:32" file="f41" line="32"/>
  </OperatorMethod>
  <Constructor id="_1919" name="b2LoopShape" artificial="1" throw="" context="_321" access="public" mangled="_ZN11b2LoopShapeC1ERKS_ *INTERNAL* " demangled="b2LoopShape::b2LoopShape(b2LoopShape const&amp;)" location="f41:32" file="f41" line="32" endline="32" inline="1">
    <Argument type="_4216" location="f41:32" file="f41" line="32"/>
  </Constructor>
  <Constructor id="_1920" name="b2LoopShape" explicit="1" context="_321" access="public" mangled="_ZN11b2LoopShapeC1Ev *INTERNAL* " demangled="b2LoopShape::b2LoopShape()" location="f41:88" file="f41" line="88" endline="94" inline="1"/>
  <Destructor id="_1921" name="b2LoopShape" virtual="1" overrides="_2382 " context="_321" access="public" mangled="_ZN11b2LoopShapeD1Ev *INTERNAL* " demangled="b2LoopShape::~b2LoopShape()" location="f41:37" file="f41" line="37" extern="1">
  </Destructor>
  <Method id="_1922" name="Create" returns="_1374" context="_321" access="public" mangled="_ZN11b2LoopShape6CreateEPK6b2Vec2i" demangled="b2LoopShape::Create(b2Vec2 const*, int)" location="f41:40" file="f41" line="40" extern="1">
    <Argument name="vertices" type="_4217" location="f41:40" file="f41" line="40"/>
    <Argument name="count" type="_114" location="f41:40" file="f41" line="40"/>
  </Method>
  <Method id="_1923" name="Clone" returns="_4021" const="1" virtual="1" overrides="_2383 " context="_321" access="public" mangled="_ZNK11b2LoopShape5CloneEP16b2BlockAllocator" demangled="b2LoopShape::Clone(b2BlockAllocator*) const" location="f41:43" file="f41" line="43" extern="1">
    <Argument name="allocator" type="_2226" location="f41:43" file="f41" line="43"/>
  </Method>
  <Method id="_1924" name="GetChildCount" returns="_114" const="1" virtual="1" overrides="_2385 " context="_321" access="public" mangled="_ZNK11b2LoopShape13GetChildCountEv" demangled="b2LoopShape::GetChildCount() const" location="f41:46" file="f41" line="46" extern="1"/>
  <Method id="_1925" name="GetChildEdge" returns="_1374" const="1" context="_321" access="public" mangled="_ZNK11b2LoopShape12GetChildEdgeEP11b2EdgeShapei" demangled="b2LoopShape::GetChildEdge(b2EdgeShape*, int) const" location="f41:49" file="f41" line="49" extern="1">
    <Argument name="edge" type="_4218" location="f41:49" file="f41" line="49"/>
    <Argument name="index" type="_114" location="f41:49" file="f41" line="49"/>
  </Method>
  <Method id="_1926" name="TestPoint" returns="_1355" const="1" virtual="1" overrides="_2386 " context="_321" access="public" mangled="_ZNK11b2LoopShape9TestPointERK11b2TransformRK6b2Vec2" demangled="b2LoopShape::TestPoint(b2Transform const&amp;, b2Vec2 const&amp;) const" location="f41:53" file="f41" line="53" extern="1">
    <Argument name="transform" type="_1854" location="f41:53" file="f41" line="53"/>
    <Argument name="p" type="_1469" location="f41:53" file="f41" line="53"/>
  </Method>
  <Method id="_1927" name="RayCast" returns="_1355" const="1" virtual="1" overrides="_2387 " context="_321" access="public" mangled="_ZNK11b2LoopShape7RayCastEP15b2RayCastOutputRK14b2RayCastInputRK11b2Transformi" demangled="b2LoopShape::RayCast(b2RayCastOutput*, b2RayCastInput const&amp;, b2Transform const&amp;, int) const" location="f41:57" file="f41" line="57" extern="1">
    <Argument name="output" type="_4022" location="f41:57" file="f41" line="57"/>
    <Argument name="input" type="_4023" location="f41:57" file="f41" line="57"/>
    <Argument name="transform" type="_1854" location="f41:57" file="f41" line="57"/>
    <Argument name="childIndex" type="_114" location="f41:57" file="f41" line="57"/>
  </Method>
  <Method id="_1928" name="ComputeAABB" returns="_1374" const="1" virtual="1" overrides="_2388 " context="_321" access="public" mangled="_ZNK11b2LoopShape11ComputeAABBEP6b2AABBRK11b2Transformi" demangled="b2LoopShape::ComputeAABB(b2AABB*, b2Transform const&amp;, int) const" location="f41:60" file="f41" line="60" extern="1">
    <Argument name="aabb" type="_4024" location="f41:60" file="f41" line="60"/>
    <Argument name="transform" type="_1854" location="f41:60" file="f41" line="60"/>
    <Argument name="childIndex" type="_114" location="f41:60" file="f41" line="60"/>
  </Method>
  <Method id="_1929" name="ComputeMass" returns="_1374" const="1" virtual="1" overrides="_2389 " context="_321" access="public" mangled="_ZNK11b2LoopShape11ComputeMassEP10b2MassDataf" demangled="b2LoopShape::ComputeMass(b2MassData*, float) const" location="f41:64" file="f41" line="64" extern="1">
    <Argument name="massData" type="_4025" location="f41:64" file="f41" line="64"/>
    <Argument name="density" type="_179" location="f41:64" file="f41" line="64"/>
  </Method>
  <Method id="_1930" name="GetCount" returns="_114" const="1" context="_321" access="public" mangled="_ZNK11b2LoopShape8GetCountEv" demangled="b2LoopShape::GetCount() const" location="f41:67" file="f41" line="67" endline="67" inline="1"/>
  <Method id="_1931" name="GetVertex" returns="_1469" const="1" context="_321" access="public" mangled="_ZNK11b2LoopShape9GetVertexEi" demangled="b2LoopShape::GetVertex(int) const" location="f41:70" file="f41" line="70" endline="73" inline="1">
    <Argument name="index" type="_114" location="f41:70" file="f41" line="70"/>
  </Method>
  <Method id="_1932" name="GetVertices" returns="_4217" const="1" context="_321" access="public" mangled="_ZNK11b2LoopShape11GetVerticesEv" demangled="b2LoopShape::GetVertices() const" location="f41:77" file="f41" line="77" endline="77" inline="1"/>
  <CvQualifiedType id="_1368r" type="_1368" restrict="1"/>
  <Field id="_1934" name="__data" type="_1937" offset="0" context="_336" access="public" location="f8:96" file="f8" line="96"/>
  <Field id="_1935" name="__size" type="_4219" offset="0" context="_336" access="public" location="f8:97" file="f8" line="97"/>
  <Field id="_1936" name="__align" type="_26" offset="0" context="_336" access="public" location="f8:98" file="f8" line="98"/>
  <Struct id="_1937" context="_336" access="public" mangled="N14pthread_cond_t4._58E" demangled="pthread_cond_t::._58" location="f8:87" file="f8" line="87" artificial="1" size="352" align="32" members="_4220 _4221 _4222 _4223 _4224 _4225 _4226 _4227 _4228 _4229 _4230 _4231 " bases=""/>
  <Destructor id="_1938" name="._57" artificial="1" throw="" context="_336" access="public" mangled="_ZN14pthread_cond_tD1Ev *INTERNAL* " demangled="pthread_cond_t::~pthread_cond_t()" location="f8:99" file="f8" line="99" endline="99" inline="1">
  </Destructor>
  <OperatorMethod id="_1939" name="=" returns="_4232" artificial="1" throw="" context="_336" access="public" mangled="_ZN14pthread_cond_taSERKS_" demangled="pthread_cond_t::operator=(pthread_cond_t const&amp;)" location="f8:99" file="f8" line="99" endline="99" inline="1">
    <Argument type="_4233" location="f8:85" file="f8" line="85"/>
  </OperatorMethod>
  <Constructor id="_1940" name="._57" artificial="1" throw="" context="_336" access="public" mangled="_ZN14pthread_cond_tC1ERKS_ *INTERNAL* " demangled="pthread_cond_t::pthread_cond_t(pthread_cond_t const&amp;)" location="f8:99" file="f8" line="99" endline="99" inline="1">
    <Argument type="_4233" location="f8:85" file="f8" line="85"/>
  </Constructor>
  <Constructor id="_1941" name="._57" artificial="1" throw="" context="_336" access="public" mangled="_ZN14pthread_cond_tC1Ev *INTERNAL* " demangled="pthread_cond_t::pthread_cond_t()" location="f8:99" file="f8" line="99" inline="1"/>
  <Field id="_1942" name="localAnchorA" type="_226" offset="160" context="_348" access="public" location="f42:42" file="f42" line="42"/>
  <Field id="_1943" name="localAnchorB" type="_226" offset="224" context="_348" access="public" location="f42:45" file="f42" line="45"/>
  <Field id="_1944" name="referenceAngle" type="_179" offset="288" context="_348" access="public" location="f42:48" file="f42" line="48"/>
  <Destructor id="_1945" name="b2WeldJointDef" artificial="1" throw="" context="_348" access="public" mangled="_ZN14b2WeldJointDefD1Ev *INTERNAL* " demangled="b2WeldJointDef::~b2WeldJointDef()" location="f42:28" file="f42" line="28" endline="28" inline="1">
  </Destructor>
  <OperatorMethod id="_1946" name="=" returns="_4234" artificial="1" throw="" context="_348" access="public" mangled="_ZN14b2WeldJointDefaSERKS_" demangled="b2WeldJointDef::operator=(b2WeldJointDef const&amp;)" location="f42:28" file="f42" line="28" endline="28" inline="1">
    <Argument type="_4235" location="f42:28" file="f42" line="28"/>
  </OperatorMethod>
  <Constructor id="_1947" name="b2WeldJointDef" artificial="1" throw="" context="_348" access="public" mangled="_ZN14b2WeldJointDefC1ERKS_ *INTERNAL* " demangled="b2WeldJointDef::b2WeldJointDef(b2WeldJointDef const&amp;)" location="f42:28" file="f42" line="28" endline="28" inline="1">
    <Argument type="_4235" location="f42:28" file="f42" line="28"/>
  </Constructor>
  <Constructor id="_1948" name="b2WeldJointDef" explicit="1" context="_348" access="public" mangled="_ZN14b2WeldJointDefC1Ev *INTERNAL* " demangled="b2WeldJointDef::b2WeldJointDef()" location="f42:29" file="f42" line="29" endline="34" inline="1"/>
  <Method id="_1949" name="Initialize" returns="_1374" context="_348" access="public" mangled="_ZN14b2WeldJointDef10InitializeEP6b2BodyS1_RK6b2Vec2" demangled="b2WeldJointDef::Initialize(b2Body*, b2Body*, b2Vec2 const&amp;)" location="f42:39" file="f42" line="39" extern="1">
    <Argument name="body1" type="_3999" location="f42:39" file="f42" line="39"/>
    <Argument name="body2" type="_3999" location="f42:39" file="f42" line="39"/>
    <Argument name="anchor" type="_1469" location="f42:39" file="f42" line="39"/>
  </Method>
  <Field id="_1950" name="__size" type="_4236" offset="0" context="_350" access="public" location="f8:158" file="f8" line="158"/>
  <Field id="_1951" name="__align" type="_67" offset="0" context="_350" access="public" location="f8:159" file="f8" line="159"/>
  <Destructor id="_1952" name="._63" artificial="1" throw="" context="_350" access="public" mangled="_ZN17pthread_barrier_tD1Ev *INTERNAL* " demangled="pthread_barrier_t::~pthread_barrier_t()" location="f8:160" file="f8" line="160" endline="160" inline="1">
  </Destructor>
  <OperatorMethod id="_1953" name="=" returns="_4237" artificial="1" throw="" context="_350" access="public" mangled="_ZN17pthread_barrier_taSERKS_" demangled="pthread_barrier_t::operator=(pthread_barrier_t const&amp;)" location="f8:160" file="f8" line="160" endline="160" inline="1">
    <Argument type="_4238" location="f8:157" file="f8" line="157"/>
  </OperatorMethod>
  <Constructor id="_1954" name="._63" artificial="1" throw="" context="_350" access="public" mangled="_ZN17pthread_barrier_tC1ERKS_ *INTERNAL* " demangled="pthread_barrier_t::pthread_barrier_t(pthread_barrier_t const&amp;)" location="f8:160" file="f8" line="160" endline="160" inline="1">
    <Argument type="_4238" location="f8:157" file="f8" line="157"/>
  </Constructor>
  <Constructor id="_1955" name="._63" artificial="1" throw="" context="_350" access="public" mangled="_ZN17pthread_barrier_tC1Ev *INTERNAL* " demangled="pthread_barrier_t::pthread_barrier_t()" location="f8:160" file="f8" line="160" inline="1"/>
  <Field id="_1956" name="m_p" type="_226" offset="96" context="_354" access="public" location="f40:62" file="f40" line="62"/>
  <OperatorMethod id="_1957" name="=" returns="_4239" artificial="1" throw="" context="_354" access="public" mangled="_ZN13b2CircleShapeaSERKS_" demangled="b2CircleShape::operator=(b2CircleShape const&amp;)" location="f40:26" file="f40" line="26" endline="26" inline="1">
    <Argument type="_4240" location="f40:26" file="f40" line="26"/>
  </OperatorMethod>
  <Constructor id="_1958" name="b2CircleShape" artificial="1" throw="" context="_354" access="public" mangled="_ZN13b2CircleShapeC1ERKS_ *INTERNAL* " demangled="b2CircleShape::b2CircleShape(b2CircleShape const&amp;)" location="f40:26" file="f40" line="26" endline="26" inline="1">
    <Argument type="_4240" location="f40:26" file="f40" line="26"/>
  </Constructor>
  <Constructor id="_1959" name="b2CircleShape" explicit="1" context="_354" access="public" mangled="_ZN13b2CircleShapeC1Ev *INTERNAL* " demangled="b2CircleShape::b2CircleShape()" location="f40:65" file="f40" line="65" endline="70" inline="1"/>
  <Method id="_1960" name="Clone" returns="_4021" const="1" virtual="1" overrides="_2383 " context="_354" access="public" mangled="_ZNK13b2CircleShape5CloneEP16b2BlockAllocator" demangled="b2CircleShape::Clone(b2BlockAllocator*) const" location="f40:31" file="f40" line="31" extern="1">
    <Argument name="allocator" type="_2226" location="f40:31" file="f40" line="31"/>
  </Method>
  <Method id="_1961" name="GetChildCount" returns="_114" const="1" virtual="1" overrides="_2385 " context="_354" access="public" mangled="_ZNK13b2CircleShape13GetChildCountEv" demangled="b2CircleShape::GetChildCount() const" location="f40:34" file="f40" line="34" extern="1"/>
  <Method id="_1962" name="TestPoint" returns="_1355" const="1" virtual="1" overrides="_2386 " context="_354" access="public" mangled="_ZNK13b2CircleShape9TestPointERK11b2TransformRK6b2Vec2" demangled="b2CircleShape::TestPoint(b2Transform const&amp;, b2Vec2 const&amp;) const" location="f40:37" file="f40" line="37" extern="1">
    <Argument name="transform" type="_1854" location="f40:37" file="f40" line="37"/>
    <Argument name="p" type="_1469" location="f40:37" file="f40" line="37"/>
  </Method>
  <Method id="_1963" name="RayCast" returns="_1355" const="1" virtual="1" overrides="_2387 " context="_354" access="public" mangled="_ZNK13b2CircleShape7RayCastEP15b2RayCastOutputRK14b2RayCastInputRK11b2Transformi" demangled="b2CircleShape::RayCast(b2RayCastOutput*, b2RayCastInput const&amp;, b2Transform const&amp;, int) const" location="f40:41" file="f40" line="41" extern="1">
    <Argument name="output" type="_4022" location="f40:41" file="f40" line="41"/>
    <Argument name="input" type="_4023" location="f40:41" file="f40" line="41"/>
    <Argument name="transform" type="_1854" location="f40:41" file="f40" line="41"/>
    <Argument name="childIndex" type="_114" location="f40:41" file="f40" line="41"/>
  </Method>
  <Method id="_1964" name="ComputeAABB" returns="_1374" const="1" virtual="1" overrides="_2388 " context="_354" access="public" mangled="_ZNK13b2CircleShape11ComputeAABBEP6b2AABBRK11b2Transformi" demangled="b2CircleShape::ComputeAABB(b2AABB*, b2Transform const&amp;, int) const" location="f40:44" file="f40" line="44" extern="1">
    <Argument name="aabb" type="_4024" location="f40:44" file="f40" line="44"/>
    <Argument name="transform" type="_1854" location="f40:44" file="f40" line="44"/>
    <Argument name="childIndex" type="_114" location="f40:44" file="f40" line="44"/>
  </Method>
  <Method id="_1965" name="ComputeMass" returns="_1374" const="1" virtual="1" overrides="_2389 " context="_354" access="public" mangled="_ZNK13b2CircleShape11ComputeMassEP10b2MassDataf" demangled="b2CircleShape::ComputeMass(b2MassData*, float) const" location="f40:47" file="f40" line="47" extern="1">
    <Argument name="massData" type="_4025" location="f40:47" file="f40" line="47"/>
    <Argument name="density" type="_179" location="f40:47" file="f40" line="47"/>
  </Method>
  <Method id="_1966" name="GetSupport" returns="_114" const="1" context="_354" access="public" mangled="_ZNK13b2CircleShape10GetSupportERK6b2Vec2" demangled="b2CircleShape::GetSupport(b2Vec2 const&amp;) const" location="f40:72" file="f40" line="72" endline="75" inline="1">
    <Argument name="d" type="_1469" location="f40:72" file="f40" line="72"/>
  </Method>
  <Method id="_1967" name="GetSupportVertex" returns="_1469" const="1" context="_354" access="public" mangled="_ZNK13b2CircleShape16GetSupportVertexERK6b2Vec2" demangled="b2CircleShape::GetSupportVertex(b2Vec2 const&amp;) const" location="f40:78" file="f40" line="78" endline="81" inline="1">
    <Argument name="d" type="_1469" location="f40:78" file="f40" line="78"/>
  </Method>
  <Method id="_1968" name="GetVertexCount" returns="_114" const="1" context="_354" access="public" mangled="_ZNK13b2CircleShape14GetVertexCountEv" demangled="b2CircleShape::GetVertexCount() const" location="f40:56" file="f40" line="56" endline="56" inline="1"/>
  <Method id="_1969" name="GetVertex" returns="_1469" const="1" context="_354" access="public" mangled="_ZNK13b2CircleShape9GetVertexEi" demangled="b2CircleShape::GetVertex(int) const" location="f40:84" file="f40" line="84" endline="88" inline="1">
    <Argument name="index" type="_114" location="f40:84" file="f40" line="84"/>
  </Method>
  <Destructor id="_1970" name="b2CircleShape" virtual="1" overrides="_2382 " artificial="1" context="_354" access="public" mangled="_ZN13b2CircleShapeD1Ev *INTERNAL* " demangled="b2CircleShape::~b2CircleShape()" location="f40:26" file="f40" line="26" endline="26" inline="1">
  </Destructor>
  <CvQualifiedType id="_1915r" type="_1915" restrict="1"/>
  <Field id="_1972" name="categoryBits" type="_514" offset="0" context="_373" access="public" location="f34:35" file="f34" line="35"/>
  <Field id="_1973" name="maskBits" type="_514" offset="16" context="_373" access="public" location="f34:39" file="f34" line="39"/>
  <Field id="_1974" name="groupIndex" type="_97" offset="32" context="_373" access="public" location="f34:44" file="f34" line="44"/>
  <Destructor id="_1975" name="b2Filter" artificial="1" throw="" context="_373" access="public" mangled="_ZN8b2FilterD1Ev *INTERNAL* " demangled="b2Filter::~b2Filter()" location="f34:33" file="f34" line="33" endline="33" inline="1">
  </Destructor>
  <OperatorMethod id="_1976" name="=" returns="_4241" artificial="1" throw="" context="_373" access="public" mangled="_ZN8b2FilteraSERKS_" demangled="b2Filter::operator=(b2Filter const&amp;)" location="f34:33" file="f34" line="33" endline="33" inline="1">
    <Argument type="_4191" location="f34:33" file="f34" line="33"/>
  </OperatorMethod>
  <Constructor id="_1977" name="b2Filter" artificial="1" throw="" context="_373" access="public" mangled="_ZN8b2FilterC1ERKS_ *INTERNAL* " demangled="b2Filter::b2Filter(b2Filter const&amp;)" location="f34:33" file="f34" line="33" endline="33" inline="1">
    <Argument type="_4191" location="f34:33" file="f34" line="33"/>
  </Constructor>
  <Constructor id="_1978" name="b2Filter" artificial="1" throw="" context="_373" access="public" mangled="_ZN8b2FilterC1Ev *INTERNAL* " demangled="b2Filter::b2Filter()" location="f34:33" file="f34" line="33" inline="1"/>
  <Field id="_1979" name="__val" type="_4242" offset="0" context="_376" access="public" location="f6:144" file="f6" line="144"/>
  <Destructor id="_1980" name="._50" artificial="1" throw="" context="_376" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f6:144" file="f6" line="144" endline="144" inline="1">
  </Destructor>
  <OperatorMethod id="_1981" name="=" returns="_4243" artificial="1" throw="" context="_376" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f6:144" file="f6" line="144" endline="144" inline="1">
    <Argument type="_4244" location="f6:144" file="f6" line="144"/>
  </OperatorMethod>
  <Constructor id="_1982" name="._50" artificial="1" throw="" context="_376" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f6:144" file="f6" line="144" endline="144" inline="1">
    <Argument type="_4244" location="f6:144" file="f6" line="144"/>
  </Constructor>
  <Constructor id="_1983" name="._50" artificial="1" throw="" context="_376" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f6:144" file="f6" line="144" inline="1"/>
  <Field id="_1984" name="m_drawFlags" type="_527" offset="32" context="_378" access="protected" location="f43:80" file="f43" line="80"/>
  <Enumeration id="_1985" name="._43" context="_378" access="public" location="f43:39" file="f43" line="39" artificial="1" size="32" align="32">
    <EnumValue name="e_shapeBit" init="1"/>
    <EnumValue name="e_jointBit" init="2"/>
    <EnumValue name="e_aabbBit" init="4"/>
    <EnumValue name="e_pairBit" init="8"/>
    <EnumValue name="e_centerOfMassBit" init="16"/>
  </Enumeration>
  <OperatorMethod id="_1986" name="=" returns="_4245" artificial="1" throw="" context="_378" access="public" mangled="_ZN6b2DrawaSERKS_" demangled="b2Draw::operator=(b2Draw const&amp;)" location="f43:33" file="f43" line="33" endline="33" inline="1">
    <Argument type="_4246" location="f43:33" file="f43" line="33"/>
  </OperatorMethod>
  <Constructor id="_1987" name="b2Draw" artificial="1" throw="" context="_378" access="public" mangled="_ZN6b2DrawC1ERKS_ *INTERNAL* " demangled="b2Draw::b2Draw(b2Draw const&amp;)" location="f43:33" file="f43" line="33" endline="33" inline="1">
    <Argument type="_4246" location="f43:33" file="f43" line="33"/>
  </Constructor>
  <Constructor id="_1988" name="b2Draw" explicit="1" context="_378" access="public" mangled="_ZN6b2DrawC1Ev *INTERNAL* " demangled="b2Draw::b2Draw()" location="f43:35" file="f43" line="35" extern="1"/>
  <Destructor id="_1989" name="b2Draw" virtual="1" overrides="" context="_378" access="public" mangled="_ZN6b2DrawD1Ev *INTERNAL* " demangled="b2Draw::~b2Draw()" location="f43:37" file="f43" line="37" endline="37" inline="1">
  </Destructor>
  <Method id="_1990" name="SetFlags" returns="_1374" context="_378" access="public" mangled="_ZN6b2Draw8SetFlagsEj" demangled="b2Draw::SetFlags(unsigned int)" location="f43:49" file="f43" line="49" extern="1">
    <Argument name="flags" type="_527" location="f43:49" file="f43" line="49"/>
  </Method>
  <Method id="_1991" name="GetFlags" returns="_527" const="1" context="_378" access="public" mangled="_ZNK6b2Draw8GetFlagsEv" demangled="b2Draw::GetFlags() const" location="f43:52" file="f43" line="52" extern="1"/>
  <Method id="_1992" name="AppendFlags" returns="_1374" context="_378" access="public" mangled="_ZN6b2Draw11AppendFlagsEj" demangled="b2Draw::AppendFlags(unsigned int)" location="f43:55" file="f43" line="55" extern="1">
    <Argument name="flags" type="_527" location="f43:55" file="f43" line="55"/>
  </Method>
  <Method id="_1993" name="ClearFlags" returns="_1374" context="_378" access="public" mangled="_ZN6b2Draw10ClearFlagsEj" demangled="b2Draw::ClearFlags(unsigned int)" location="f43:58" file="f43" line="58" extern="1">
    <Argument name="flags" type="_527" location="f43:58" file="f43" line="58"/>
  </Method>
  <Method id="_1994" name="DrawPolygon" returns="_1374" virtual="1" pure_virtual="1" overrides="" context="_378" access="public" mangled="_ZN6b2Draw11DrawPolygonEPK6b2Vec2iRK7b2Color" demangled="b2Draw::DrawPolygon(b2Vec2 const*, int, b2Color const&amp;)" location="f43:61" file="f43" line="61" extern="1">
    <Argument name="vertices" type="_4217" location="f43:61" file="f43" line="61"/>
    <Argument name="vertexCount" type="_114" location="f43:61" file="f43" line="61"/>
    <Argument name="color" type="_4247" location="f43:61" file="f43" line="61"/>
  </Method>
  <Method id="_1995" name="DrawSolidPolygon" returns="_1374" virtual="1" pure_virtual="1" overrides="" context="_378" access="public" mangled="_ZN6b2Draw16DrawSolidPolygonEPK6b2Vec2iRK7b2Color" demangled="b2Draw::DrawSolidPolygon(b2Vec2 const*, int, b2Color const&amp;)" location="f43:64" file="f43" line="64" extern="1">
    <Argument name="vertices" type="_4217" location="f43:64" file="f43" line="64"/>
    <Argument name="vertexCount" type="_114" location="f43:64" file="f43" line="64"/>
    <Argument name="color" type="_4247" location="f43:64" file="f43" line="64"/>
  </Method>
  <Method id="_1996" name="DrawCircle" returns="_1374" virtual="1" pure_virtual="1" overrides="" context="_378" access="public" mangled="_ZN6b2Draw10DrawCircleERK6b2Vec2fRK7b2Color" demangled="b2Draw::DrawCircle(b2Vec2 const&amp;, float, b2Color const&amp;)" location="f43:67" file="f43" line="67" extern="1">
    <Argument name="center" type="_1469" location="f43:67" file="f43" line="67"/>
    <Argument name="radius" type="_179" location="f43:67" file="f43" line="67"/>
    <Argument name="color" type="_4247" location="f43:67" file="f43" line="67"/>
  </Method>
  <Method id="_1997" name="DrawSolidCircle" returns="_1374" virtual="1" pure_virtual="1" overrides="" context="_378" access="public" mangled="_ZN6b2Draw15DrawSolidCircleERK6b2Vec2fS2_RK7b2Color" demangled="b2Draw::DrawSolidCircle(b2Vec2 const&amp;, float, b2Vec2 const&amp;, b2Color const&amp;)" location="f43:70" file="f43" line="70" extern="1">
    <Argument name="center" type="_1469" location="f43:70" file="f43" line="70"/>
    <Argument name="radius" type="_179" location="f43:70" file="f43" line="70"/>
    <Argument name="axis" type="_1469" location="f43:70" file="f43" line="70"/>
    <Argument name="color" type="_4247" location="f43:70" file="f43" line="70"/>
  </Method>
  <Method id="_1998" name="DrawSegment" returns="_1374" virtual="1" pure_virtual="1" overrides="" context="_378" access="public" mangled="_ZN6b2Draw11DrawSegmentERK6b2Vec2S2_RK7b2Color" demangled="b2Draw::DrawSegment(b2Vec2 const&amp;, b2Vec2 const&amp;, b2Color const&amp;)" location="f43:73" file="f43" line="73" extern="1">
    <Argument name="p1" type="_1469" location="f43:73" file="f43" line="73"/>
    <Argument name="p2" type="_1469" location="f43:73" file="f43" line="73"/>
    <Argument name="color" type="_4247" location="f43:73" file="f43" line="73"/>
  </Method>
  <Method id="_1999" name="DrawTransform" returns="_1374" virtual="1" pure_virtual="1" overrides="" context="_378" access="public" mangled="_ZN6b2Draw13DrawTransformERK11b2Transform" demangled="b2Draw::DrawTransform(b2Transform const&amp;)" location="f43:77" file="f43" line="77" extern="1">
    <Argument name="xf" type="_1854" location="f43:77" file="f43" line="77"/>
  </Method>
  <Field id="_2000" name="m_stack" type="_1368" offset="0" context="_384" access="private" location="f44:78" file="f44" line="78"/>
  <Field id="_2001" name="m_array" type="_4248" offset="32" context="_384" access="private" location="f44:79" file="f44" line="79"/>
  <Field id="_2002" name="m_count" type="_114" offset="8224" context="_384" access="private" location="f44:80" file="f44" line="80"/>
  <Field id="_2003" name="m_capacity" type="_114" offset="8256" context="_384" access="private" location="f44:81" file="f44" line="81"/>
  <OperatorMethod id="_2004" name="=" returns="_4249" artificial="1" throw="" context="_384" access="public" mangled="_ZN15b2GrowableStackIiLi256EEaSERKS0_" demangled="b2GrowableStack&lt;int, 256&gt;::operator=(b2GrowableStack&lt;int, 256&gt; const&amp;)" location="f44:29" file="f44" line="29" endline="29" inline="1">
    <Argument type="_4250" location="f44:29" file="f44" line="29"/>
  </OperatorMethod>
  <Constructor id="_2005" name="b2GrowableStack" artificial="1" throw="" context="_384" access="public" mangled="_ZN15b2GrowableStackIiLi256EEC1ERKS0_ *INTERNAL* " demangled="b2GrowableStack&lt;int, 256&gt;::b2GrowableStack(b2GrowableStack&lt;int, 256&gt; const&amp;)" location="f44:29" file="f44" line="29" endline="29" inline="1">
    <Argument type="_4250" location="f44:29" file="f44" line="29"/>
  </Constructor>
  <Constructor id="_2006" name="b2GrowableStack" explicit="1" context="_384" access="public" mangled="_ZN15b2GrowableStackIiLi256EEC1Ev *INTERNAL* " demangled="b2GrowableStack&lt;int, 256&gt;::b2GrowableStack()" location="f44:31" file="f44" line="31" extern="1" inline="1"/>
  <Destructor id="_2007" name="b2GrowableStack" context="_384" access="public" mangled="_ZN15b2GrowableStackIiLi256EED1Ev *INTERNAL* " demangled="b2GrowableStack&lt;int, 256&gt;::~b2GrowableStack()" location="f44:38" file="f44" line="38" extern="1" inline="1">
  </Destructor>
  <Method id="_2008" name="Push" returns="_1374" context="_384" access="public" mangled="_ZN15b2GrowableStackIiLi256EE4PushERKi" demangled="b2GrowableStack&lt;int, 256&gt;::Push(int const&amp;)" location="f44:47" file="f44" line="47" extern="1" inline="1">
    <Argument name="element" type="_4251" location="f44:47" file="f44" line="47"/>
  </Method>
  <Method id="_2009" name="Pop" returns="_113" context="_384" access="public" mangled="_ZN15b2GrowableStackIiLi256EE3PopEv" demangled="b2GrowableStack&lt;int, 256&gt;::Pop()" location="f44:65" file="f44" line="65" extern="1" inline="1"/>
  <Method id="_2010" name="GetCount" returns="_114" context="_384" access="public" mangled="_ZN15b2GrowableStackIiLi256EE8GetCountEv" demangled="b2GrowableStack&lt;int, 256&gt;::GetCount()" location="f44:72" file="f44" line="72" extern="1" inline="1"/>
  <Field id="_2012" name="normal" type="_226" offset="0" context="_391" access="public" location="f14:156" file="f14" line="156"/>
  <Field id="_2013" name="fraction" type="_179" offset="64" context="_391" access="public" location="f14:157" file="f14" line="157"/>
  <Destructor id="_2014" name="b2RayCastOutput" artificial="1" throw="" context="_391" access="public" mangled="_ZN15b2RayCastOutputD1Ev *INTERNAL* " demangled="b2RayCastOutput::~b2RayCastOutput()" location="f14:155" file="f14" line="155" endline="155" inline="1">
  </Destructor>
  <OperatorMethod id="_2015" name="=" returns="_4252" artificial="1" throw="" context="_391" access="public" mangled="_ZN15b2RayCastOutputaSERKS_" demangled="b2RayCastOutput::operator=(b2RayCastOutput const&amp;)" location="f14:155" file="f14" line="155" endline="155" inline="1">
    <Argument type="_4253" location="f14:155" file="f14" line="155"/>
  </OperatorMethod>
  <Constructor id="_2016" name="b2RayCastOutput" artificial="1" throw="" context="_391" access="public" mangled="_ZN15b2RayCastOutputC1ERKS_ *INTERNAL* " demangled="b2RayCastOutput::b2RayCastOutput(b2RayCastOutput const&amp;)" location="f14:155" file="f14" line="155" endline="155" inline="1">
    <Argument type="_4253" location="f14:155" file="f14" line="155"/>
  </Constructor>
  <Constructor id="_2017" name="b2RayCastOutput" artificial="1" context="_391" access="public" mangled="_ZN15b2RayCastOutputC1Ev *INTERNAL* " demangled="b2RayCastOutput::b2RayCastOutput()" location="f14:155" file="f14" line="155" endline="155" inline="1"/>
  <OperatorMethod id="_2018" name="=" returns="_4254" artificial="1" throw="" context="_417" access="public" mangled="_ZN15b2QueryCallbackaSERKS_" demangled="b2QueryCallback::operator=(b2QueryCallback const&amp;)" location="f24:123" file="f24" line="123" endline="123" inline="1">
    <Argument type="_4255" location="f24:123" file="f24" line="123"/>
  </OperatorMethod>
  <Constructor id="_2019" name="b2QueryCallback" artificial="1" throw="" context="_417" access="public" mangled="_ZN15b2QueryCallbackC1ERKS_ *INTERNAL* " demangled="b2QueryCallback::b2QueryCallback(b2QueryCallback const&amp;)" location="f24:123" file="f24" line="123" endline="123" inline="1">
    <Argument type="_4255" location="f24:123" file="f24" line="123"/>
  </Constructor>
  <Constructor id="_2020" name="b2QueryCallback" artificial="1" throw="" context="_417" access="public" mangled="_ZN15b2QueryCallbackC1Ev *INTERNAL* " demangled="b2QueryCallback::b2QueryCallback()" location="f24:123" file="f24" line="123" endline="123" inline="1"/>
  <Destructor id="_2021" name="b2QueryCallback" virtual="1" overrides="" context="_417" access="public" mangled="_ZN15b2QueryCallbackD1Ev *INTERNAL* " demangled="b2QueryCallback::~b2QueryCallback()" location="f24:125" file="f24" line="125" endline="125" inline="1">
  </Destructor>
  <Method id="_2022" name="ReportFixture" returns="_1355" virtual="1" pure_virtual="1" overrides="" context="_417" access="public" mangled="_ZN15b2QueryCallback13ReportFixtureEP9b2Fixture" demangled="b2QueryCallback::ReportFixture(b2Fixture*)" location="f24:129" file="f24" line="129" extern="1">
    <Argument name="fixture" type="_2225" location="f24:129" file="f24" line="129"/>
  </Method>
  <Field id="_2023" name="m_root" type="_114" offset="0" context="_421" access="private" location="f46:137" file="f46" line="137"/>
  <Field id="_2024" name="m_nodes" type="_4256" offset="32" context="_421" access="private" location="f46:139" file="f46" line="139"/>
  <Field id="_2025" name="m_nodeCount" type="_114" offset="64" context="_421" access="private" location="f46:140" file="f46" line="140"/>
  <Field id="_2026" name="m_nodeCapacity" type="_114" offset="96" context="_421" access="private" location="f46:141" file="f46" line="141"/>
  <Field id="_2027" name="m_freeList" type="_114" offset="128" context="_421" access="private" location="f46:143" file="f46" line="143"/>
  <Field id="_2028" name="m_path" type="_527" offset="160" context="_421" access="private" location="f46:146" file="f46" line="146"/>
  <Field id="_2029" name="m_insertionCount" type="_114" offset="192" context="_421" access="private" location="f46:148" file="f46" line="148"/>
  <OperatorMethod id="_2030" name="=" returns="_4257" artificial="1" throw="" context="_421" access="public" mangled="_ZN13b2DynamicTreeaSERKS_" demangled="b2DynamicTree::operator=(b2DynamicTree const&amp;)" location="f46:62" file="f46" line="62" endline="62" inline="1">
    <Argument type="_4258" location="f46:62" file="f46" line="62"/>
  </OperatorMethod>
  <Constructor id="_2031" name="b2DynamicTree" artificial="1" throw="" context="_421" access="public" mangled="_ZN13b2DynamicTreeC1ERKS_ *INTERNAL* " demangled="b2DynamicTree::b2DynamicTree(b2DynamicTree const&amp;)" location="f46:62" file="f46" line="62" endline="62" inline="1">
    <Argument type="_4258" location="f46:62" file="f46" line="62"/>
  </Constructor>
  <Constructor id="_2032" name="b2DynamicTree" explicit="1" context="_421" access="public" mangled="_ZN13b2DynamicTreeC1Ev *INTERNAL* " demangled="b2DynamicTree::b2DynamicTree()" location="f46:65" file="f46" line="65" extern="1"/>
  <Destructor id="_2033" name="b2DynamicTree" context="_421" access="public" mangled="_ZN13b2DynamicTreeD1Ev *INTERNAL* " demangled="b2DynamicTree::~b2DynamicTree()" location="f46:68" file="f46" line="68" extern="1">
  </Destructor>
  <Method id="_2034" name="CreateProxy" returns="_114" context="_421" access="public" mangled="_ZN13b2DynamicTree11CreateProxyERK6b2AABBPv" demangled="b2DynamicTree::CreateProxy(b2AABB const&amp;, void*)" location="f46:71" file="f46" line="71" extern="1">
    <Argument name="aabb" type="_2110" location="f46:71" file="f46" line="71"/>
    <Argument name="userData" type="_688" location="f46:71" file="f46" line="71"/>
  </Method>
  <Method id="_2035" name="DestroyProxy" returns="_1374" context="_421" access="public" mangled="_ZN13b2DynamicTree12DestroyProxyEi" demangled="b2DynamicTree::DestroyProxy(int)" location="f46:74" file="f46" line="74" extern="1">
    <Argument name="proxyId" type="_114" location="f46:74" file="f46" line="74"/>
  </Method>
  <Method id="_2036" name="MoveProxy" returns="_1355" context="_421" access="public" mangled="_ZN13b2DynamicTree9MoveProxyEiRK6b2AABBRK6b2Vec2" demangled="b2DynamicTree::MoveProxy(int, b2AABB const&amp;, b2Vec2 const&amp;)" location="f46:80" file="f46" line="80" extern="1">
    <Argument name="proxyId" type="_114" location="f46:80" file="f46" line="80"/>
    <Argument name="aabb1" type="_2110" location="f46:80" file="f46" line="80"/>
    <Argument name="displacement" type="_1469" location="f46:80" file="f46" line="80"/>
  </Method>
  <Method id="_2037" name="GetUserData" returns="_688" const="1" context="_421" access="public" mangled="_ZNK13b2DynamicTree11GetUserDataEi" demangled="b2DynamicTree::GetUserData(int) const" location="f46:151" file="f46" line="151" endline="154" inline="1">
    <Argument name="proxyId" type="_114" location="f46:151" file="f46" line="151"/>
  </Method>
  <Method id="_2038" name="GetFatAABB" returns="_2110" const="1" context="_421" access="public" mangled="_ZNK13b2DynamicTree10GetFatAABBEi" demangled="b2DynamicTree::GetFatAABB(int) const" location="f46:157" file="f46" line="157" endline="160" inline="1">
    <Argument name="proxyId" type="_114" location="f46:157" file="f46" line="157"/>
  </Method>
  <Method id="_2039" name="Query" returns="_1374" const="1" context="_421" access="public" mangled="_ZNK13b2DynamicTree5QueryI12b2BroadPhaseEEvPT_RK6b2AABB" demangled="void b2DynamicTree::Query&lt;b2BroadPhase&gt;(b2BroadPhase*, b2AABB const&amp;) const" location="f46:164" file="f46" line="164" extern="1" inline="1">
    <Argument name="callback" type="_4194" location="f46:164" file="f46" line="164"/>
    <Argument name="aabb" type="_2110" location="f46:164" file="f46" line="164"/>
  </Method>
  <Method id="_2040" name="Validate" returns="_1374" const="1" context="_421" access="public" mangled="_ZNK13b2DynamicTree8ValidateEv" demangled="b2DynamicTree::Validate() const" location="f46:105" file="f46" line="105" extern="1"/>
  <Method id="_2041" name="GetHeight" returns="_114" const="1" context="_421" access="public" mangled="_ZNK13b2DynamicTree9GetHeightEv" demangled="b2DynamicTree::GetHeight() const" location="f46:109" file="f46" line="109" extern="1"/>
  <Method id="_2042" name="GetMaxBalance" returns="_114" const="1" context="_421" access="public" mangled="_ZNK13b2DynamicTree13GetMaxBalanceEv" demangled="b2DynamicTree::GetMaxBalance() const" location="f46:113" file="f46" line="113" extern="1"/>
  <Method id="_2043" name="GetAreaRatio" returns="_179" const="1" context="_421" access="public" mangled="_ZNK13b2DynamicTree12GetAreaRatioEv" demangled="b2DynamicTree::GetAreaRatio() const" location="f46:116" file="f46" line="116" extern="1"/>
  <Method id="_2044" name="RebuildBottomUp" returns="_1374" context="_421" access="public" mangled="_ZN13b2DynamicTree15RebuildBottomUpEv" demangled="b2DynamicTree::RebuildBottomUp()" location="f46:119" file="f46" line="119" extern="1"/>
  <Method id="_2045" name="AllocateNode" returns="_114" context="_421" access="private" mangled="_ZN13b2DynamicTree12AllocateNodeEv" demangled="b2DynamicTree::AllocateNode()" location="f46:123" file="f46" line="123" extern="1"/>
  <Method id="_2046" name="FreeNode" returns="_1374" context="_421" access="private" mangled="_ZN13b2DynamicTree8FreeNodeEi" demangled="b2DynamicTree::FreeNode(int)" location="f46:124" file="f46" line="124" extern="1">
    <Argument name="node" type="_114" location="f46:124" file="f46" line="124"/>
  </Method>
  <Method id="_2047" name="InsertLeaf" returns="_1374" context="_421" access="private" mangled="_ZN13b2DynamicTree10InsertLeafEi" demangled="b2DynamicTree::InsertLeaf(int)" location="f46:126" file="f46" line="126" extern="1">
    <Argument name="node" type="_114" location="f46:126" file="f46" line="126"/>
  </Method>
  <Method id="_2048" name="RemoveLeaf" returns="_1374" context="_421" access="private" mangled="_ZN13b2DynamicTree10RemoveLeafEi" demangled="b2DynamicTree::RemoveLeaf(int)" location="f46:127" file="f46" line="127" extern="1">
    <Argument name="node" type="_114" location="f46:127" file="f46" line="127"/>
  </Method>
  <Method id="_2049" name="Balance" returns="_114" context="_421" access="private" mangled="_ZN13b2DynamicTree7BalanceEi" demangled="b2DynamicTree::Balance(int)" location="f46:129" file="f46" line="129" extern="1">
    <Argument name="index" type="_114" location="f46:129" file="f46" line="129"/>
  </Method>
  <Method id="_2050" name="ComputeHeight" returns="_114" const="1" context="_421" access="private" mangled="_ZNK13b2DynamicTree13ComputeHeightEv" demangled="b2DynamicTree::ComputeHeight() const" location="f46:131" file="f46" line="131" extern="1"/>
  <Method id="_2051" name="ComputeHeight" returns="_114" const="1" context="_421" access="private" mangled="_ZNK13b2DynamicTree13ComputeHeightEi" demangled="b2DynamicTree::ComputeHeight(int) const" location="f46:132" file="f46" line="132" extern="1">
    <Argument name="nodeId" type="_114" location="f46:132" file="f46" line="132"/>
  </Method>
  <Method id="_2052" name="ValidateStructure" returns="_1374" const="1" context="_421" access="private" mangled="_ZNK13b2DynamicTree17ValidateStructureEi" demangled="b2DynamicTree::ValidateStructure(int) const" location="f46:134" file="f46" line="134" extern="1">
    <Argument name="index" type="_114" location="f46:134" file="f46" line="134"/>
  </Method>
  <Method id="_2053" name="ValidateMetrics" returns="_1374" const="1" context="_421" access="private" mangled="_ZNK13b2DynamicTree15ValidateMetricsEi" demangled="b2DynamicTree::ValidateMetrics(int) const" location="f46:135" file="f46" line="135" extern="1">
    <Argument name="index" type="_114" location="f46:135" file="f46" line="135"/>
  </Method>
  <ReferenceType id="_2054" type="_1254c" size="32" align="32"/>
  <Field id="_2055" name="m_frequencyHz" type="_179" offset="512" context="_440" access="protected" location="f27:130" file="f27" line="130"/>
  <Field id="_2056" name="m_dampingRatio" type="_179" offset="544" context="_440" access="protected" location="f27:131" file="f27" line="131"/>
  <Field id="_2057" name="m_localAnchorA" type="_226" offset="576" context="_440" access="protected" location="f27:134" file="f27" line="134"/>
  <Field id="_2058" name="m_localAnchorB" type="_226" offset="640" context="_440" access="protected" location="f27:135" file="f27" line="135"/>
  <Field id="_2059" name="m_localXAxisA" type="_226" offset="704" context="_440" access="protected" location="f27:136" file="f27" line="136"/>
  <Field id="_2060" name="m_localYAxisA" type="_226" offset="768" context="_440" access="protected" location="f27:137" file="f27" line="137"/>
  <Field id="_2061" name="m_impulse" type="_179" offset="832" context="_440" access="protected" location="f27:139" file="f27" line="139"/>
  <Field id="_2062" name="m_motorImpulse" type="_179" offset="864" context="_440" access="protected" location="f27:140" file="f27" line="140"/>
  <Field id="_2063" name="m_springImpulse" type="_179" offset="896" context="_440" access="protected" location="f27:141" file="f27" line="141"/>
  <Field id="_2064" name="m_maxMotorTorque" type="_179" offset="928" context="_440" access="protected" location="f27:143" file="f27" line="143"/>
  <Field id="_2065" name="m_motorSpeed" type="_179" offset="960" context="_440" access="protected" location="f27:144" file="f27" line="144"/>
  <Field id="_2066" name="m_enableMotor" type="_1355" offset="992" context="_440" access="protected" location="f27:145" file="f27" line="145"/>
  <Field id="_2067" name="m_indexA" type="_114" offset="1024" context="_440" access="protected" location="f27:148" file="f27" line="148"/>
  <Field id="_2068" name="m_indexB" type="_114" offset="1056" context="_440" access="protected" location="f27:149" file="f27" line="149"/>
  <Field id="_2069" name="m_localCenterA" type="_226" offset="1088" context="_440" access="protected" location="f27:150" file="f27" line="150"/>
  <Field id="_2070" name="m_localCenterB" type="_226" offset="1152" context="_440" access="protected" location="f27:151" file="f27" line="151"/>
  <Field id="_2071" name="m_invMassA" type="_179" offset="1216" context="_440" access="protected" location="f27:152" file="f27" line="152"/>
  <Field id="_2072" name="m_invMassB" type="_179" offset="1248" context="_440" access="protected" location="f27:153" file="f27" line="153"/>
  <Field id="_2073" name="m_invIA" type="_179" offset="1280" context="_440" access="protected" location="f27:154" file="f27" line="154"/>
  <Field id="_2074" name="m_invIB" type="_179" offset="1312" context="_440" access="protected" location="f27:155" file="f27" line="155"/>
  <Field id="_2075" name="m_ax" type="_226" offset="1344" context="_440" access="protected" location="f27:157" file="f27" line="157"/>
  <Field id="_2076" name="m_ay" type="_226" offset="1408" context="_440" access="protected" location="f27:157" file="f27" line="157"/>
  <Field id="_2077" name="m_sAx" type="_179" offset="1472" context="_440" access="protected" location="f27:158" file="f27" line="158"/>
  <Field id="_2078" name="m_sBx" type="_179" offset="1504" context="_440" access="protected" location="f27:158" file="f27" line="158"/>
  <Field id="_2079" name="m_sAy" type="_179" offset="1536" context="_440" access="protected" location="f27:159" file="f27" line="159"/>
  <Field id="_2080" name="m_sBy" type="_179" offset="1568" context="_440" access="protected" location="f27:159" file="f27" line="159"/>
  <Field id="_2081" name="m_mass" type="_179" offset="1600" context="_440" access="protected" location="f27:161" file="f27" line="161"/>
  <Field id="_2082" name="m_motorMass" type="_179" offset="1632" context="_440" access="protected" location="f27:162" file="f27" line="162"/>
  <Field id="_2083" name="m_springMass" type="_179" offset="1664" context="_440" access="protected" location="f27:163" file="f27" line="163"/>
  <Field id="_2084" name="m_bias" type="_179" offset="1696" context="_440" access="protected" location="f27:165" file="f27" line="165"/>
  <Field id="_2085" name="m_gamma" type="_179" offset="1728" context="_440" access="protected" location="f27:166" file="f27" line="166"/>
  <OperatorMethod id="_2086" name="=" returns="_4259" artificial="1" throw="" context="_440" access="public" mangled="_ZN12b2WheelJointaSERKS_" demangled="b2WheelJoint::operator=(b2WheelJoint const&amp;)" location="f27:80" file="f27" line="80" endline="80" inline="1">
    <Argument type="_4260" location="f27:80" file="f27" line="80"/>
  </OperatorMethod>
  <Constructor id="_2087" name="b2WheelJoint" artificial="1" throw="" context="_440" access="public" mangled="_ZN12b2WheelJointC1ERKS_ *INTERNAL* " demangled="b2WheelJoint::b2WheelJoint(b2WheelJoint const&amp;)" location="f27:80" file="f27" line="80" endline="80" inline="1">
    <Argument type="_4260" location="f27:80" file="f27" line="80"/>
  </Constructor>
  <Method id="_2088" name="GetAnchorA" returns="_226" const="1" virtual="1" overrides="_2801 " context="_440" access="public" mangled="_ZNK12b2WheelJoint10GetAnchorAEv" demangled="b2WheelJoint::GetAnchorA() const" location="f27:82" file="f27" line="82" extern="1"/>
  <Method id="_2089" name="GetAnchorB" returns="_226" const="1" virtual="1" overrides="_2802 " context="_440" access="public" mangled="_ZNK12b2WheelJoint10GetAnchorBEv" demangled="b2WheelJoint::GetAnchorB() const" location="f27:83" file="f27" line="83" extern="1"/>
  <Method id="_2090" name="GetReactionForce" returns="_226" const="1" virtual="1" overrides="_2803 " context="_440" access="public" mangled="_ZNK12b2WheelJoint16GetReactionForceEf" demangled="b2WheelJoint::GetReactionForce(float) const" location="f27:85" file="f27" line="85" extern="1">
    <Argument name="inv_dt" type="_179" location="f27:85" file="f27" line="85"/>
  </Method>
  <Method id="_2091" name="GetReactionTorque" returns="_179" const="1" virtual="1" overrides="_2804 " context="_440" access="public" mangled="_ZNK12b2WheelJoint17GetReactionTorqueEf" demangled="b2WheelJoint::GetReactionTorque(float) const" location="f27:86" file="f27" line="86" extern="1">
    <Argument name="inv_dt" type="_179" location="f27:86" file="f27" line="86"/>
  </Method>
  <Method id="_2092" name="GetJointTranslation" returns="_179" const="1" context="_440" access="public" mangled="_ZNK12b2WheelJoint19GetJointTranslationEv" demangled="b2WheelJoint::GetJointTranslation() const" location="f27:89" file="f27" line="89" extern="1"/>
  <Method id="_2093" name="GetJointSpeed" returns="_179" const="1" context="_440" access="public" mangled="_ZNK12b2WheelJoint13GetJointSpeedEv" demangled="b2WheelJoint::GetJointSpeed() const" location="f27:92" file="f27" line="92" extern="1"/>
  <Method id="_2094" name="IsMotorEnabled" returns="_1355" const="1" context="_440" access="public" mangled="_ZNK12b2WheelJoint14IsMotorEnabledEv" demangled="b2WheelJoint::IsMotorEnabled() const" location="f27:95" file="f27" line="95" extern="1"/>
  <Method id="_2095" name="EnableMotor" returns="_1374" context="_440" access="public" mangled="_ZN12b2WheelJoint11EnableMotorEb" demangled="b2WheelJoint::EnableMotor(bool)" location="f27:98" file="f27" line="98" extern="1">
    <Argument name="flag" type="_1355" location="f27:98" file="f27" line="98"/>
  </Method>
  <Method id="_2096" name="SetMotorSpeed" returns="_1374" context="_440" access="public" mangled="_ZN12b2WheelJoint13SetMotorSpeedEf" demangled="b2WheelJoint::SetMotorSpeed(float)" location="f27:101" file="f27" line="101" extern="1">
    <Argument name="speed" type="_179" location="f27:101" file="f27" line="101"/>
  </Method>
  <Method id="_2097" name="GetMotorSpeed" returns="_179" const="1" context="_440" access="public" mangled="_ZNK12b2WheelJoint13GetMotorSpeedEv" demangled="b2WheelJoint::GetMotorSpeed() const" location="f27:169" file="f27" line="169" endline="171" inline="1"/>
  <Method id="_2098" name="SetMaxMotorTorque" returns="_1374" context="_440" access="public" mangled="_ZN12b2WheelJoint17SetMaxMotorTorqueEf" demangled="b2WheelJoint::SetMaxMotorTorque(float)" location="f27:107" file="f27" line="107" extern="1">
    <Argument name="torque" type="_179" location="f27:107" file="f27" line="107"/>
  </Method>
  <Method id="_2099" name="GetMaxMotorTorque" returns="_179" const="1" context="_440" access="public" mangled="_ZNK12b2WheelJoint17GetMaxMotorTorqueEv" demangled="b2WheelJoint::GetMaxMotorTorque() const" location="f27:174" file="f27" line="174" endline="176" inline="1"/>
  <Method id="_2100" name="GetMotorTorque" returns="_179" const="1" context="_440" access="public" mangled="_ZNK12b2WheelJoint14GetMotorTorqueEf" demangled="b2WheelJoint::GetMotorTorque(float) const" location="f27:111" file="f27" line="111" extern="1">
    <Argument name="inv_dt" type="_179" location="f27:111" file="f27" line="111"/>
  </Method>
  <Method id="_2101" name="SetSpringFrequencyHz" returns="_1374" context="_440" access="public" mangled="_ZN12b2WheelJoint20SetSpringFrequencyHzEf" demangled="b2WheelJoint::SetSpringFrequencyHz(float)" location="f27:179" file="f27" line="179" endline="181" inline="1">
    <Argument name="hz" type="_179" location="f27:179" file="f27" line="179"/>
  </Method>
  <Method id="_2102" name="GetSpringFrequencyHz" returns="_179" const="1" context="_440" access="public" mangled="_ZNK12b2WheelJoint20GetSpringFrequencyHzEv" demangled="b2WheelJoint::GetSpringFrequencyHz() const" location="f27:184" file="f27" line="184" endline="186" inline="1"/>
  <Method id="_2103" name="SetSpringDampingRatio" returns="_1374" context="_440" access="public" mangled="_ZN12b2WheelJoint21SetSpringDampingRatioEf" demangled="b2WheelJoint::SetSpringDampingRatio(float)" location="f27:189" file="f27" line="189" endline="191" inline="1">
    <Argument name="ratio" type="_179" location="f27:189" file="f27" line="189"/>
  </Method>
  <Method id="_2104" name="GetSpringDampingRatio" returns="_179" const="1" context="_440" access="public" mangled="_ZNK12b2WheelJoint21GetSpringDampingRatioEv" demangled="b2WheelJoint::GetSpringDampingRatio() const" location="f27:194" file="f27" line="194" endline="196" inline="1"/>
  <Constructor id="_2105" name="b2WheelJoint" context="_440" access="protected" mangled="_ZN12b2WheelJointC1EPK15b2WheelJointDef *INTERNAL* " demangled="b2WheelJoint::b2WheelJoint(b2WheelJointDef const*)" location="f27:124" file="f27" line="124" extern="1">
    <Argument name="def" type="_4261" location="f27:124" file="f27" line="124"/>
  </Constructor>
  <Method id="_2106" name="InitVelocityConstraints" returns="_1374" virtual="1" overrides="_2815 " context="_440" access="protected" mangled="_ZN12b2WheelJoint23InitVelocityConstraintsERK12b2SolverData" demangled="b2WheelJoint::InitVelocityConstraints(b2SolverData const&amp;)" location="f27:126" file="f27" line="126" extern="1">
    <Argument name="data" type="_4003" location="f27:126" file="f27" line="126"/>
  </Method>
  <Method id="_2107" name="SolveVelocityConstraints" returns="_1374" virtual="1" overrides="_2816 " context="_440" access="protected" mangled="_ZN12b2WheelJoint24SolveVelocityConstraintsERK12b2SolverData" demangled="b2WheelJoint::SolveVelocityConstraints(b2SolverData const&amp;)" location="f27:127" file="f27" line="127" extern="1">
    <Argument name="data" type="_4003" location="f27:127" file="f27" line="127"/>
  </Method>
  <Method id="_2108" name="SolvePositionConstraints" returns="_1355" virtual="1" overrides="_2817 " context="_440" access="protected" mangled="_ZN12b2WheelJoint24SolvePositionConstraintsERK12b2SolverData" demangled="b2WheelJoint::SolvePositionConstraints(b2SolverData const&amp;)" location="f27:128" file="f27" line="128" extern="1">
    <Argument name="data" type="_4003" location="f27:128" file="f27" line="128"/>
  </Method>
  <Destructor id="_2109" name="b2WheelJoint" virtual="1" overrides="_2814 " artificial="1" context="_440" access="public" mangled="_ZN12b2WheelJointD1Ev *INTERNAL* " demangled="b2WheelJoint::~b2WheelJoint()" location="f27:80" file="f27" line="80" endline="80" inline="1">
  </Destructor>
  <ReferenceType id="_2110" type="_795c" size="32" align="32"/>
  <PointerType id="_2111" type="_674c" size="32" align="32"/>
  <Field id="_2112" name="localAnchorA" type="_226" offset="160" context="_448" access="public" location="f47:52" file="f47" line="52"/>
  <Field id="_2113" name="localAnchorB" type="_226" offset="224" context="_448" access="public" location="f47:55" file="f47" line="55"/>
  <Field id="_2114" name="localAxisA" type="_226" offset="288" context="_448" access="public" location="f47:58" file="f47" line="58"/>
  <Field id="_2115" name="referenceAngle" type="_179" offset="352" context="_448" access="public" location="f47:61" file="f47" line="61"/>
  <Field id="_2116" name="enableLimit" type="_1355" offset="384" context="_448" access="public" location="f47:64" file="f47" line="64"/>
  <Field id="_2117" name="lowerTranslation" type="_179" offset="416" context="_448" access="public" location="f47:67" file="f47" line="67"/>
  <Field id="_2118" name="upperTranslation" type="_179" offset="448" context="_448" access="public" location="f47:70" file="f47" line="70"/>
  <Field id="_2119" name="enableMotor" type="_1355" offset="480" context="_448" access="public" location="f47:73" file="f47" line="73"/>
  <Field id="_2120" name="maxMotorForce" type="_179" offset="512" context="_448" access="public" location="f47:76" file="f47" line="76"/>
  <Field id="_2121" name="motorSpeed" type="_179" offset="544" context="_448" access="public" location="f47:79" file="f47" line="79"/>
  <Destructor id="_2122" name="b2PrismaticJointDef" artificial="1" throw="" context="_448" access="public" mangled="_ZN19b2PrismaticJointDefD1Ev *INTERNAL* " demangled="b2PrismaticJointDef::~b2PrismaticJointDef()" location="f47:31" file="f47" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_2123" name="=" returns="_4264" artificial="1" throw="" context="_448" access="public" mangled="_ZN19b2PrismaticJointDefaSERKS_" demangled="b2PrismaticJointDef::operator=(b2PrismaticJointDef const&amp;)" location="f47:31" file="f47" line="31" endline="31" inline="1">
    <Argument type="_4265" location="f47:31" file="f47" line="31"/>
  </OperatorMethod>
  <Constructor id="_2124" name="b2PrismaticJointDef" artificial="1" throw="" context="_448" access="public" mangled="_ZN19b2PrismaticJointDefC1ERKS_ *INTERNAL* " demangled="b2PrismaticJointDef::b2PrismaticJointDef(b2PrismaticJointDef const&amp;)" location="f47:31" file="f47" line="31" endline="31" inline="1">
    <Argument type="_4265" location="f47:31" file="f47" line="31"/>
  </Constructor>
  <Constructor id="_2125" name="b2PrismaticJointDef" explicit="1" context="_448" access="public" mangled="_ZN19b2PrismaticJointDefC1Ev *INTERNAL* " demangled="b2PrismaticJointDef::b2PrismaticJointDef()" location="f47:32" file="f47" line="32" endline="44" inline="1"/>
  <Method id="_2126" name="Initialize" returns="_1374" context="_448" access="public" mangled="_ZN19b2PrismaticJointDef10InitializeEP6b2BodyS1_RK6b2Vec2S4_" demangled="b2PrismaticJointDef::Initialize(b2Body*, b2Body*, b2Vec2 const&amp;, b2Vec2 const&amp;)" location="f47:49" file="f47" line="49" extern="1">
    <Argument name="bodyA" type="_3999" location="f47:49" file="f47" line="49"/>
    <Argument name="bodyB" type="_3999" location="f47:49" file="f47" line="49"/>
    <Argument name="anchor" type="_1469" location="f47:49" file="f47" line="49"/>
    <Argument name="axis" type="_1469" location="f47:49" file="f47" line="49"/>
  </Method>
  <Field id="_2127" name="quot" type="_113" offset="0" context="_455" access="public" location="f5:100" file="f5" line="100"/>
  <Field id="_2128" name="rem" type="_113" offset="32" context="_455" access="public" location="f5:101" file="f5" line="101"/>
  <Destructor id="_2129" name="._47" artificial="1" throw="" context="_455" access="public" mangled="_ZN5div_tD1Ev *INTERNAL* " demangled="div_t::~div_t()" location="f5:102" file="f5" line="102" endline="102" inline="1">
  </Destructor>
  <OperatorMethod id="_2130" name="=" returns="_4266" artificial="1" throw="" context="_455" access="public" mangled="_ZN5div_taSERKS_" demangled="div_t::operator=(div_t const&amp;)" location="f5:102" file="f5" line="102" endline="102" inline="1">
    <Argument type="_4267" location="f5:99" file="f5" line="99"/>
  </OperatorMethod>
  <Constructor id="_2131" name="._47" artificial="1" throw="" context="_455" access="public" mangled="_ZN5div_tC1ERKS_ *INTERNAL* " demangled="div_t::div_t(div_t const&amp;)" location="f5:102" file="f5" line="102" endline="102" inline="1">
    <Argument type="_4267" location="f5:99" file="f5" line="99"/>
  </Constructor>
  <Constructor id="_2132" name="._47" artificial="1" throw="" context="_455" access="public" mangled="_ZN5div_tC1Ev *INTERNAL* " demangled="div_t::div_t()" location="f5:102" file="f5" line="102" inline="1"/>
  <Field id="_2133" name="vertices" type="_4214" offset="0" context="_457" access="public" location="f48:41" file="f48" line="41"/>
  <Field id="_2134" name="count" type="_114" offset="32" context="_457" access="public" location="f48:44" file="f48" line="44"/>
  <Field id="_2135" name="masses" type="_4268" offset="64" context="_457" access="public" location="f48:47" file="f48" line="47"/>
  <Field id="_2136" name="gravity" type="_226" offset="96" context="_457" access="public" location="f48:50" file="f48" line="50"/>
  <Field id="_2137" name="damping" type="_179" offset="160" context="_457" access="public" location="f48:53" file="f48" line="53"/>
  <Field id="_2138" name="k2" type="_179" offset="192" context="_457" access="public" location="f48:56" file="f48" line="56"/>
  <Field id="_2139" name="k3" type="_179" offset="224" context="_457" access="public" location="f48:59" file="f48" line="59"/>
  <Destructor id="_2140" name="b2RopeDef" artificial="1" throw="" context="_457" access="public" mangled="_ZN9b2RopeDefD1Ev *INTERNAL* " demangled="b2RopeDef::~b2RopeDef()" location="f48:28" file="f48" line="28" endline="28" inline="1">
  </Destructor>
  <OperatorMethod id="_2141" name="=" returns="_4269" artificial="1" throw="" context="_457" access="public" mangled="_ZN9b2RopeDefaSERKS_" demangled="b2RopeDef::operator=(b2RopeDef const&amp;)" location="f48:28" file="f48" line="28" endline="28" inline="1">
    <Argument type="_4270" location="f48:28" file="f48" line="28"/>
  </OperatorMethod>
  <Constructor id="_2142" name="b2RopeDef" artificial="1" throw="" context="_457" access="public" mangled="_ZN9b2RopeDefC1ERKS_ *INTERNAL* " demangled="b2RopeDef::b2RopeDef(b2RopeDef const&amp;)" location="f48:28" file="f48" line="28" endline="28" inline="1">
    <Argument type="_4270" location="f48:28" file="f48" line="28"/>
  </Constructor>
  <Constructor id="_2143" name="b2RopeDef" explicit="1" context="_457" access="public" mangled="_ZN9b2RopeDefC1Ev *INTERNAL* " demangled="b2RopeDef::b2RopeDef()" location="f48:29" file="f48" line="29" endline="37" inline="1"/>
  <Field id="_2144" name="p" type="_226" offset="0" context="_462" access="public" location="f9:375" file="f9" line="375"/>
  <Field id="_2145" name="q" type="_496" offset="64" context="_462" access="public" location="f9:376" file="f9" line="376"/>
  <Destructor id="_2146" name="b2Transform" artificial="1" throw="" context="_462" access="public" mangled="_ZN11b2TransformD1Ev *INTERNAL* " demangled="b2Transform::~b2Transform()" location="f9:354" file="f9" line="354" endline="354" inline="1">
  </Destructor>
  <OperatorMethod id="_2147" name="=" returns="_4271" artificial="1" throw="" context="_462" access="public" mangled="_ZN11b2TransformaSERKS_" demangled="b2Transform::operator=(b2Transform const&amp;)" location="f9:354" file="f9" line="354" endline="354" inline="1">
    <Argument type="_1854" location="f9:354" file="f9" line="354"/>
  </OperatorMethod>
  <Constructor id="_2148" name="b2Transform" artificial="1" throw="" context="_462" access="public" mangled="_ZN11b2TransformC1ERKS_ *INTERNAL* " demangled="b2Transform::b2Transform(b2Transform const&amp;)" location="f9:354" file="f9" line="354" endline="354" inline="1">
    <Argument type="_1854" location="f9:354" file="f9" line="354"/>
  </Constructor>
  <Constructor id="_2149" name="b2Transform" explicit="1" context="_462" access="public" mangled="_ZN11b2TransformC1Ev *INTERNAL* " demangled="b2Transform::b2Transform()" location="f9:356" file="f9" line="356" endline="356" inline="1"/>
  <Constructor id="_2150" name="b2Transform" explicit="1" context="_462" access="public" mangled="_ZN11b2TransformC1ERK6b2Vec2RK5b2Rot *INTERNAL* " demangled="b2Transform::b2Transform(b2Vec2 const&amp;, b2Rot const&amp;)" location="f9:359" file="f9" line="359" endline="359" inline="1">
    <Argument name="position" type="_1469" location="f9:359" file="f9" line="359"/>
    <Argument name="rotation" type="_2259" location="f9:359" file="f9" line="359"/>
  </Constructor>
  <Method id="_2151" name="SetIdentity" returns="_1374" context="_462" access="public" mangled="_ZN11b2Transform11SetIdentityEv" demangled="b2Transform::SetIdentity()" location="f9:362" file="f9" line="362" endline="365" inline="1"/>
  <Method id="_2152" name="Set" returns="_1374" context="_462" access="public" mangled="_ZN11b2Transform3SetERK6b2Vec2f" demangled="b2Transform::Set(b2Vec2 const&amp;, float)" location="f9:369" file="f9" line="369" endline="372" inline="1">
    <Argument name="position" type="_1469" location="f9:369" file="f9" line="369"/>
    <Argument name="angle" type="_179" location="f9:369" file="f9" line="369"/>
  </Method>
  <CvQualifiedType id="_226c" type="_226" const="1"/>
  <Field id="_2154" name="step" type="_179" offset="0" context="_468" access="public" location="f30:27" file="f30" line="27"/>
  <Field id="_2155" name="collide" type="_179" offset="32" context="_468" access="public" location="f30:28" file="f30" line="28"/>
  <Field id="_2156" name="solve" type="_179" offset="64" context="_468" access="public" location="f30:29" file="f30" line="29"/>
  <Field id="_2157" name="solveInit" type="_179" offset="96" context="_468" access="public" location="f30:30" file="f30" line="30"/>
  <Field id="_2158" name="solveVelocity" type="_179" offset="128" context="_468" access="public" location="f30:31" file="f30" line="31"/>
  <Field id="_2159" name="solvePosition" type="_179" offset="160" context="_468" access="public" location="f30:32" file="f30" line="32"/>
  <Field id="_2160" name="broadphase" type="_179" offset="192" context="_468" access="public" location="f30:33" file="f30" line="33"/>
  <Field id="_2161" name="solveTOI" type="_179" offset="224" context="_468" access="public" location="f30:34" file="f30" line="34"/>
  <Destructor id="_2162" name="b2Profile" artificial="1" throw="" context="_468" access="public" mangled="_ZN9b2ProfileD1Ev *INTERNAL* " demangled="b2Profile::~b2Profile()" location="f30:26" file="f30" line="26" endline="26" inline="1">
  </Destructor>
  <OperatorMethod id="_2163" name="=" returns="_4272" artificial="1" throw="" context="_468" access="public" mangled="_ZN9b2ProfileaSERKS_" demangled="b2Profile::operator=(b2Profile const&amp;)" location="f30:26" file="f30" line="26" endline="26" inline="1">
    <Argument type="_4273" location="f30:26" file="f30" line="26"/>
  </OperatorMethod>
  <Constructor id="_2164" name="b2Profile" artificial="1" throw="" context="_468" access="public" mangled="_ZN9b2ProfileC1ERKS_ *INTERNAL* " demangled="b2Profile::b2Profile(b2Profile const&amp;)" location="f30:26" file="f30" line="26" endline="26" inline="1">
    <Argument type="_4273" location="f30:26" file="f30" line="26"/>
  </Constructor>
  <Constructor id="_2165" name="b2Profile" artificial="1" throw="" context="_468" access="public" mangled="_ZN9b2ProfileC1Ev *INTERNAL* " demangled="b2Profile::b2Profile()" location="f30:26" file="f30" line="26" inline="1"/>
  <Field id="_2166" name="m_buffer" type="_4026" offset="0" context="_474" access="public" location="f49:49" file="f49" line="49"/>
  <Field id="_2167" name="m_vertices" type="_4217" offset="128" context="_474" access="public" location="f49:50" file="f49" line="50"/>
  <Field id="_2168" name="m_count" type="_114" offset="160" context="_474" access="public" location="f49:51" file="f49" line="51"/>
  <Field id="_2169" name="m_radius" type="_179" offset="192" context="_474" access="public" location="f49:52" file="f49" line="52"/>
  <Destructor id="_2170" name="b2DistanceProxy" artificial="1" throw="" context="_474" access="public" mangled="_ZN15b2DistanceProxyD1Ev *INTERNAL* " demangled="b2DistanceProxy::~b2DistanceProxy()" location="f49:30" file="f49" line="30" endline="30" inline="1">
  </Destructor>
  <OperatorMethod id="_2171" name="=" returns="_4274" artificial="1" throw="" context="_474" access="public" mangled="_ZN15b2DistanceProxyaSERKS_" demangled="b2DistanceProxy::operator=(b2DistanceProxy const&amp;)" location="f49:30" file="f49" line="30" endline="30" inline="1">
    <Argument type="_4275" location="f49:30" file="f49" line="30"/>
  </OperatorMethod>
  <Constructor id="_2172" name="b2DistanceProxy" artificial="1" throw="" context="_474" access="public" mangled="_ZN15b2DistanceProxyC1ERKS_ *INTERNAL* " demangled="b2DistanceProxy::b2DistanceProxy(b2DistanceProxy const&amp;)" location="f49:30" file="f49" line="30" endline="30" inline="1">
    <Argument type="_4275" location="f49:30" file="f49" line="30"/>
  </Constructor>
  <Constructor id="_2173" name="b2DistanceProxy" explicit="1" context="_474" access="public" mangled="_ZN15b2DistanceProxyC1Ev *INTERNAL* " demangled="b2DistanceProxy::b2DistanceProxy()" location="f49:31" file="f49" line="31" endline="31" inline="1"/>
  <Method id="_2174" name="Set" returns="_1374" context="_474" access="public" mangled="_ZN15b2DistanceProxy3SetEPK7b2Shapei" demangled="b2DistanceProxy::Set(b2Shape const*, int)" location="f49:35" file="f49" line="35" extern="1">
    <Argument name="shape" type="_2111" location="f49:35" file="f49" line="35"/>
    <Argument name="index" type="_114" location="f49:35" file="f49" line="35"/>
  </Method>
  <Method id="_2175" name="GetSupport" returns="_114" const="1" context="_474" access="public" mangled="_ZNK15b2DistanceProxy10GetSupportERK6b2Vec2" demangled="b2DistanceProxy::GetSupport(b2Vec2 const&amp;) const" location="f49:107" file="f49" line="107" endline="121" inline="1">
    <Argument name="d" type="_1469" location="f49:107" file="f49" line="107"/>
  </Method>
  <Method id="_2176" name="GetSupportVertex" returns="_1469" const="1" context="_474" access="public" mangled="_ZNK15b2DistanceProxy16GetSupportVertexERK6b2Vec2" demangled="b2DistanceProxy::GetSupportVertex(b2Vec2 const&amp;) const" location="f49:124" file="f49" line="124" endline="138" inline="1">
    <Argument name="d" type="_1469" location="f49:124" file="f49" line="124"/>
  </Method>
  <Method id="_2177" name="GetVertexCount" returns="_114" const="1" context="_474" access="public" mangled="_ZNK15b2DistanceProxy14GetVertexCountEv" demangled="b2DistanceProxy::GetVertexCount() const" location="f49:96" file="f49" line="96" endline="98" inline="1"/>
  <Method id="_2178" name="GetVertex" returns="_1469" const="1" context="_474" access="public" mangled="_ZNK15b2DistanceProxy9GetVertexEi" demangled="b2DistanceProxy::GetVertex(int) const" location="f49:101" file="f49" line="101" endline="104" inline="1">
    <Argument name="index" type="_114" location="f49:101" file="f49" line="101"/>
  </Method>
  <Field id="_2179" name="major" type="_114" offset="0" context="_483" access="public" location="f7:138" file="f7" line="138"/>
  <Field id="_2180" name="minor" type="_114" offset="32" context="_483" access="public" location="f7:139" file="f7" line="139"/>
  <Field id="_2181" name="revision" type="_114" offset="64" context="_483" access="public" location="f7:140" file="f7" line="140"/>
  <Destructor id="_2182" name="b2Version" artificial="1" throw="" context="_483" access="public" mangled="_ZN9b2VersionD1Ev *INTERNAL* " demangled="b2Version::~b2Version()" location="f7:137" file="f7" line="137" endline="137" inline="1">
  </Destructor>
  <OperatorMethod id="_2183" name="=" returns="_4276" artificial="1" throw="" context="_483" access="public" mangled="_ZN9b2VersionaSERKS_" demangled="b2Version::operator=(b2Version const&amp;)" location="f7:137" file="f7" line="137" endline="137" inline="1">
    <Argument type="_4277" location="f7:137" file="f7" line="137"/>
  </OperatorMethod>
  <Constructor id="_2184" name="b2Version" artificial="1" throw="" context="_483" access="public" mangled="_ZN9b2VersionC1ERKS_ *INTERNAL* " demangled="b2Version::b2Version(b2Version const&amp;)" location="f7:137" file="f7" line="137" endline="137" inline="1">
    <Argument type="_4277" location="f7:137" file="f7" line="137"/>
  </Constructor>
  <Constructor id="_2185" name="b2Version" artificial="1" throw="" context="_483" access="public" mangled="_ZN9b2VersionC1Ev *INTERNAL* " demangled="b2Version::b2Version()" location="f7:137" file="f7" line="137" inline="1"/>
  <Field id="_2186" name="s" type="_179" offset="0" context="_496" access="public" location="f9:348" file="f9" line="348"/>
  <Field id="_2187" name="c" type="_179" offset="32" context="_496" access="public" location="f9:348" file="f9" line="348"/>
  <Destructor id="_2188" name="b2Rot" artificial="1" throw="" context="_496" access="public" mangled="_ZN5b2RotD1Ev *INTERNAL* " demangled="b2Rot::~b2Rot()" location="f9:303" file="f9" line="303" endline="303" inline="1">
  </Destructor>
  <OperatorMethod id="_2189" name="=" returns="_4278" artificial="1" throw="" context="_496" access="public" mangled="_ZN5b2RotaSERKS_" demangled="b2Rot::operator=(b2Rot const&amp;)" location="f9:303" file="f9" line="303" endline="303" inline="1">
    <Argument type="_2259" location="f9:303" file="f9" line="303"/>
  </OperatorMethod>
  <Constructor id="_2190" name="b2Rot" artificial="1" throw="" context="_496" access="public" mangled="_ZN5b2RotC1ERKS_ *INTERNAL* " demangled="b2Rot::b2Rot(b2Rot const&amp;)" location="f9:303" file="f9" line="303" endline="303" inline="1">
    <Argument type="_2259" location="f9:303" file="f9" line="303"/>
  </Constructor>
  <Constructor id="_2191" name="b2Rot" explicit="1" context="_496" access="public" mangled="_ZN5b2RotC1Ev *INTERNAL* " demangled="b2Rot::b2Rot()" location="f9:304" file="f9" line="304" inline="1"/>
  <Constructor id="_2192" name="b2Rot" explicit="1" context="_496" access="public" mangled="_ZN5b2RotC1Ef *INTERNAL* " demangled="b2Rot::b2Rot(float)" location="f9:307" file="f9" line="307" endline="311" inline="1">
    <Argument name="angle" type="_179" location="f9:307" file="f9" line="307"/>
  </Constructor>
  <Method id="_2193" name="Set" returns="_1374" context="_496" access="public" mangled="_ZN5b2Rot3SetEf" demangled="b2Rot::Set(float)" location="f9:315" file="f9" line="315" endline="319" inline="1">
    <Argument name="angle" type="_179" location="f9:315" file="f9" line="315"/>
  </Method>
  <Method id="_2194" name="SetIdentity" returns="_1374" context="_496" access="public" mangled="_ZN5b2Rot11SetIdentityEv" demangled="b2Rot::SetIdentity()" location="f9:323" file="f9" line="323" endline="326" inline="1"/>
  <Method id="_2195" name="GetAngle" returns="_179" const="1" context="_496" access="public" mangled="_ZNK5b2Rot8GetAngleEv" demangled="b2Rot::GetAngle() const" location="f9:330" file="f9" line="330" endline="332" inline="1"/>
  <Method id="_2196" name="GetXAxis" returns="_226" const="1" context="_496" access="public" mangled="_ZNK5b2Rot8GetXAxisEv" demangled="b2Rot::GetXAxis() const" location="f9:336" file="f9" line="336" endline="338" inline="1"/>
  <Method id="_2197" name="GetYAxis" returns="_226" const="1" context="_496" access="public" mangled="_ZNK5b2Rot8GetYAxisEv" demangled="b2Rot::GetYAxis() const" location="f9:342" file="f9" line="342" endline="344" inline="1"/>
  <PointerType id="_2198" type="_1054" size="32" align="32"/>
  <CvQualifiedType id="_2198r" type="_2198" restrict="1"/>
  <PointerType id="_2200" type="_562c" size="32" align="32"/>
  <CvQualifiedType id="_2200r" type="_2200" restrict="1"/>
  <PointerType id="_2202" type="_79c" size="32" align="32"/>
  <CvQualifiedType id="_2202r" type="_2202" restrict="1"/>
  <Field id="_2204" name="aabb" type="_795" offset="0" context="_512" access="public" location="f34:92" file="f34" line="92"/>
  <Field id="_2205" name="fixture" type="_2225" offset="128" context="_512" access="public" location="f34:93" file="f34" line="93"/>
  <Field id="_2206" name="childIndex" type="_114" offset="160" context="_512" access="public" location="f34:94" file="f34" line="94"/>
  <Field id="_2207" name="proxyId" type="_114" offset="192" context="_512" access="public" location="f34:95" file="f34" line="95"/>
  <Destructor id="_2208" name="b2FixtureProxy" artificial="1" throw="" context="_512" access="public" mangled="_ZN14b2FixtureProxyD1Ev *INTERNAL* " demangled="b2FixtureProxy::~b2FixtureProxy()" location="f34:91" file="f34" line="91" endline="91" inline="1">
  </Destructor>
  <OperatorMethod id="_2209" name="=" returns="_4281" artificial="1" throw="" context="_512" access="public" mangled="_ZN14b2FixtureProxyaSERKS_" demangled="b2FixtureProxy::operator=(b2FixtureProxy const&amp;)" location="f34:91" file="f34" line="91" endline="91" inline="1">
    <Argument type="_4282" location="f34:91" file="f34" line="91"/>
  </OperatorMethod>
  <Constructor id="_2210" name="b2FixtureProxy" artificial="1" throw="" context="_512" access="public" mangled="_ZN14b2FixtureProxyC1ERKS_ *INTERNAL* " demangled="b2FixtureProxy::b2FixtureProxy(b2FixtureProxy const&amp;)" location="f34:91" file="f34" line="91" endline="91" inline="1">
    <Argument type="_4282" location="f34:91" file="f34" line="91"/>
  </Constructor>
  <Constructor id="_2211" name="b2FixtureProxy" artificial="1" context="_512" access="public" mangled="_ZN14b2FixtureProxyC1Ev *INTERNAL* " demangled="b2FixtureProxy::b2FixtureProxy()" location="f34:91" file="f34" line="91" endline="91" inline="1"/>
  <Field id="_2212" name="quot" type="_26" offset="0" context="_513" access="public" location="f5:120" file="f5" line="120"/>
  <Field id="_2213" name="rem" type="_26" offset="64" context="_513" access="public" location="f5:121" file="f5" line="121"/>
  <Destructor id="_2214" name="._49" artificial="1" throw="" context="_513" access="public" mangled="_ZN7lldiv_tD1Ev *INTERNAL* " demangled="lldiv_t::~lldiv_t()" location="f5:122" file="f5" line="122" endline="122" inline="1">
  </Destructor>
  <OperatorMethod id="_2215" name="=" returns="_4283" artificial="1" throw="" context="_513" access="public" mangled="_ZN7lldiv_taSERKS_" demangled="lldiv_t::operator=(lldiv_t const&amp;)" location="f5:122" file="f5" line="122" endline="122" inline="1">
    <Argument type="_4284" location="f5:119" file="f5" line="119"/>
  </OperatorMethod>
  <Constructor id="_2216" name="._49" artificial="1" throw="" context="_513" access="public" mangled="_ZN7lldiv_tC1ERKS_ *INTERNAL* " demangled="lldiv_t::lldiv_t(lldiv_t const&amp;)" location="f5:122" file="f5" line="122" endline="122" inline="1">
    <Argument type="_4284" location="f5:119" file="f5" line="119"/>
  </Constructor>
  <Constructor id="_2217" name="._49" artificial="1" throw="" context="_513" access="public" mangled="_ZN7lldiv_tC1Ev *INTERNAL* " demangled="lldiv_t::lldiv_t()" location="f5:122" file="f5" line="122" inline="1"/>
  <Field id="_2218" name="__size" type="_3979" offset="0" context="_531" access="public" location="f8:164" file="f8" line="164"/>
  <Field id="_2219" name="__align" type="_113" offset="0" context="_531" access="public" location="f8:165" file="f8" line="165"/>
  <Destructor id="_2220" name="._64" artificial="1" throw="" context="_531" access="public" mangled="_ZN21pthread_barrierattr_tD1Ev *INTERNAL* " demangled="pthread_barrierattr_t::~pthread_barrierattr_t()" location="f8:166" file="f8" line="166" endline="166" inline="1">
  </Destructor>
  <OperatorMethod id="_2221" name="=" returns="_4285" artificial="1" throw="" context="_531" access="public" mangled="_ZN21pthread_barrierattr_taSERKS_" demangled="pthread_barrierattr_t::operator=(pthread_barrierattr_t const&amp;)" location="f8:166" file="f8" line="166" endline="166" inline="1">
    <Argument type="_4286" location="f8:163" file="f8" line="163"/>
  </OperatorMethod>
  <Constructor id="_2222" name="._64" artificial="1" throw="" context="_531" access="public" mangled="_ZN21pthread_barrierattr_tC1ERKS_ *INTERNAL* " demangled="pthread_barrierattr_t::pthread_barrierattr_t(pthread_barrierattr_t const&amp;)" location="f8:166" file="f8" line="166" endline="166" inline="1">
    <Argument type="_4286" location="f8:163" file="f8" line="163"/>
  </Constructor>
  <Constructor id="_2223" name="._64" artificial="1" throw="" context="_531" access="public" mangled="_ZN21pthread_barrierattr_tC1Ev *INTERNAL* " demangled="pthread_barrierattr_t::pthread_barrierattr_t()" location="f8:166" file="f8" line="166" inline="1"/>
  <PointerType id="_2224" type="_54" size="32" align="32"/>
  <PointerType id="_2225" type="_248" size="32" align="32"/>
  <PointerType id="_2226" type="_976" size="32" align="32"/>
  <Field id="_2227" name="tv_sec" type="_647" offset="0" context="_562" access="public" location="f25:122" file="f25" line="122"/>
  <Field id="_2228" name="tv_nsec" type="_67" offset="32" context="_562" access="public" location="f25:123" file="f25" line="123"/>
  <Destructor id="_2229" name="timespec" artificial="1" throw="" context="_562" access="public" mangled="_ZN8timespecD1Ev *INTERNAL* " demangled="timespec::~timespec()" location="f25:121" file="f25" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_2230" name="=" returns="_4287" artificial="1" throw="" context="_562" access="public" mangled="_ZN8timespecaSERKS_" demangled="timespec::operator=(timespec const&amp;)" location="f25:121" file="f25" line="121" endline="121" inline="1">
    <Argument type="_4288" location="f25:121" file="f25" line="121"/>
  </OperatorMethod>
  <Constructor id="_2231" name="timespec" artificial="1" throw="" context="_562" access="public" mangled="_ZN8timespecC1ERKS_ *INTERNAL* " demangled="timespec::timespec(timespec const&amp;)" location="f25:121" file="f25" line="121" endline="121" inline="1">
    <Argument type="_4288" location="f25:121" file="f25" line="121"/>
  </Constructor>
  <Constructor id="_2232" name="timespec" artificial="1" throw="" context="_562" access="public" mangled="_ZN8timespecC1Ev *INTERNAL* " demangled="timespec::timespec()" location="f25:121" file="f25" line="121" inline="1"/>
  <Field id="_2233" name="other" type="_3999" offset="0" context="_566" access="public" location="f31:66" file="f31" line="66"/>
  <Field id="_2234" name="joint" type="_3986" offset="32" context="_566" access="public" location="f31:67" file="f31" line="67"/>
  <Field id="_2235" name="prev" type="_4289" offset="64" context="_566" access="public" location="f31:68" file="f31" line="68"/>
  <Field id="_2236" name="next" type="_4289" offset="96" context="_566" access="public" location="f31:69" file="f31" line="69"/>
  <Destructor id="_2237" name="b2JointEdge" artificial="1" throw="" context="_566" access="public" mangled="_ZN11b2JointEdgeD1Ev *INTERNAL* " demangled="b2JointEdge::~b2JointEdge()" location="f31:65" file="f31" line="65" endline="65" inline="1">
  </Destructor>
  <OperatorMethod id="_2238" name="=" returns="_4290" artificial="1" throw="" context="_566" access="public" mangled="_ZN11b2JointEdgeaSERKS_" demangled="b2JointEdge::operator=(b2JointEdge const&amp;)" location="f31:65" file="f31" line="65" endline="65" inline="1">
    <Argument type="_4291" location="f31:65" file="f31" line="65"/>
  </OperatorMethod>
  <Constructor id="_2239" name="b2JointEdge" artificial="1" throw="" context="_566" access="public" mangled="_ZN11b2JointEdgeC1ERKS_ *INTERNAL* " demangled="b2JointEdge::b2JointEdge(b2JointEdge const&amp;)" location="f31:65" file="f31" line="65" endline="65" inline="1">
    <Argument type="_4291" location="f31:65" file="f31" line="65"/>
  </Constructor>
  <Constructor id="_2240" name="b2JointEdge" artificial="1" throw="" context="_566" access="public" mangled="_ZN11b2JointEdgeC1Ev *INTERNAL* " demangled="b2JointEdge::b2JointEdge()" location="f31:65" file="f31" line="65" inline="1"/>
  <Field id="_2241" name="localAnchorA" type="_226" offset="160" context="_584" access="public" location="f29:56" file="f29" line="56"/>
  <Field id="_2242" name="localAnchorB" type="_226" offset="224" context="_584" access="public" location="f29:59" file="f29" line="59"/>
  <Field id="_2243" name="referenceAngle" type="_179" offset="288" context="_584" access="public" location="f29:62" file="f29" line="62"/>
  <Field id="_2244" name="enableLimit" type="_1355" offset="320" context="_584" access="public" location="f29:65" file="f29" line="65"/>
  <Field id="_2245" name="lowerAngle" type="_179" offset="352" context="_584" access="public" location="f29:68" file="f29" line="68"/>
  <Field id="_2246" name="upperAngle" type="_179" offset="384" context="_584" access="public" location="f29:71" file="f29" line="71"/>
  <Field id="_2247" name="enableMotor" type="_1355" offset="416" context="_584" access="public" location="f29:74" file="f29" line="74"/>
  <Field id="_2248" name="motorSpeed" type="_179" offset="448" context="_584" access="public" location="f29:77" file="f29" line="77"/>
  <Field id="_2249" name="maxMotorTorque" type="_179" offset="480" context="_584" access="public" location="f29:81" file="f29" line="81"/>
  <Destructor id="_2250" name="b2RevoluteJointDef" artificial="1" throw="" context="_584" access="public" mangled="_ZN18b2RevoluteJointDefD1Ev *INTERNAL* " demangled="b2RevoluteJointDef::~b2RevoluteJointDef()" location="f29:36" file="f29" line="36" endline="36" inline="1">
  </Destructor>
  <OperatorMethod id="_2251" name="=" returns="_4292" artificial="1" throw="" context="_584" access="public" mangled="_ZN18b2RevoluteJointDefaSERKS_" demangled="b2RevoluteJointDef::operator=(b2RevoluteJointDef const&amp;)" location="f29:36" file="f29" line="36" endline="36" inline="1">
    <Argument type="_4293" location="f29:36" file="f29" line="36"/>
  </OperatorMethod>
  <Constructor id="_2252" name="b2RevoluteJointDef" artificial="1" throw="" context="_584" access="public" mangled="_ZN18b2RevoluteJointDefC1ERKS_ *INTERNAL* " demangled="b2RevoluteJointDef::b2RevoluteJointDef(b2RevoluteJointDef const&amp;)" location="f29:36" file="f29" line="36" endline="36" inline="1">
    <Argument type="_4293" location="f29:36" file="f29" line="36"/>
  </Constructor>
  <Constructor id="_2253" name="b2RevoluteJointDef" explicit="1" context="_584" access="public" mangled="_ZN18b2RevoluteJointDefC1Ev *INTERNAL* " demangled="b2RevoluteJointDef::b2RevoluteJointDef()" location="f29:37" file="f29" line="37" endline="48" inline="1"/>
  <Method id="_2254" name="Initialize" returns="_1374" context="_584" access="public" mangled="_ZN18b2RevoluteJointDef10InitializeEP6b2BodyS1_RK6b2Vec2" demangled="b2RevoluteJointDef::Initialize(b2Body*, b2Body*, b2Vec2 const&amp;)" location="f29:53" file="f29" line="53" extern="1">
    <Argument name="bodyA" type="_3999" location="f29:53" file="f29" line="53"/>
    <Argument name="bodyB" type="_3999" location="f29:53" file="f29" line="53"/>
    <Argument name="anchor" type="_1469" location="f29:53" file="f29" line="53"/>
  </Method>
  <PointerType id="_2255" type="_859" size="32" align="32"/>
  <CvQualifiedType id="_2255r" type="_2255" restrict="1"/>
  <PointerType id="_2257" type="_685c" size="32" align="32"/>
  <CvQualifiedType id="_2257r" type="_2257" restrict="1"/>
  <ReferenceType id="_2259" type="_496c" size="32" align="32"/>
  <ReferenceType id="_2260" type="_51c" size="32" align="32"/>
  <ReferenceType id="_2261" type="_227c" size="32" align="32"/>
  <ReferenceType id="_2262" type="_43c" size="32" align="32"/>
  <Field id="_2263" name="shape" type="_2111" offset="0" context="_624" access="public" location="f34:67" file="f34" line="67"/>
  <Field id="_2264" name="userData" type="_688" offset="32" context="_624" access="public" location="f34:70" file="f34" line="70"/>
  <Field id="_2265" name="friction" type="_179" offset="64" context="_624" access="public" location="f34:73" file="f34" line="73"/>
  <Field id="_2266" name="restitution" type="_179" offset="96" context="_624" access="public" location="f34:76" file="f34" line="76"/>
  <Field id="_2267" name="density" type="_179" offset="128" context="_624" access="public" location="f34:79" file="f34" line="79"/>
  <Field id="_2268" name="isSensor" type="_1355" offset="160" context="_624" access="public" location="f34:83" file="f34" line="83"/>
  <Field id="_2269" name="filter" type="_373" offset="176" context="_624" access="public" location="f34:86" file="f34" line="86"/>
  <Destructor id="_2270" name="b2FixtureDef" artificial="1" throw="" context="_624" access="public" mangled="_ZN12b2FixtureDefD1Ev *INTERNAL* " demangled="b2FixtureDef::~b2FixtureDef()" location="f34:50" file="f34" line="50" endline="50" inline="1">
  </Destructor>
  <OperatorMethod id="_2271" name="=" returns="_4299" artificial="1" throw="" context="_624" access="public" mangled="_ZN12b2FixtureDefaSERKS_" demangled="b2FixtureDef::operator=(b2FixtureDef const&amp;)" location="f34:50" file="f34" line="50" endline="50" inline="1">
    <Argument type="_4300" location="f34:50" file="f34" line="50"/>
  </OperatorMethod>
  <Constructor id="_2272" name="b2FixtureDef" artificial="1" throw="" context="_624" access="public" mangled="_ZN12b2FixtureDefC1ERKS_ *INTERNAL* " demangled="b2FixtureDef::b2FixtureDef(b2FixtureDef const&amp;)" location="f34:50" file="f34" line="50" endline="50" inline="1">
    <Argument type="_4300" location="f34:50" file="f34" line="50"/>
  </Constructor>
  <Constructor id="_2273" name="b2FixtureDef" explicit="1" context="_624" access="public" mangled="_ZN12b2FixtureDefC1Ev *INTERNAL* " demangled="b2FixtureDef::b2FixtureDef()" location="f34:52" file="f34" line="52" endline="62" inline="1"/>
  <Field id="_2274" name="localCenter" type="_226" offset="0" context="_638" access="public" location="f9:396" file="f9" line="396"/>
  <Field id="_2275" name="c0" type="_226" offset="64" context="_638" access="public" location="f9:397" file="f9" line="397"/>
  <Field id="_2276" name="c" type="_226" offset="128" context="_638" access="public" location="f9:397" file="f9" line="397"/>
  <Field id="_2277" name="a0" type="_179" offset="192" context="_638" access="public" location="f9:398" file="f9" line="398"/>
  <Field id="_2278" name="a" type="_179" offset="224" context="_638" access="public" location="f9:398" file="f9" line="398"/>
  <Field id="_2279" name="alpha0" type="_179" offset="256" context="_638" access="public" location="f9:402" file="f9" line="402"/>
  <Destructor id="_2280" name="b2Sweep" artificial="1" throw="" context="_638" access="public" mangled="_ZN7b2SweepD1Ev *INTERNAL* " demangled="b2Sweep::~b2Sweep()" location="f9:384" file="f9" line="384" endline="384" inline="1">
  </Destructor>
  <OperatorMethod id="_2281" name="=" returns="_4301" artificial="1" throw="" context="_638" access="public" mangled="_ZN7b2SweepaSERKS_" demangled="b2Sweep::operator=(b2Sweep const&amp;)" location="f9:384" file="f9" line="384" endline="384" inline="1">
    <Argument type="_4302" location="f9:384" file="f9" line="384"/>
  </OperatorMethod>
  <Constructor id="_2282" name="b2Sweep" artificial="1" throw="" context="_638" access="public" mangled="_ZN7b2SweepC1ERKS_ *INTERNAL* " demangled="b2Sweep::b2Sweep(b2Sweep const&amp;)" location="f9:384" file="f9" line="384" endline="384" inline="1">
    <Argument type="_4302" location="f9:384" file="f9" line="384"/>
  </Constructor>
  <Constructor id="_2283" name="b2Sweep" artificial="1" context="_638" access="public" mangled="_ZN7b2SweepC1Ev *INTERNAL* " demangled="b2Sweep::b2Sweep()" location="f9:384" file="f9" line="384" endline="384" inline="1"/>
  <Method id="_2284" name="GetTransform" returns="_1374" const="1" context="_638" access="public" mangled="_ZNK7b2Sweep12GetTransformEP11b2Transformf" demangled="b2Sweep::GetTransform(b2Transform*, float) const" location="f9:689" file="f9" line="689" endline="696" inline="1">
    <Argument name="xf" type="_4303" location="f9:689" file="f9" line="689"/>
    <Argument name="beta" type="_179" location="f9:689" file="f9" line="689"/>
  </Method>
  <Method id="_2285" name="Advance" returns="_1374" context="_638" access="public" mangled="_ZN7b2Sweep7AdvanceEf" demangled="b2Sweep::Advance(float)" location="f9:699" file="f9" line="699" endline="705" inline="1">
    <Argument name="alpha" type="_179" location="f9:699" file="f9" line="699"/>
  </Method>
  <Method id="_2286" name="Normalize" returns="_1374" context="_638" access="public" mangled="_ZN7b2Sweep9NormalizeEv" demangled="b2Sweep::Normalize()" location="f9:709" file="f9" line="709" endline="714" inline="1"/>
  <Field id="_2287" name="data" type="_685" offset="0" context="_639" access="public" location="f23:29" file="f23" line="29"/>
  <Field id="_2288" name="size" type="_114" offset="32" context="_639" access="public" location="f23:30" file="f23" line="30"/>
  <Field id="_2289" name="usedMalloc" type="_1355" offset="64" context="_639" access="public" location="f23:31" file="f23" line="31"/>
  <Destructor id="_2290" name="b2StackEntry" artificial="1" throw="" context="_639" access="public" mangled="_ZN12b2StackEntryD1Ev *INTERNAL* " demangled="b2StackEntry::~b2StackEntry()" location="f23:28" file="f23" line="28" endline="28" inline="1">
  </Destructor>
  <OperatorMethod id="_2291" name="=" returns="_4304" artificial="1" throw="" context="_639" access="public" mangled="_ZN12b2StackEntryaSERKS_" demangled="b2StackEntry::operator=(b2StackEntry const&amp;)" location="f23:28" file="f23" line="28" endline="28" inline="1">
    <Argument type="_4305" location="f23:28" file="f23" line="28"/>
  </OperatorMethod>
  <Constructor id="_2292" name="b2StackEntry" artificial="1" throw="" context="_639" access="public" mangled="_ZN12b2StackEntryC1ERKS_ *INTERNAL* " demangled="b2StackEntry::b2StackEntry(b2StackEntry const&amp;)" location="f23:28" file="f23" line="28" endline="28" inline="1">
    <Argument type="_4305" location="f23:28" file="f23" line="28"/>
  </Constructor>
  <Constructor id="_2293" name="b2StackEntry" artificial="1" throw="" context="_639" access="public" mangled="_ZN12b2StackEntryC1Ev *INTERNAL* " demangled="b2StackEntry::b2StackEntry()" location="f23:28" file="f23" line="28" inline="1"/>
  <Field id="_2294" name="m_localAnchorA" type="_226" offset="512" context="_644" access="protected" location="f47:144" file="f47" line="144"/>
  <Field id="_2295" name="m_localAnchorB" type="_226" offset="576" context="_644" access="protected" location="f47:145" file="f47" line="145"/>
  <Field id="_2296" name="m_localXAxisA" type="_226" offset="640" context="_644" access="protected" location="f47:146" file="f47" line="146"/>
  <Field id="_2297" name="m_localYAxisA" type="_226" offset="704" context="_644" access="protected" location="f47:147" file="f47" line="147"/>
  <Field id="_2298" name="m_refAngle" type="_179" offset="768" context="_644" access="protected" location="f47:148" file="f47" line="148"/>
  <Field id="_2299" name="m_impulse" type="_227" offset="800" context="_644" access="protected" location="f47:149" file="f47" line="149"/>
  <Field id="_2300" name="m_motorImpulse" type="_179" offset="896" context="_644" access="protected" location="f47:150" file="f47" line="150"/>
  <Field id="_2301" name="m_lowerTranslation" type="_179" offset="928" context="_644" access="protected" location="f47:151" file="f47" line="151"/>
  <Field id="_2302" name="m_upperTranslation" type="_179" offset="960" context="_644" access="protected" location="f47:152" file="f47" line="152"/>
  <Field id="_2303" name="m_maxMotorForce" type="_179" offset="992" context="_644" access="protected" location="f47:153" file="f47" line="153"/>
  <Field id="_2304" name="m_motorSpeed" type="_179" offset="1024" context="_644" access="protected" location="f47:154" file="f47" line="154"/>
  <Field id="_2305" name="m_enableLimit" type="_1355" offset="1056" context="_644" access="protected" location="f47:155" file="f47" line="155"/>
  <Field id="_2306" name="m_enableMotor" type="_1355" offset="1064" context="_644" access="protected" location="f47:156" file="f47" line="156"/>
  <Field id="_2307" name="m_limitState" type="_225" offset="1088" context="_644" access="protected" location="f47:157" file="f47" line="157"/>
  <Field id="_2308" name="m_indexA" type="_114" offset="1120" context="_644" access="protected" location="f47:160" file="f47" line="160"/>
  <Field id="_2309" name="m_indexB" type="_114" offset="1152" context="_644" access="protected" location="f47:161" file="f47" line="161"/>
  <Field id="_2310" name="m_localCenterA" type="_226" offset="1184" context="_644" access="protected" location="f47:162" file="f47" line="162"/>
  <Field id="_2311" name="m_localCenterB" type="_226" offset="1248" context="_644" access="protected" location="f47:163" file="f47" line="163"/>
  <Field id="_2312" name="m_invMassA" type="_179" offset="1312" context="_644" access="protected" location="f47:164" file="f47" line="164"/>
  <Field id="_2313" name="m_invMassB" type="_179" offset="1344" context="_644" access="protected" location="f47:165" file="f47" line="165"/>
  <Field id="_2314" name="m_invIA" type="_179" offset="1376" context="_644" access="protected" location="f47:166" file="f47" line="166"/>
  <Field id="_2315" name="m_invIB" type="_179" offset="1408" context="_644" access="protected" location="f47:167" file="f47" line="167"/>
  <Field id="_2316" name="m_axis" type="_226" offset="1440" context="_644" access="protected" location="f47:168" file="f47" line="168"/>
  <Field id="_2317" name="m_perp" type="_226" offset="1504" context="_644" access="protected" location="f47:168" file="f47" line="168"/>
  <Field id="_2318" name="m_s1" type="_179" offset="1568" context="_644" access="protected" location="f47:169" file="f47" line="169"/>
  <Field id="_2319" name="m_s2" type="_179" offset="1600" context="_644" access="protected" location="f47:169" file="f47" line="169"/>
  <Field id="_2320" name="m_a1" type="_179" offset="1632" context="_644" access="protected" location="f47:170" file="f47" line="170"/>
  <Field id="_2321" name="m_a2" type="_179" offset="1664" context="_644" access="protected" location="f47:170" file="f47" line="170"/>
  <Field id="_2322" name="m_K" type="_51" offset="1696" context="_644" access="protected" location="f47:171" file="f47" line="171"/>
  <Field id="_2323" name="m_motorMass" type="_179" offset="1984" context="_644" access="protected" location="f47:172" file="f47" line="172"/>
  <OperatorMethod id="_2324" name="=" returns="_4306" artificial="1" throw="" context="_644" access="public" mangled="_ZN16b2PrismaticJointaSERKS_" demangled="b2PrismaticJoint::operator=(b2PrismaticJoint const&amp;)" location="f47:87" file="f47" line="87" endline="87" inline="1">
    <Argument type="_4307" location="f47:87" file="f47" line="87"/>
  </OperatorMethod>
  <Constructor id="_2325" name="b2PrismaticJoint" artificial="1" throw="" context="_644" access="public" mangled="_ZN16b2PrismaticJointC1ERKS_ *INTERNAL* " demangled="b2PrismaticJoint::b2PrismaticJoint(b2PrismaticJoint const&amp;)" location="f47:87" file="f47" line="87" endline="87" inline="1">
    <Argument type="_4307" location="f47:87" file="f47" line="87"/>
  </Constructor>
  <Method id="_2326" name="GetAnchorA" returns="_226" const="1" virtual="1" overrides="_2801 " context="_644" access="public" mangled="_ZNK16b2PrismaticJoint10GetAnchorAEv" demangled="b2PrismaticJoint::GetAnchorA() const" location="f47:89" file="f47" line="89" extern="1"/>
  <Method id="_2327" name="GetAnchorB" returns="_226" const="1" virtual="1" overrides="_2802 " context="_644" access="public" mangled="_ZNK16b2PrismaticJoint10GetAnchorBEv" demangled="b2PrismaticJoint::GetAnchorB() const" location="f47:90" file="f47" line="90" extern="1"/>
  <Method id="_2328" name="GetReactionForce" returns="_226" const="1" virtual="1" overrides="_2803 " context="_644" access="public" mangled="_ZNK16b2PrismaticJoint16GetReactionForceEf" demangled="b2PrismaticJoint::GetReactionForce(float) const" location="f47:92" file="f47" line="92" extern="1">
    <Argument name="inv_dt" type="_179" location="f47:92" file="f47" line="92"/>
  </Method>
  <Method id="_2329" name="GetReactionTorque" returns="_179" const="1" virtual="1" overrides="_2804 " context="_644" access="public" mangled="_ZNK16b2PrismaticJoint17GetReactionTorqueEf" demangled="b2PrismaticJoint::GetReactionTorque(float) const" location="f47:93" file="f47" line="93" extern="1">
    <Argument name="inv_dt" type="_179" location="f47:93" file="f47" line="93"/>
  </Method>
  <Method id="_2330" name="GetJointTranslation" returns="_179" const="1" context="_644" access="public" mangled="_ZNK16b2PrismaticJoint19GetJointTranslationEv" demangled="b2PrismaticJoint::GetJointTranslation() const" location="f47:96" file="f47" line="96" extern="1"/>
  <Method id="_2331" name="GetJointSpeed" returns="_179" const="1" context="_644" access="public" mangled="_ZNK16b2PrismaticJoint13GetJointSpeedEv" demangled="b2PrismaticJoint::GetJointSpeed() const" location="f47:99" file="f47" line="99" extern="1"/>
  <Method id="_2332" name="IsLimitEnabled" returns="_1355" const="1" context="_644" access="public" mangled="_ZNK16b2PrismaticJoint14IsLimitEnabledEv" demangled="b2PrismaticJoint::IsLimitEnabled() const" location="f47:102" file="f47" line="102" extern="1"/>
  <Method id="_2333" name="EnableLimit" returns="_1374" context="_644" access="public" mangled="_ZN16b2PrismaticJoint11EnableLimitEb" demangled="b2PrismaticJoint::EnableLimit(bool)" location="f47:105" file="f47" line="105" extern="1">
    <Argument name="flag" type="_1355" location="f47:105" file="f47" line="105"/>
  </Method>
  <Method id="_2334" name="GetLowerLimit" returns="_179" const="1" context="_644" access="public" mangled="_ZNK16b2PrismaticJoint13GetLowerLimitEv" demangled="b2PrismaticJoint::GetLowerLimit() const" location="f47:108" file="f47" line="108" extern="1"/>
  <Method id="_2335" name="GetUpperLimit" returns="_179" const="1" context="_644" access="public" mangled="_ZNK16b2PrismaticJoint13GetUpperLimitEv" demangled="b2PrismaticJoint::GetUpperLimit() const" location="f47:111" file="f47" line="111" extern="1"/>
  <Method id="_2336" name="SetLimits" returns="_1374" context="_644" access="public" mangled="_ZN16b2PrismaticJoint9SetLimitsEff" demangled="b2PrismaticJoint::SetLimits(float, float)" location="f47:114" file="f47" line="114" extern="1">
    <Argument name="lower" type="_179" location="f47:114" file="f47" line="114"/>
    <Argument name="upper" type="_179" location="f47:114" file="f47" line="114"/>
  </Method>
  <Method id="_2337" name="IsMotorEnabled" returns="_1355" const="1" context="_644" access="public" mangled="_ZNK16b2PrismaticJoint14IsMotorEnabledEv" demangled="b2PrismaticJoint::IsMotorEnabled() const" location="f47:117" file="f47" line="117" extern="1"/>
  <Method id="_2338" name="EnableMotor" returns="_1374" context="_644" access="public" mangled="_ZN16b2PrismaticJoint11EnableMotorEb" demangled="b2PrismaticJoint::EnableMotor(bool)" location="f47:120" file="f47" line="120" extern="1">
    <Argument name="flag" type="_1355" location="f47:120" file="f47" line="120"/>
  </Method>
  <Method id="_2339" name="SetMotorSpeed" returns="_1374" context="_644" access="public" mangled="_ZN16b2PrismaticJoint13SetMotorSpeedEf" demangled="b2PrismaticJoint::SetMotorSpeed(float)" location="f47:123" file="f47" line="123" extern="1">
    <Argument name="speed" type="_179" location="f47:123" file="f47" line="123"/>
  </Method>
  <Method id="_2340" name="GetMotorSpeed" returns="_179" const="1" context="_644" access="public" mangled="_ZNK16b2PrismaticJoint13GetMotorSpeedEv" demangled="b2PrismaticJoint::GetMotorSpeed() const" location="f47:175" file="f47" line="175" endline="177" inline="1"/>
  <Method id="_2341" name="SetMaxMotorForce" returns="_1374" context="_644" access="public" mangled="_ZN16b2PrismaticJoint16SetMaxMotorForceEf" demangled="b2PrismaticJoint::SetMaxMotorForce(float)" location="f47:129" file="f47" line="129" extern="1">
    <Argument name="force" type="_179" location="f47:129" file="f47" line="129"/>
  </Method>
  <Method id="_2342" name="GetMotorForce" returns="_179" const="1" context="_644" access="public" mangled="_ZNK16b2PrismaticJoint13GetMotorForceEf" demangled="b2PrismaticJoint::GetMotorForce(float) const" location="f47:132" file="f47" line="132" extern="1">
    <Argument name="inv_dt" type="_179" location="f47:132" file="f47" line="132"/>
  </Method>
  <Constructor id="_2343" name="b2PrismaticJoint" context="_644" access="protected" mangled="_ZN16b2PrismaticJointC1EPK19b2PrismaticJointDef *INTERNAL* " demangled="b2PrismaticJoint::b2PrismaticJoint(b2PrismaticJointDef const*)" location="f47:137" file="f47" line="137" extern="1">
    <Argument name="def" type="_4308" location="f47:137" file="f47" line="137"/>
  </Constructor>
  <Method id="_2344" name="InitVelocityConstraints" returns="_1374" virtual="1" overrides="_2815 " context="_644" access="protected" mangled="_ZN16b2PrismaticJoint23InitVelocityConstraintsERK12b2SolverData" demangled="b2PrismaticJoint::InitVelocityConstraints(b2SolverData const&amp;)" location="f47:139" file="f47" line="139" extern="1">
    <Argument name="data" type="_4003" location="f47:139" file="f47" line="139"/>
  </Method>
  <Method id="_2345" name="SolveVelocityConstraints" returns="_1374" virtual="1" overrides="_2816 " context="_644" access="protected" mangled="_ZN16b2PrismaticJoint24SolveVelocityConstraintsERK12b2SolverData" demangled="b2PrismaticJoint::SolveVelocityConstraints(b2SolverData const&amp;)" location="f47:140" file="f47" line="140" extern="1">
    <Argument name="data" type="_4003" location="f47:140" file="f47" line="140"/>
  </Method>
  <Method id="_2346" name="SolvePositionConstraints" returns="_1355" virtual="1" overrides="_2817 " context="_644" access="protected" mangled="_ZN16b2PrismaticJoint24SolvePositionConstraintsERK12b2SolverData" demangled="b2PrismaticJoint::SolvePositionConstraints(b2SolverData const&amp;)" location="f47:141" file="f47" line="141" extern="1">
    <Argument name="data" type="_4003" location="f47:141" file="f47" line="141"/>
  </Method>
  <Destructor id="_2347" name="b2PrismaticJoint" virtual="1" overrides="_2814 " artificial="1" context="_644" access="public" mangled="_ZN16b2PrismaticJointD1Ev *INTERNAL* " demangled="b2PrismaticJoint::~b2PrismaticJoint()" location="f47:87" file="f47" line="87" endline="87" inline="1">
  </Destructor>
  <PointerType id="_2348" type="_124" size="32" align="32"/>
  <Field id="_2349" name="proxyA" type="_474" offset="0" context="_650" access="public" location="f33:28" file="f33" line="28"/>
  <Field id="_2350" name="proxyB" type="_474" offset="224" context="_650" access="public" location="f33:29" file="f33" line="29"/>
  <Field id="_2351" name="sweepA" type="_638" offset="448" context="_650" access="public" location="f33:30" file="f33" line="30"/>
  <Field id="_2352" name="sweepB" type="_638" offset="736" context="_650" access="public" location="f33:31" file="f33" line="31"/>
  <Field id="_2353" name="tMax" type="_179" offset="1024" context="_650" access="public" location="f33:32" file="f33" line="32"/>
  <Destructor id="_2354" name="b2TOIInput" artificial="1" throw="" context="_650" access="public" mangled="_ZN10b2TOIInputD1Ev *INTERNAL* " demangled="b2TOIInput::~b2TOIInput()" location="f33:27" file="f33" line="27" endline="27" inline="1">
  </Destructor>
  <OperatorMethod id="_2355" name="=" returns="_4309" artificial="1" throw="" context="_650" access="public" mangled="_ZN10b2TOIInputaSERKS_" demangled="b2TOIInput::operator=(b2TOIInput const&amp;)" location="f33:27" file="f33" line="27" endline="27" inline="1">
    <Argument type="_4310" location="f33:27" file="f33" line="27"/>
  </OperatorMethod>
  <Constructor id="_2356" name="b2TOIInput" artificial="1" throw="" context="_650" access="public" mangled="_ZN10b2TOIInputC1ERKS_ *INTERNAL* " demangled="b2TOIInput::b2TOIInput(b2TOIInput const&amp;)" location="f33:27" file="f33" line="27" endline="27" inline="1">
    <Argument type="_4310" location="f33:27" file="f33" line="27"/>
  </Constructor>
  <Constructor id="_2357" name="b2TOIInput" artificial="1" context="_650" access="public" mangled="_ZN10b2TOIInputC1Ev *INTERNAL* " demangled="b2TOIInput::b2TOIInput()" location="f33:27" file="f33" line="27" endline="27" inline="1"/>
  <Field id="_2358" name="type" type="_418" offset="0" context="_660" access="public" location="f21:74" file="f21" line="74"/>
  <Field id="_2359" name="position" type="_226" offset="32" context="_660" access="public" location="f21:78" file="f21" line="78"/>
  <Field id="_2360" name="angle" type="_179" offset="96" context="_660" access="public" location="f21:81" file="f21" line="81"/>
  <Field id="_2361" name="linearVelocity" type="_226" offset="128" context="_660" access="public" location="f21:84" file="f21" line="84"/>
  <Field id="_2362" name="angularVelocity" type="_179" offset="192" context="_660" access="public" location="f21:87" file="f21" line="87"/>
  <Field id="_2363" name="linearDamping" type="_179" offset="224" context="_660" access="public" location="f21:92" file="f21" line="92"/>
  <Field id="_2364" name="angularDamping" type="_179" offset="256" context="_660" access="public" location="f21:97" file="f21" line="97"/>
  <Field id="_2365" name="allowSleep" type="_1355" offset="288" context="_660" access="public" location="f21:101" file="f21" line="101"/>
  <Field id="_2366" name="awake" type="_1355" offset="296" context="_660" access="public" location="f21:104" file="f21" line="104"/>
  <Field id="_2367" name="fixedRotation" type="_1355" offset="304" context="_660" access="public" location="f21:107" file="f21" line="107"/>
  <Field id="_2368" name="bullet" type="_1355" offset="312" context="_660" access="public" location="f21:113" file="f21" line="113"/>
  <Field id="_2369" name="active" type="_1355" offset="320" context="_660" access="public" location="f21:116" file="f21" line="116"/>
  <Field id="_2370" name="userData" type="_688" offset="352" context="_660" access="public" location="f21:119" file="f21" line="119"/>
  <Field id="_2371" name="gravityScale" type="_179" offset="384" context="_660" access="public" location="f21:122" file="f21" line="122"/>
  <Destructor id="_2372" name="b2BodyDef" artificial="1" throw="" context="_660" access="public" mangled="_ZN9b2BodyDefD1Ev *INTERNAL* " demangled="b2BodyDef::~b2BodyDef()" location="f21:52" file="f21" line="52" endline="52" inline="1">
  </Destructor>
  <OperatorMethod id="_2373" name="=" returns="_4311" artificial="1" throw="" context="_660" access="public" mangled="_ZN9b2BodyDefaSERKS_" demangled="b2BodyDef::operator=(b2BodyDef const&amp;)" location="f21:52" file="f21" line="52" endline="52" inline="1">
    <Argument type="_4312" location="f21:52" file="f21" line="52"/>
  </OperatorMethod>
  <Constructor id="_2374" name="b2BodyDef" artificial="1" throw="" context="_660" access="public" mangled="_ZN9b2BodyDefC1ERKS_ *INTERNAL* " demangled="b2BodyDef::b2BodyDef(b2BodyDef const&amp;)" location="f21:52" file="f21" line="52" endline="52" inline="1">
    <Argument type="_4312" location="f21:52" file="f21" line="52"/>
  </Constructor>
  <Constructor id="_2375" name="b2BodyDef" explicit="1" context="_660" access="public" mangled="_ZN9b2BodyDefC1Ev *INTERNAL* " demangled="b2BodyDef::b2BodyDef()" location="f21:54" file="f21" line="54" endline="69" inline="1"/>
  <Field id="_2376" name="m_type" type="_2378" offset="32" context="_674" access="public" location="f51:94" file="f51" line="94"/>
  <Field id="_2377" name="m_radius" type="_179" offset="64" context="_674" access="public" location="f51:95" file="f51" line="95"/>
  <Enumeration id="_2378" name="Type" context="_674" access="public" location="f51:46" file="f51" line="46" artificial="1" size="32" align="32">
    <EnumValue name="e_unknown" init="-1"/>
    <EnumValue name="e_circle" init="0"/>
    <EnumValue name="e_edge" init="1"/>
    <EnumValue name="e_polygon" init="2"/>
    <EnumValue name="e_loop" init="3"/>
    <EnumValue name="e_typeCount" init="4"/>
  </Enumeration>
  <OperatorMethod id="_2379" name="=" returns="_4313" artificial="1" throw="" context="_674" access="public" mangled="_ZN7b2ShapeaSERKS_" demangled="b2Shape::operator=(b2Shape const&amp;)" location="f51:43" file="f51" line="43" endline="43" inline="1">
    <Argument type="_4314" location="f51:43" file="f51" line="43"/>
  </OperatorMethod>
  <Constructor id="_2380" name="b2Shape" artificial="1" throw="" context="_674" access="public" mangled="_ZN7b2ShapeC1ERKS_ *INTERNAL* " demangled="b2Shape::b2Shape(b2Shape const&amp;)" location="f51:43" file="f51" line="43" endline="43" inline="1">
    <Argument type="_4314" location="f51:43" file="f51" line="43"/>
  </Constructor>
  <Constructor id="_2381" name="b2Shape" explicit="1" context="_674" access="public" mangled="_ZN7b2ShapeC1Ev *INTERNAL* " demangled="b2Shape::b2Shape()" location="f51:56" file="f51" line="56" endline="56" inline="1"/>
  <Destructor id="_2382" name="b2Shape" virtual="1" overrides="" context="_674" access="public" mangled="_ZN7b2ShapeD1Ev *INTERNAL* " demangled="b2Shape::~b2Shape()" location="f51:57" file="f51" line="57" endline="57" inline="1">
  </Destructor>
  <Method id="_2383" name="Clone" returns="_4021" const="1" virtual="1" pure_virtual="1" overrides="" context="_674" access="public" mangled="_ZNK7b2Shape5CloneEP16b2BlockAllocator" demangled="b2Shape::Clone(b2BlockAllocator*) const" location="f51:60" file="f51" line="60" extern="1">
    <Argument name="allocator" type="_2226" location="f51:60" file="f51" line="60"/>
  </Method>
  <Method id="_2384" name="GetType" returns="_2378" const="1" context="_674" access="public" mangled="_ZNK7b2Shape7GetTypeEv" demangled="b2Shape::GetType() const" location="f51:98" file="f51" line="98" endline="100" inline="1"/>
  <Method id="_2385" name="GetChildCount" returns="_114" const="1" virtual="1" pure_virtual="1" overrides="" context="_674" access="public" mangled="_ZNK7b2Shape13GetChildCountEv" demangled="b2Shape::GetChildCount() const" location="f51:67" file="f51" line="67" extern="1"/>
  <Method id="_2386" name="TestPoint" returns="_1355" const="1" virtual="1" pure_virtual="1" overrides="" context="_674" access="public" mangled="_ZNK7b2Shape9TestPointERK11b2TransformRK6b2Vec2" demangled="b2Shape::TestPoint(b2Transform const&amp;, b2Vec2 const&amp;) const" location="f51:72" file="f51" line="72" extern="1">
    <Argument name="xf" type="_1854" location="f51:72" file="f51" line="72"/>
    <Argument name="p" type="_1469" location="f51:72" file="f51" line="72"/>
  </Method>
  <Method id="_2387" name="RayCast" returns="_1355" const="1" virtual="1" pure_virtual="1" overrides="" context="_674" access="public" mangled="_ZNK7b2Shape7RayCastEP15b2RayCastOutputRK14b2RayCastInputRK11b2Transformi" demangled="b2Shape::RayCast(b2RayCastOutput*, b2RayCastInput const&amp;, b2Transform const&amp;, int) const" location="f51:80" file="f51" line="80" extern="1">
    <Argument name="output" type="_4022" location="f51:80" file="f51" line="80"/>
    <Argument name="input" type="_4023" location="f51:80" file="f51" line="80"/>
    <Argument name="transform" type="_1854" location="f51:80" file="f51" line="80"/>
    <Argument name="childIndex" type="_114" location="f51:80" file="f51" line="80"/>
  </Method>
  <Method id="_2388" name="ComputeAABB" returns="_1374" const="1" virtual="1" pure_virtual="1" overrides="" context="_674" access="public" mangled="_ZNK7b2Shape11ComputeAABBEP6b2AABBRK11b2Transformi" demangled="b2Shape::ComputeAABB(b2AABB*, b2Transform const&amp;, int) const" location="f51:86" file="f51" line="86" extern="1">
    <Argument name="aabb" type="_4024" location="f51:86" file="f51" line="86"/>
    <Argument name="xf" type="_1854" location="f51:86" file="f51" line="86"/>
    <Argument name="childIndex" type="_114" location="f51:86" file="f51" line="86"/>
  </Method>
  <Method id="_2389" name="ComputeMass" returns="_1374" const="1" virtual="1" pure_virtual="1" overrides="" context="_674" access="public" mangled="_ZNK7b2Shape11ComputeMassEP10b2MassDataf" demangled="b2Shape::ComputeMass(b2MassData*, float) const" location="f51:92" file="f51" line="92" extern="1">
    <Argument name="massData" type="_4025" location="f51:92" file="f51" line="92"/>
    <Argument name="density" type="_179" location="f51:92" file="f51" line="92"/>
  </Method>
  <Field id="_2390" name="m_blockAllocator" type="_976" offset="0" context="_684" access="private" location="f53:217" file="f53" line="217"/>
  <Field id="_2391" name="m_stackAllocator" type="_856" offset="544" context="_684" access="private" location="f53:218" file="f53" line="218"/>
  <Field id="_2392" name="m_flags" type="_114" offset="822944" context="_684" access="private" location="f53:220" file="f53" line="220"/>
  <Field id="_2393" name="m_contactManager" type="_254" offset="822976" context="_684" access="private" location="f53:222" file="f53" line="222"/>
  <Field id="_2394" name="m_bodyList" type="_3999" offset="823616" context="_684" access="private" location="f53:224" file="f53" line="224"/>
  <Field id="_2395" name="m_jointList" type="_3986" offset="823648" context="_684" access="private" location="f53:225" file="f53" line="225"/>
  <Field id="_2396" name="m_bodyCount" type="_114" offset="823680" context="_684" access="private" location="f53:227" file="f53" line="227"/>
  <Field id="_2397" name="m_jointCount" type="_114" offset="823712" context="_684" access="private" location="f53:228" file="f53" line="228"/>
  <Field id="_2398" name="m_gravity" type="_226" offset="823744" context="_684" access="private" location="f53:230" file="f53" line="230"/>
  <Field id="_2399" name="m_allowSleep" type="_1355" offset="823808" context="_684" access="private" location="f53:231" file="f53" line="231"/>
  <Field id="_2400" name="m_destructionListener" type="_4315" offset="823840" context="_684" access="private" location="f53:233" file="f53" line="233"/>
  <Field id="_2401" name="m_debugDraw" type="_4316" offset="823872" context="_684" access="private" location="f53:234" file="f53" line="234"/>
  <Field id="_2402" name="m_inv_dt0" type="_179" offset="823904" context="_684" access="private" location="f53:238" file="f53" line="238"/>
  <Field id="_2403" name="m_warmStarting" type="_1355" offset="823936" context="_684" access="private" location="f53:241" file="f53" line="241"/>
  <Field id="_2404" name="m_continuousPhysics" type="_1355" offset="823944" context="_684" access="private" location="f53:242" file="f53" line="242"/>
  <Field id="_2405" name="m_subStepping" type="_1355" offset="823952" context="_684" access="private" location="f53:243" file="f53" line="243"/>
  <Field id="_2406" name="m_stepComplete" type="_1355" offset="823960" context="_684" access="private" location="f53:245" file="f53" line="245"/>
  <Field id="_2407" name="m_profile" type="_468" offset="823968" context="_684" access="private" location="f53:247" file="f53" line="247"/>
  <Enumeration id="_2408" name="._69" context="_684" access="private" location="f53:199" file="f53" line="199" artificial="1" size="32" align="32">
    <EnumValue name="e_newFixture" init="1"/>
    <EnumValue name="e_locked" init="2"/>
    <EnumValue name="e_clearForces" init="4"/>
  </Enumeration>
  <OperatorMethod id="_2409" name="=" returns="_4317" artificial="1" throw="" context="_684" access="public" mangled="_ZN7b2WorldaSERKS_" demangled="b2World::operator=(b2World const&amp;)" location="f53:42" file="f53" line="42" endline="42" inline="1">
    <Argument type="_4318" location="f53:42" file="f53" line="42"/>
  </OperatorMethod>
  <Constructor id="_2410" name="b2World" artificial="1" throw="" context="_684" access="public" mangled="_ZN7b2WorldC1ERKS_ *INTERNAL* " demangled="b2World::b2World(b2World const&amp;)" location="f53:42" file="f53" line="42" endline="42" inline="1">
    <Argument type="_4318" location="f53:42" file="f53" line="42"/>
  </Constructor>
  <Constructor id="_2411" name="b2World" explicit="1" context="_684" access="public" mangled="_ZN7b2WorldC1ERK6b2Vec2b *INTERNAL* " demangled="b2World::b2World(b2Vec2 const&amp;, bool)" location="f53:47" file="f53" line="47" extern="1">
    <Argument name="gravity" type="_1469" location="f53:47" file="f53" line="47"/>
    <Argument name="doSleep" type="_1355" location="f53:47" file="f53" line="47"/>
  </Constructor>
  <Destructor id="_2412" name="b2World" context="_684" access="public" mangled="_ZN7b2WorldD1Ev *INTERNAL* " demangled="b2World::~b2World()" location="f53:50" file="f53" line="50" extern="1">
  </Destructor>
  <Method id="_2413" name="SetDestructionListener" returns="_1374" context="_684" access="public" mangled="_ZN7b2World22SetDestructionListenerEP21b2DestructionListener" demangled="b2World::SetDestructionListener(b2DestructionListener*)" location="f53:54" file="f53" line="54" extern="1">
    <Argument name="listener" type="_4315" location="f53:54" file="f53" line="54"/>
  </Method>
  <Method id="_2414" name="SetContactFilter" returns="_1374" context="_684" access="public" mangled="_ZN7b2World16SetContactFilterEP15b2ContactFilter" demangled="b2World::SetContactFilter(b2ContactFilter*)" location="f53:59" file="f53" line="59" extern="1">
    <Argument name="filter" type="_4195" location="f53:59" file="f53" line="59"/>
  </Method>
  <Method id="_2415" name="SetContactListener" returns="_1374" context="_684" access="public" mangled="_ZN7b2World18SetContactListenerEP17b2ContactListener" demangled="b2World::SetContactListener(b2ContactListener*)" location="f53:63" file="f53" line="63" extern="1">
    <Argument name="listener" type="_3998" location="f53:63" file="f53" line="63"/>
  </Method>
  <Method id="_2416" name="SetDebugDraw" returns="_1374" context="_684" access="public" mangled="_ZN7b2World12SetDebugDrawEP6b2Draw" demangled="b2World::SetDebugDraw(b2Draw*)" location="f53:68" file="f53" line="68" extern="1">
    <Argument name="debugDraw" type="_4316" location="f53:68" file="f53" line="68"/>
  </Method>
  <Method id="_2417" name="CreateBody" returns="_3999" context="_684" access="public" mangled="_ZN7b2World10CreateBodyEPK9b2BodyDef" demangled="b2World::CreateBody(b2BodyDef const*)" location="f53:73" file="f53" line="73" extern="1">
    <Argument name="def" type="_4319" location="f53:73" file="f53" line="73"/>
  </Method>
  <Method id="_2418" name="DestroyBody" returns="_1374" context="_684" access="public" mangled="_ZN7b2World11DestroyBodyEP6b2Body" demangled="b2World::DestroyBody(b2Body*)" location="f53:79" file="f53" line="79" extern="1">
    <Argument name="body" type="_3999" location="f53:79" file="f53" line="79"/>
  </Method>
  <Method id="_2419" name="CreateJoint" returns="_3986" context="_684" access="public" mangled="_ZN7b2World11CreateJointEPK10b2JointDef" demangled="b2World::CreateJoint(b2JointDef const*)" location="f53:84" file="f53" line="84" extern="1">
    <Argument name="def" type="_4320" location="f53:84" file="f53" line="84"/>
  </Method>
  <Method id="_2420" name="DestroyJoint" returns="_1374" context="_684" access="public" mangled="_ZN7b2World12DestroyJointEP7b2Joint" demangled="b2World::DestroyJoint(b2Joint*)" location="f53:88" file="f53" line="88" extern="1">
    <Argument name="joint" type="_3986" location="f53:88" file="f53" line="88"/>
  </Method>
  <Method id="_2421" name="Step" returns="_1374" context="_684" access="public" mangled="_ZN7b2World4StepEfii" demangled="b2World::Step(float, int, int)" location="f53:97" file="f53" line="97" extern="1">
    <Argument name="timeStep" type="_179" location="f53:97" file="f53" line="97"/>
    <Argument name="velocityIterations" type="_114" location="f53:97" file="f53" line="97"/>
    <Argument name="positionIterations" type="_114" location="f53:97" file="f53" line="97"/>
  </Method>
  <Method id="_2422" name="ClearForces" returns="_1374" context="_684" access="public" mangled="_ZN7b2World11ClearForcesEv" demangled="b2World::ClearForces()" location="f53:106" file="f53" line="106" extern="1"/>
  <Method id="_2423" name="DrawDebugData" returns="_1374" context="_684" access="public" mangled="_ZN7b2World13DrawDebugDataEv" demangled="b2World::DrawDebugData()" location="f53:109" file="f53" line="109" extern="1"/>
  <Method id="_2424" name="QueryAABB" returns="_1374" const="1" context="_684" access="public" mangled="_ZNK7b2World9QueryAABBEP15b2QueryCallbackRK6b2AABB" demangled="b2World::QueryAABB(b2QueryCallback*, b2AABB const&amp;) const" location="f53:115" file="f53" line="115" extern="1">
    <Argument name="callback" type="_4321" location="f53:115" file="f53" line="115"/>
    <Argument name="aabb" type="_2110" location="f53:115" file="f53" line="115"/>
  </Method>
  <Method id="_2425" name="RayCast" returns="_1374" const="1" context="_684" access="public" mangled="_ZNK7b2World7RayCastEP17b2RayCastCallbackRK6b2Vec2S4_" demangled="b2World::RayCast(b2RayCastCallback*, b2Vec2 const&amp;, b2Vec2 const&amp;) const" location="f53:123" file="f53" line="123" extern="1">
    <Argument name="callback" type="_4322" location="f53:123" file="f53" line="123"/>
    <Argument name="point1" type="_1469" location="f53:123" file="f53" line="123"/>
    <Argument name="point2" type="_1469" location="f53:123" file="f53" line="123"/>
  </Method>
  <Method id="_2426" name="GetBodyList" returns="_3999" context="_684" access="public" mangled="_ZN7b2World11GetBodyListEv" demangled="b2World::GetBodyList()" location="f53:250" file="f53" line="250" endline="252" inline="1"/>
  <Method id="_2427" name="GetBodyList" returns="_4192" const="1" context="_684" access="public" mangled="_ZNK7b2World11GetBodyListEv" demangled="b2World::GetBodyList() const" location="f53:255" file="f53" line="255" endline="257" inline="1"/>
  <Method id="_2428" name="GetJointList" returns="_3986" context="_684" access="public" mangled="_ZN7b2World12GetJointListEv" demangled="b2World::GetJointList()" location="f53:260" file="f53" line="260" endline="262" inline="1"/>
  <Method id="_2429" name="GetJointList" returns="_4323" const="1" context="_684" access="public" mangled="_ZNK7b2World12GetJointListEv" demangled="b2World::GetJointList() const" location="f53:265" file="f53" line="265" endline="267" inline="1"/>
  <Method id="_2430" name="GetContactList" returns="_2224" context="_684" access="public" mangled="_ZN7b2World14GetContactListEv" demangled="b2World::GetContactList()" location="f53:270" file="f53" line="270" endline="272" inline="1"/>
  <Method id="_2431" name="GetContactList" returns="_3994" const="1" context="_684" access="public" mangled="_ZNK7b2World14GetContactListEv" demangled="b2World::GetContactList() const" location="f53:275" file="f53" line="275" endline="277" inline="1"/>
  <Method id="_2432" name="SetWarmStarting" returns="_1374" context="_684" access="public" mangled="_ZN7b2World15SetWarmStartingEb" demangled="b2World::SetWarmStarting(bool)" location="f53:145" file="f53" line="145" endline="145" inline="1">
    <Argument name="flag" type="_1355" location="f53:145" file="f53" line="145"/>
  </Method>
  <Method id="_2433" name="SetContinuousPhysics" returns="_1374" context="_684" access="public" mangled="_ZN7b2World20SetContinuousPhysicsEb" demangled="b2World::SetContinuousPhysics(bool)" location="f53:148" file="f53" line="148" endline="148" inline="1">
    <Argument name="flag" type="_1355" location="f53:148" file="f53" line="148"/>
  </Method>
  <Method id="_2434" name="SetSubStepping" returns="_1374" context="_684" access="public" mangled="_ZN7b2World14SetSubSteppingEb" demangled="b2World::SetSubStepping(bool)" location="f53:151" file="f53" line="151" endline="151" inline="1">
    <Argument name="flag" type="_1355" location="f53:151" file="f53" line="151"/>
  </Method>
  <Method id="_2435" name="GetProxyCount" returns="_114" const="1" context="_684" access="public" mangled="_ZNK7b2World13GetProxyCountEv" demangled="b2World::GetProxyCount() const" location="f53:154" file="f53" line="154" extern="1"/>
  <Method id="_2436" name="GetBodyCount" returns="_114" const="1" context="_684" access="public" mangled="_ZNK7b2World12GetBodyCountEv" demangled="b2World::GetBodyCount() const" location="f53:280" file="f53" line="280" endline="282" inline="1"/>
  <Method id="_2437" name="GetJointCount" returns="_114" const="1" context="_684" access="public" mangled="_ZNK7b2World13GetJointCountEv" demangled="b2World::GetJointCount() const" location="f53:285" file="f53" line="285" endline="287" inline="1"/>
  <Method id="_2438" name="GetContactCount" returns="_114" const="1" context="_684" access="public" mangled="_ZNK7b2World15GetContactCountEv" demangled="b2World::GetContactCount() const" location="f53:290" file="f53" line="290" endline="292" inline="1"/>
  <Method id="_2439" name="GetTreeHeight" returns="_114" const="1" context="_684" access="public" mangled="_ZNK7b2World13GetTreeHeightEv" demangled="b2World::GetTreeHeight() const" location="f53:166" file="f53" line="166" extern="1"/>
  <Method id="_2440" name="GetTreeBalance" returns="_114" const="1" context="_684" access="public" mangled="_ZNK7b2World14GetTreeBalanceEv" demangled="b2World::GetTreeBalance() const" location="f53:169" file="f53" line="169" extern="1"/>
  <Method id="_2441" name="GetTreeQuality" returns="_179" const="1" context="_684" access="public" mangled="_ZNK7b2World14GetTreeQualityEv" demangled="b2World::GetTreeQuality() const" location="f53:173" file="f53" line="173" extern="1"/>
  <Method id="_2442" name="SetGravity" returns="_1374" context="_684" access="public" mangled="_ZN7b2World10SetGravityERK6b2Vec2" demangled="b2World::SetGravity(b2Vec2 const&amp;)" location="f53:295" file="f53" line="295" endline="297" inline="1">
    <Argument name="gravity" type="_1469" location="f53:295" file="f53" line="295"/>
  </Method>
  <Method id="_2443" name="GetGravity" returns="_226" const="1" context="_684" access="public" mangled="_ZNK7b2World10GetGravityEv" demangled="b2World::GetGravity() const" location="f53:300" file="f53" line="300" endline="302" inline="1"/>
  <Method id="_2444" name="IsLocked" returns="_1355" const="1" context="_684" access="public" mangled="_ZNK7b2World8IsLockedEv" demangled="b2World::IsLocked() const" location="f53:305" file="f53" line="305" endline="307" inline="1"/>
  <Method id="_2445" name="SetAutoClearForces" returns="_1374" context="_684" access="public" mangled="_ZN7b2World18SetAutoClearForcesEb" demangled="b2World::SetAutoClearForces(bool)" location="f53:310" file="f53" line="310" endline="312" inline="1">
    <Argument name="flag" type="_1355" location="f53:310" file="f53" line="310"/>
  </Method>
  <Method id="_2446" name="GetAutoClearForces" returns="_1355" const="1" context="_684" access="public" mangled="_ZNK7b2World18GetAutoClearForcesEv" demangled="b2World::GetAutoClearForces() const" location="f53:323" file="f53" line="323" endline="325" inline="1"/>
  <Method id="_2447" name="GetContactManager" returns="_4197" const="1" context="_684" access="public" mangled="_ZNK7b2World17GetContactManagerEv" demangled="b2World::GetContactManager() const" location="f53:328" file="f53" line="328" endline="330" inline="1"/>
  <Method id="_2448" name="GetProfile" returns="_4273" const="1" context="_684" access="public" mangled="_ZNK7b2World10GetProfileEv" demangled="b2World::GetProfile() const" location="f53:333" file="f53" line="333" endline="335" inline="1"/>
  <Method id="_2449" name="Solve" returns="_1374" context="_684" access="private" mangled="_ZN7b2World5SolveERK10b2TimeStep" demangled="b2World::Solve(b2TimeStep const&amp;)" location="f53:211" file="f53" line="211" extern="1">
    <Argument name="step" type="_4035" location="f53:211" file="f53" line="211"/>
  </Method>
  <Method id="_2450" name="SolveTOI" returns="_1374" context="_684" access="private" mangled="_ZN7b2World8SolveTOIERK10b2TimeStep" demangled="b2World::SolveTOI(b2TimeStep const&amp;)" location="f53:212" file="f53" line="212" extern="1">
    <Argument name="step" type="_4035" location="f53:212" file="f53" line="212"/>
  </Method>
  <Method id="_2451" name="DrawJoint" returns="_1374" context="_684" access="private" mangled="_ZN7b2World9DrawJointEP7b2Joint" demangled="b2World::DrawJoint(b2Joint*)" location="f53:214" file="f53" line="214" extern="1">
    <Argument name="joint" type="_3986" location="f53:214" file="f53" line="214"/>
  </Method>
  <Method id="_2452" name="DrawShape" returns="_1374" context="_684" access="private" mangled="_ZN7b2World9DrawShapeEP9b2FixtureRK11b2TransformRK7b2Color" demangled="b2World::DrawShape(b2Fixture*, b2Transform const&amp;, b2Color const&amp;)" location="f53:215" file="f53" line="215" extern="1">
    <Argument name="shape" type="_2225" location="f53:215" file="f53" line="215"/>
    <Argument name="xf" type="_1854" location="f53:215" file="f53" line="215"/>
    <Argument name="color" type="_4247" location="f53:215" file="f53" line="215"/>
  </Method>
  <Field id="_2454" name="aabb" type="_795" offset="0" context="_692" access="public" location="f46:36" file="f46" line="36"/>
  <Field id="_2455" name="userData" type="_688" offset="128" context="_692" access="public" location="f46:38" file="f46" line="38"/>
  <Field id="_2456" name="" type="_2460" offset="160" context="_692" access="public" location="f46:44" file="f46" line="44"/>
  <Field id="_2457" name="child1" type="_114" offset="192" context="_692" access="public" location="f46:46" file="f46" line="46"/>
  <Field id="_2458" name="child2" type="_114" offset="224" context="_692" access="public" location="f46:47" file="f46" line="47"/>
  <Field id="_2459" name="height" type="_114" offset="256" context="_692" access="public" location="f46:50" file="f46" line="50"/>
  <Union id="_2460" context="_692" access="public" mangled="N10b2TreeNode4._44E" demangled="b2TreeNode::._44" location="f46:41" file="f46" line="41" artificial="1" size="32" align="32" members="_4324 _4325 " bases=""/>
  <Destructor id="_2461" name="b2TreeNode" artificial="1" throw="" context="_692" access="public" mangled="_ZN10b2TreeNodeD1Ev *INTERNAL* " demangled="b2TreeNode::~b2TreeNode()" location="f46:29" file="f46" line="29" endline="29" inline="1">
  </Destructor>
  <OperatorMethod id="_2462" name="=" returns="_4326" artificial="1" throw="" context="_692" access="public" mangled="_ZN10b2TreeNodeaSERKS_" demangled="b2TreeNode::operator=(b2TreeNode const&amp;)" location="f46:29" file="f46" line="29" endline="29" inline="1">
    <Argument type="_4327" location="f46:29" file="f46" line="29"/>
  </OperatorMethod>
  <Constructor id="_2463" name="b2TreeNode" artificial="1" throw="" context="_692" access="public" mangled="_ZN10b2TreeNodeC1ERKS_ *INTERNAL* " demangled="b2TreeNode::b2TreeNode(b2TreeNode const&amp;)" location="f46:29" file="f46" line="29" endline="29" inline="1">
    <Argument type="_4327" location="f46:29" file="f46" line="29"/>
  </Constructor>
  <Constructor id="_2464" name="b2TreeNode" artificial="1" context="_692" access="public" mangled="_ZN10b2TreeNodeC1Ev *INTERNAL* " demangled="b2TreeNode::b2TreeNode()" location="f46:29" file="f46" line="29" endline="29" inline="1"/>
  <Method id="_2465" name="IsLeaf" returns="_1355" const="1" context="_692" access="public" mangled="_ZNK10b2TreeNode6IsLeafEv" demangled="b2TreeNode::IsLeaf() const" location="f46:30" file="f46" line="30" endline="32" inline="1"/>
  <Field id="_2466" name="proxyA" type="_474" offset="0" context="_727" access="public" location="f49:70" file="f49" line="70"/>
  <Field id="_2467" name="proxyB" type="_474" offset="224" context="_727" access="public" location="f49:71" file="f49" line="71"/>
  <Field id="_2468" name="transformA" type="_462" offset="448" context="_727" access="public" location="f49:72" file="f49" line="72"/>
  <Field id="_2469" name="transformB" type="_462" offset="576" context="_727" access="public" location="f49:73" file="f49" line="73"/>
  <Field id="_2470" name="useRadii" type="_1355" offset="704" context="_727" access="public" location="f49:74" file="f49" line="74"/>
  <Destructor id="_2471" name="b2DistanceInput" artificial="1" throw="" context="_727" access="public" mangled="_ZN15b2DistanceInputD1Ev *INTERNAL* " demangled="b2DistanceInput::~b2DistanceInput()" location="f49:69" file="f49" line="69" endline="69" inline="1">
  </Destructor>
  <OperatorMethod id="_2472" name="=" returns="_4328" artificial="1" throw="" context="_727" access="public" mangled="_ZN15b2DistanceInputaSERKS_" demangled="b2DistanceInput::operator=(b2DistanceInput const&amp;)" location="f49:69" file="f49" line="69" endline="69" inline="1">
    <Argument type="_4329" location="f49:69" file="f49" line="69"/>
  </OperatorMethod>
  <Constructor id="_2473" name="b2DistanceInput" artificial="1" throw="" context="_727" access="public" mangled="_ZN15b2DistanceInputC1ERKS_ *INTERNAL* " demangled="b2DistanceInput::b2DistanceInput(b2DistanceInput const&amp;)" location="f49:69" file="f49" line="69" endline="69" inline="1">
    <Argument type="_4329" location="f49:69" file="f49" line="69"/>
  </Constructor>
  <Constructor id="_2474" name="b2DistanceInput" artificial="1" context="_727" access="public" mangled="_ZN15b2DistanceInputC1Ev *INTERNAL* " demangled="b2DistanceInput::b2DistanceInput()" location="f49:69" file="f49" line="69" endline="69" inline="1"/>
  <Field id="_2475" name="m_count" type="_114" offset="0" context="_731" access="private" location="f48:98" file="f48" line="98"/>
  <Field id="_2476" name="m_ps" type="_4214" offset="32" context="_731" access="private" location="f48:99" file="f48" line="99"/>
  <Field id="_2477" name="m_p0s" type="_4214" offset="64" context="_731" access="private" location="f48:100" file="f48" line="100"/>
  <Field id="_2478" name="m_vs" type="_4214" offset="96" context="_731" access="private" location="f48:101" file="f48" line="101"/>
  <Field id="_2479" name="m_ims" type="_4268" offset="128" context="_731" access="private" location="f48:103" file="f48" line="103"/>
  <Field id="_2480" name="m_Ls" type="_4268" offset="160" context="_731" access="private" location="f48:105" file="f48" line="105"/>
  <Field id="_2481" name="m_as" type="_4268" offset="192" context="_731" access="private" location="f48:106" file="f48" line="106"/>
  <Field id="_2482" name="m_gravity" type="_226" offset="224" context="_731" access="private" location="f48:108" file="f48" line="108"/>
  <Field id="_2483" name="m_damping" type="_179" offset="288" context="_731" access="private" location="f48:109" file="f48" line="109"/>
  <Field id="_2484" name="m_k2" type="_179" offset="320" context="_731" access="private" location="f48:111" file="f48" line="111"/>
  <Field id="_2485" name="m_k3" type="_179" offset="352" context="_731" access="private" location="f48:112" file="f48" line="112"/>
  <OperatorMethod id="_2486" name="=" returns="_4330" artificial="1" throw="" context="_731" access="public" mangled="_ZN6b2RopeaSERKS_" demangled="b2Rope::operator=(b2Rope const&amp;)" location="f48:64" file="f48" line="64" endline="64" inline="1">
    <Argument type="_4331" location="f48:64" file="f48" line="64"/>
  </OperatorMethod>
  <Constructor id="_2487" name="b2Rope" artificial="1" throw="" context="_731" access="public" mangled="_ZN6b2RopeC1ERKS_ *INTERNAL* " demangled="b2Rope::b2Rope(b2Rope const&amp;)" location="f48:64" file="f48" line="64" endline="64" inline="1">
    <Argument type="_4331" location="f48:64" file="f48" line="64"/>
  </Constructor>
  <Constructor id="_2488" name="b2Rope" explicit="1" context="_731" access="public" mangled="_ZN6b2RopeC1Ev *INTERNAL* " demangled="b2Rope::b2Rope()" location="f48:66" file="f48" line="66" extern="1"/>
  <Destructor id="_2489" name="b2Rope" context="_731" access="public" mangled="_ZN6b2RopeD1Ev *INTERNAL* " demangled="b2Rope::~b2Rope()" location="f48:67" file="f48" line="67" extern="1">
  </Destructor>
  <Method id="_2490" name="Initialize" returns="_1374" context="_731" access="public" mangled="_ZN6b2Rope10InitializeEPK9b2RopeDef" demangled="b2Rope::Initialize(b2RopeDef const*)" location="f48:70" file="f48" line="70" extern="1">
    <Argument name="def" type="_4332" location="f48:70" file="f48" line="70"/>
  </Method>
  <Method id="_2491" name="Step" returns="_1374" context="_731" access="public" mangled="_ZN6b2Rope4StepEfi" demangled="b2Rope::Step(float, int)" location="f48:73" file="f48" line="73" extern="1">
    <Argument name="timeStep" type="_179" location="f48:73" file="f48" line="73"/>
    <Argument name="iterations" type="_114" location="f48:73" file="f48" line="73"/>
  </Method>
  <Method id="_2492" name="GetVertexCount" returns="_114" const="1" context="_731" access="public" mangled="_ZNK6b2Rope14GetVertexCountEv" demangled="b2Rope::GetVertexCount() const" location="f48:76" file="f48" line="76" endline="78" inline="1"/>
  <Method id="_2493" name="GetVertices" returns="_4217" const="1" context="_731" access="public" mangled="_ZNK6b2Rope11GetVerticesEv" demangled="b2Rope::GetVertices() const" location="f48:82" file="f48" line="82" endline="84" inline="1"/>
  <Method id="_2494" name="Draw" returns="_1374" const="1" context="_731" access="public" mangled="_ZNK6b2Rope4DrawEP6b2Draw" demangled="b2Rope::Draw(b2Draw*) const" location="f48:88" file="f48" line="88" extern="1">
    <Argument name="draw" type="_4316" location="f48:88" file="f48" line="88"/>
  </Method>
  <Method id="_2495" name="SetAngle" returns="_1374" context="_731" access="public" mangled="_ZN6b2Rope8SetAngleEf" demangled="b2Rope::SetAngle(float)" location="f48:91" file="f48" line="91" extern="1">
    <Argument name="angle" type="_179" location="f48:91" file="f48" line="91"/>
  </Method>
  <Method id="_2496" name="SolveC2" returns="_1374" context="_731" access="private" mangled="_ZN6b2Rope7SolveC2Ev" demangled="b2Rope::SolveC2()" location="f48:95" file="f48" line="95" extern="1"/>
  <Method id="_2497" name="SolveC3" returns="_1374" context="_731" access="private" mangled="_ZN6b2Rope7SolveC3Ev" demangled="b2Rope::SolveC3()" location="f48:96" file="f48" line="96" extern="1"/>
  <PointerType id="_2498" type="_354c" size="32" align="32"/>
  <PointerType id="_2499" type="_4334" size="32" align="32"/>
  <Field id="_2500" name="other" type="_3999" offset="0" context="_769" access="public" location="f4:68" file="f4" line="68"/>
  <Field id="_2501" name="contact" type="_2224" offset="32" context="_769" access="public" location="f4:69" file="f4" line="69"/>
  <Field id="_2502" name="prev" type="_4335" offset="64" context="_769" access="public" location="f4:70" file="f4" line="70"/>
  <Field id="_2503" name="next" type="_4335" offset="96" context="_769" access="public" location="f4:71" file="f4" line="71"/>
  <Destructor id="_2504" name="b2ContactEdge" artificial="1" throw="" context="_769" access="public" mangled="_ZN13b2ContactEdgeD1Ev *INTERNAL* " demangled="b2ContactEdge::~b2ContactEdge()" location="f4:67" file="f4" line="67" endline="67" inline="1">
  </Destructor>
  <OperatorMethod id="_2505" name="=" returns="_4336" artificial="1" throw="" context="_769" access="public" mangled="_ZN13b2ContactEdgeaSERKS_" demangled="b2ContactEdge::operator=(b2ContactEdge const&amp;)" location="f4:67" file="f4" line="67" endline="67" inline="1">
    <Argument type="_4337" location="f4:67" file="f4" line="67"/>
  </OperatorMethod>
  <Constructor id="_2506" name="b2ContactEdge" artificial="1" throw="" context="_769" access="public" mangled="_ZN13b2ContactEdgeC1ERKS_ *INTERNAL* " demangled="b2ContactEdge::b2ContactEdge(b2ContactEdge const&amp;)" location="f4:67" file="f4" line="67" endline="67" inline="1">
    <Argument type="_4337" location="f4:67" file="f4" line="67"/>
  </Constructor>
  <Constructor id="_2507" name="b2ContactEdge" artificial="1" throw="" context="_769" access="public" mangled="_ZN13b2ContactEdgeC1Ev *INTERNAL* " demangled="b2ContactEdge::b2ContactEdge()" location="f4:67" file="f4" line="67" inline="1"/>
  <Field id="_2508" name="linear" type="_226" offset="0" context="_787" access="public" location="f31:54" file="f31" line="54"/>
  <Field id="_2509" name="angularA" type="_179" offset="64" context="_787" access="public" location="f31:55" file="f31" line="55"/>
  <Field id="_2510" name="angularB" type="_179" offset="96" context="_787" access="public" location="f31:56" file="f31" line="56"/>
  <Destructor id="_2511" name="b2Jacobian" artificial="1" throw="" context="_787" access="public" mangled="_ZN10b2JacobianD1Ev *INTERNAL* " demangled="b2Jacobian::~b2Jacobian()" location="f31:53" file="f31" line="53" endline="53" inline="1">
  </Destructor>
  <OperatorMethod id="_2512" name="=" returns="_4338" artificial="1" throw="" context="_787" access="public" mangled="_ZN10b2JacobianaSERKS_" demangled="b2Jacobian::operator=(b2Jacobian const&amp;)" location="f31:53" file="f31" line="53" endline="53" inline="1">
    <Argument type="_4339" location="f31:53" file="f31" line="53"/>
  </OperatorMethod>
  <Constructor id="_2513" name="b2Jacobian" artificial="1" throw="" context="_787" access="public" mangled="_ZN10b2JacobianC1ERKS_ *INTERNAL* " demangled="b2Jacobian::b2Jacobian(b2Jacobian const&amp;)" location="f31:53" file="f31" line="53" endline="53" inline="1">
    <Argument type="_4339" location="f31:53" file="f31" line="53"/>
  </Constructor>
  <Constructor id="_2514" name="b2Jacobian" artificial="1" context="_787" access="public" mangled="_ZN10b2JacobianC1Ev *INTERNAL* " demangled="b2Jacobian::b2Jacobian()" location="f31:53" file="f31" line="53" endline="53" inline="1"/>
  <Field id="_2516" name="lowerBound" type="_226" offset="0" context="_795" access="public" location="f14:213" file="f14" line="213"/>
  <Field id="_2517" name="upperBound" type="_226" offset="64" context="_795" access="public" location="f14:214" file="f14" line="214"/>
  <Destructor id="_2518" name="b2AABB" artificial="1" throw="" context="_795" access="public" mangled="_ZN6b2AABBD1Ev *INTERNAL* " demangled="b2AABB::~b2AABB()" location="f14:162" file="f14" line="162" endline="162" inline="1">
  </Destructor>
  <OperatorMethod id="_2519" name="=" returns="_4340" artificial="1" throw="" context="_795" access="public" mangled="_ZN6b2AABBaSERKS_" demangled="b2AABB::operator=(b2AABB const&amp;)" location="f14:162" file="f14" line="162" endline="162" inline="1">
    <Argument type="_2110" location="f14:162" file="f14" line="162"/>
  </OperatorMethod>
  <Constructor id="_2520" name="b2AABB" artificial="1" throw="" context="_795" access="public" mangled="_ZN6b2AABBC1ERKS_ *INTERNAL* " demangled="b2AABB::b2AABB(b2AABB const&amp;)" location="f14:162" file="f14" line="162" endline="162" inline="1">
    <Argument type="_2110" location="f14:162" file="f14" line="162"/>
  </Constructor>
  <Constructor id="_2521" name="b2AABB" artificial="1" context="_795" access="public" mangled="_ZN6b2AABBC1Ev *INTERNAL* " demangled="b2AABB::b2AABB()" location="f14:162" file="f14" line="162" endline="162" inline="1"/>
  <Method id="_2522" name="IsValid" returns="_1355" const="1" context="_795" access="public" mangled="_ZNK6b2AABB7IsValidEv" demangled="b2AABB::IsValid() const" location="f14:253" file="f14" line="253" endline="258" inline="1"/>
  <Method id="_2523" name="GetCenter" returns="_226" const="1" context="_795" access="public" mangled="_ZNK6b2AABB9GetCenterEv" demangled="b2AABB::GetCenter() const" location="f14:167" file="f14" line="167" endline="169" inline="1"/>
  <Method id="_2524" name="GetExtents" returns="_226" const="1" context="_795" access="public" mangled="_ZNK6b2AABB10GetExtentsEv" demangled="b2AABB::GetExtents() const" location="f14:173" file="f14" line="173" endline="175" inline="1"/>
  <Method id="_2525" name="GetPerimeter" returns="_179" const="1" context="_795" access="public" mangled="_ZNK6b2AABB12GetPerimeterEv" demangled="b2AABB::GetPerimeter() const" location="f14:179" file="f14" line="179" endline="183" inline="1"/>
  <Method id="_2526" name="Combine" returns="_1374" context="_795" access="public" mangled="_ZN6b2AABB7CombineERKS_" demangled="b2AABB::Combine(b2AABB const&amp;)" location="f14:187" file="f14" line="187" endline="190" inline="1">
    <Argument name="aabb" type="_2110" location="f14:187" file="f14" line="187"/>
  </Method>
  <Method id="_2527" name="Combine" returns="_1374" context="_795" access="public" mangled="_ZN6b2AABB7CombineERKS_S1_" demangled="b2AABB::Combine(b2AABB const&amp;, b2AABB const&amp;)" location="f14:194" file="f14" line="194" endline="197" inline="1">
    <Argument name="aabb1" type="_2110" location="f14:194" file="f14" line="194"/>
    <Argument name="aabb2" type="_2110" location="f14:194" file="f14" line="194"/>
  </Method>
  <Method id="_2528" name="Contains" returns="_1355" const="1" context="_795" access="public" mangled="_ZNK6b2AABB8ContainsERKS_" demangled="b2AABB::Contains(b2AABB const&amp;) const" location="f14:201" file="f14" line="201" endline="208" inline="1">
    <Argument name="aabb" type="_2110" location="f14:201" file="f14" line="201"/>
  </Method>
  <Method id="_2529" name="RayCast" returns="_1355" const="1" context="_795" access="public" mangled="_ZNK6b2AABB7RayCastEP15b2RayCastOutputRK14b2RayCastInput" demangled="b2AABB::RayCast(b2RayCastOutput*, b2RayCastInput const&amp;) const" location="f14:211" file="f14" line="211" extern="1">
    <Argument name="output" type="_4022" location="f14:211" file="f14" line="211"/>
    <Argument name="input" type="_4023" location="f14:211" file="f14" line="211"/>
  </Method>
  <Field id="_2530" name="m_start_sec" type="_323" offset="0" context="_796" access="private" location="f55:42" file="f55" line="42"/>
  <Field id="_2531" name="m_start_msec" type="_323" offset="32" context="_796" access="private" location="f55:43" file="f55" line="43"/>
  <Destructor id="_2532" name="b2Timer" artificial="1" throw="" context="_796" access="public" mangled="_ZN7b2TimerD1Ev *INTERNAL* " demangled="b2Timer::~b2Timer()" location="f55:24" file="f55" line="24" endline="24" inline="1">
  </Destructor>
  <OperatorMethod id="_2533" name="=" returns="_4341" artificial="1" throw="" context="_796" access="public" mangled="_ZN7b2TimeraSERKS_" demangled="b2Timer::operator=(b2Timer const&amp;)" location="f55:24" file="f55" line="24" endline="24" inline="1">
    <Argument type="_4342" location="f55:24" file="f55" line="24"/>
  </OperatorMethod>
  <Constructor id="_2534" name="b2Timer" artificial="1" throw="" context="_796" access="public" mangled="_ZN7b2TimerC1ERKS_ *INTERNAL* " demangled="b2Timer::b2Timer(b2Timer const&amp;)" location="f55:24" file="f55" line="24" endline="24" inline="1">
    <Argument type="_4342" location="f55:24" file="f55" line="24"/>
  </Constructor>
  <Constructor id="_2535" name="b2Timer" explicit="1" context="_796" access="public" mangled="_ZN7b2TimerC1Ev *INTERNAL* " demangled="b2Timer::b2Timer()" location="f55:28" file="f55" line="28" extern="1"/>
  <Method id="_2536" name="Reset" returns="_1374" context="_796" access="public" mangled="_ZN7b2Timer5ResetEv" demangled="b2Timer::Reset()" location="f55:31" file="f55" line="31" extern="1"/>
  <Method id="_2537" name="GetMilliseconds" returns="_179" const="1" context="_796" access="public" mangled="_ZNK7b2Timer15GetMillisecondsEv" demangled="b2Timer::GetMilliseconds() const" location="f55:34" file="f55" line="34" extern="1"/>
  <Field id="_2538" name="m_localAnchorA" type="_226" offset="512" context="_809" access="protected" location="f37:86" file="f37" line="86"/>
  <Field id="_2539" name="m_localAnchorB" type="_226" offset="576" context="_809" access="protected" location="f37:87" file="f37" line="87"/>
  <Field id="_2540" name="m_linearImpulse" type="_226" offset="640" context="_809" access="protected" location="f37:90" file="f37" line="90"/>
  <Field id="_2541" name="m_angularImpulse" type="_179" offset="704" context="_809" access="protected" location="f37:91" file="f37" line="91"/>
  <Field id="_2542" name="m_maxForce" type="_179" offset="736" context="_809" access="protected" location="f37:92" file="f37" line="92"/>
  <Field id="_2543" name="m_maxTorque" type="_179" offset="768" context="_809" access="protected" location="f37:93" file="f37" line="93"/>
  <Field id="_2544" name="m_indexA" type="_114" offset="800" context="_809" access="protected" location="f37:96" file="f37" line="96"/>
  <Field id="_2545" name="m_indexB" type="_114" offset="832" context="_809" access="protected" location="f37:97" file="f37" line="97"/>
  <Field id="_2546" name="m_rA" type="_226" offset="864" context="_809" access="protected" location="f37:98" file="f37" line="98"/>
  <Field id="_2547" name="m_rB" type="_226" offset="928" context="_809" access="protected" location="f37:99" file="f37" line="99"/>
  <Field id="_2548" name="m_localCenterA" type="_226" offset="992" context="_809" access="protected" location="f37:100" file="f37" line="100"/>
  <Field id="_2549" name="m_localCenterB" type="_226" offset="1056" context="_809" access="protected" location="f37:101" file="f37" line="101"/>
  <Field id="_2550" name="m_invMassA" type="_179" offset="1120" context="_809" access="protected" location="f37:102" file="f37" line="102"/>
  <Field id="_2551" name="m_invMassB" type="_179" offset="1152" context="_809" access="protected" location="f37:103" file="f37" line="103"/>
  <Field id="_2552" name="m_invIA" type="_179" offset="1184" context="_809" access="protected" location="f37:104" file="f37" line="104"/>
  <Field id="_2553" name="m_invIB" type="_179" offset="1216" context="_809" access="protected" location="f37:105" file="f37" line="105"/>
  <Field id="_2554" name="m_linearMass" type="_43" offset="1248" context="_809" access="protected" location="f37:106" file="f37" line="106"/>
  <Field id="_2555" name="m_angularMass" type="_179" offset="1376" context="_809" access="protected" location="f37:107" file="f37" line="107"/>
  <OperatorMethod id="_2556" name="=" returns="_4343" artificial="1" throw="" context="_809" access="public" mangled="_ZN15b2FrictionJointaSERKS_" demangled="b2FrictionJoint::operator=(b2FrictionJoint const&amp;)" location="f37:56" file="f37" line="56" endline="56" inline="1">
    <Argument type="_4344" location="f37:56" file="f37" line="56"/>
  </OperatorMethod>
  <Constructor id="_2557" name="b2FrictionJoint" artificial="1" throw="" context="_809" access="public" mangled="_ZN15b2FrictionJointC1ERKS_ *INTERNAL* " demangled="b2FrictionJoint::b2FrictionJoint(b2FrictionJoint const&amp;)" location="f37:56" file="f37" line="56" endline="56" inline="1">
    <Argument type="_4344" location="f37:56" file="f37" line="56"/>
  </Constructor>
  <Method id="_2558" name="GetAnchorA" returns="_226" const="1" virtual="1" overrides="_2801 " context="_809" access="public" mangled="_ZNK15b2FrictionJoint10GetAnchorAEv" demangled="b2FrictionJoint::GetAnchorA() const" location="f37:58" file="f37" line="58" extern="1"/>
  <Method id="_2559" name="GetAnchorB" returns="_226" const="1" virtual="1" overrides="_2802 " context="_809" access="public" mangled="_ZNK15b2FrictionJoint10GetAnchorBEv" demangled="b2FrictionJoint::GetAnchorB() const" location="f37:59" file="f37" line="59" extern="1"/>
  <Method id="_2560" name="GetReactionForce" returns="_226" const="1" virtual="1" overrides="_2803 " context="_809" access="public" mangled="_ZNK15b2FrictionJoint16GetReactionForceEf" demangled="b2FrictionJoint::GetReactionForce(float) const" location="f37:61" file="f37" line="61" extern="1">
    <Argument name="inv_dt" type="_179" location="f37:61" file="f37" line="61"/>
  </Method>
  <Method id="_2561" name="GetReactionTorque" returns="_179" const="1" virtual="1" overrides="_2804 " context="_809" access="public" mangled="_ZNK15b2FrictionJoint17GetReactionTorqueEf" demangled="b2FrictionJoint::GetReactionTorque(float) const" location="f37:62" file="f37" line="62" extern="1">
    <Argument name="inv_dt" type="_179" location="f37:62" file="f37" line="62"/>
  </Method>
  <Method id="_2562" name="SetMaxForce" returns="_1374" context="_809" access="public" mangled="_ZN15b2FrictionJoint11SetMaxForceEf" demangled="b2FrictionJoint::SetMaxForce(float)" location="f37:65" file="f37" line="65" extern="1">
    <Argument name="force" type="_179" location="f37:65" file="f37" line="65"/>
  </Method>
  <Method id="_2563" name="GetMaxForce" returns="_179" const="1" context="_809" access="public" mangled="_ZNK15b2FrictionJoint11GetMaxForceEv" demangled="b2FrictionJoint::GetMaxForce() const" location="f37:68" file="f37" line="68" extern="1"/>
  <Method id="_2564" name="SetMaxTorque" returns="_1374" context="_809" access="public" mangled="_ZN15b2FrictionJoint12SetMaxTorqueEf" demangled="b2FrictionJoint::SetMaxTorque(float)" location="f37:71" file="f37" line="71" extern="1">
    <Argument name="torque" type="_179" location="f37:71" file="f37" line="71"/>
  </Method>
  <Method id="_2565" name="GetMaxTorque" returns="_179" const="1" context="_809" access="public" mangled="_ZNK15b2FrictionJoint12GetMaxTorqueEv" demangled="b2FrictionJoint::GetMaxTorque() const" location="f37:74" file="f37" line="74" extern="1"/>
  <Constructor id="_2566" name="b2FrictionJoint" context="_809" access="protected" mangled="_ZN15b2FrictionJointC1EPK18b2FrictionJointDef *INTERNAL* " demangled="b2FrictionJoint::b2FrictionJoint(b2FrictionJointDef const*)" location="f37:80" file="f37" line="80" extern="1">
    <Argument name="def" type="_4345" location="f37:80" file="f37" line="80"/>
  </Constructor>
  <Method id="_2567" name="InitVelocityConstraints" returns="_1374" virtual="1" overrides="_2815 " context="_809" access="protected" mangled="_ZN15b2FrictionJoint23InitVelocityConstraintsERK12b2SolverData" demangled="b2FrictionJoint::InitVelocityConstraints(b2SolverData const&amp;)" location="f37:82" file="f37" line="82" extern="1">
    <Argument name="data" type="_4003" location="f37:82" file="f37" line="82"/>
  </Method>
  <Method id="_2568" name="SolveVelocityConstraints" returns="_1374" virtual="1" overrides="_2816 " context="_809" access="protected" mangled="_ZN15b2FrictionJoint24SolveVelocityConstraintsERK12b2SolverData" demangled="b2FrictionJoint::SolveVelocityConstraints(b2SolverData const&amp;)" location="f37:83" file="f37" line="83" extern="1">
    <Argument name="data" type="_4003" location="f37:83" file="f37" line="83"/>
  </Method>
  <Method id="_2569" name="SolvePositionConstraints" returns="_1355" virtual="1" overrides="_2817 " context="_809" access="protected" mangled="_ZN15b2FrictionJoint24SolvePositionConstraintsERK12b2SolverData" demangled="b2FrictionJoint::SolvePositionConstraints(b2SolverData const&amp;)" location="f37:84" file="f37" line="84" extern="1">
    <Argument name="data" type="_4003" location="f37:84" file="f37" line="84"/>
  </Method>
  <Destructor id="_2570" name="b2FrictionJoint" virtual="1" overrides="_2814 " artificial="1" context="_809" access="public" mangled="_ZN15b2FrictionJointD1Ev *INTERNAL* " demangled="b2FrictionJoint::~b2FrictionJoint()" location="f37:56" file="f37" line="56" endline="56" inline="1">
  </Destructor>
  <Field id="_2571" name="cf" type="_219" offset="0" context="_815" access="public" location="f14:55" file="f14" line="55"/>
  <Field id="_2572" name="key" type="_527" offset="0" context="_815" access="public" location="f14:56" file="f14" line="56"/>
  <Destructor id="_2573" name="b2ContactID" artificial="1" throw="" context="_815" access="public" mangled="_ZN11b2ContactIDD1Ev *INTERNAL* " demangled="b2ContactID::~b2ContactID()" location="f14:54" file="f14" line="54" endline="54" inline="1">
  </Destructor>
  <OperatorMethod id="_2574" name="=" returns="_4346" artificial="1" throw="" context="_815" access="public" mangled="_ZN11b2ContactIDaSERKS_" demangled="b2ContactID::operator=(b2ContactID const&amp;)" location="f14:54" file="f14" line="54" endline="54" inline="1">
    <Argument type="_4347" location="f14:54" file="f14" line="54"/>
  </OperatorMethod>
  <Constructor id="_2575" name="b2ContactID" artificial="1" throw="" context="_815" access="public" mangled="_ZN11b2ContactIDC1ERKS_ *INTERNAL* " demangled="b2ContactID::b2ContactID(b2ContactID const&amp;)" location="f14:54" file="f14" line="54" endline="54" inline="1">
    <Argument type="_4347" location="f14:54" file="f14" line="54"/>
  </Constructor>
  <Constructor id="_2576" name="b2ContactID" artificial="1" throw="" context="_815" access="public" mangled="_ZN11b2ContactIDC1Ev *INTERNAL* " demangled="b2ContactID::b2ContactID()" location="f14:54" file="f14" line="54" inline="1"/>
  <OperatorMethod id="_2577" name="=" returns="_4348" artificial="1" throw="" context="_825" access="public" mangled="_ZN21b2DestructionListeneraSERKS_" demangled="b2DestructionListener::operator=(b2DestructionListener const&amp;)" location="f24:37" file="f24" line="37" endline="37" inline="1">
    <Argument type="_4349" location="f24:37" file="f24" line="37"/>
  </OperatorMethod>
  <Constructor id="_2578" name="b2DestructionListener" artificial="1" throw="" context="_825" access="public" mangled="_ZN21b2DestructionListenerC1ERKS_ *INTERNAL* " demangled="b2DestructionListener::b2DestructionListener(b2DestructionListener const&amp;)" location="f24:37" file="f24" line="37" endline="37" inline="1">
    <Argument type="_4349" location="f24:37" file="f24" line="37"/>
  </Constructor>
  <Constructor id="_2579" name="b2DestructionListener" artificial="1" throw="" context="_825" access="public" mangled="_ZN21b2DestructionListenerC1Ev *INTERNAL* " demangled="b2DestructionListener::b2DestructionListener()" location="f24:37" file="f24" line="37" endline="37" inline="1"/>
  <Destructor id="_2580" name="b2DestructionListener" virtual="1" overrides="" context="_825" access="public" mangled="_ZN21b2DestructionListenerD1Ev *INTERNAL* " demangled="b2DestructionListener::~b2DestructionListener()" location="f24:39" file="f24" line="39" endline="39" inline="1">
  </Destructor>
  <Method id="_2581" name="SayGoodbye" returns="_1374" virtual="1" pure_virtual="1" overrides="" context="_825" access="public" mangled="_ZN21b2DestructionListener10SayGoodbyeEP7b2Joint" demangled="b2DestructionListener::SayGoodbye(b2Joint*)" location="f24:43" file="f24" line="43" extern="1">
    <Argument name="joint" type="_3986" location="f24:43" file="f24" line="43"/>
  </Method>
